// AnimBlueprintGeneratedClass ABP-SMGL.ABP-SMGL_C
// Size: 0x2cff699c (Inherited: 0x2cff6ad0)
struct UABP-SMGL_C : UBravoHotelAnimInstanceWeapon {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3d0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x3d8(0x38)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x410(0x50)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x460(0xc8)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x528(0x18)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x540(0x18)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x558(0x50)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x5a8(0x50)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x5f8(0x18)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x610(0xa0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x6b0(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x6d0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x6f0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x710(0x110)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x820(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x840(0xb8)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x8f8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x918(0x20)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x940(0x210)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xb50(0xb8)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xc08(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xc28(0x110)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xd38(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xd58(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xe10(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xe40(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xe70(0x30)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0xea0(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xf68(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1020(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1050(0x30)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x1080(0x18)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1098(0x20)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x10c0(0x210)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x12d0(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x12f0(0xb8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x13a8(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1470(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1528(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1558(0x30)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1588(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x15a8(0x110)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x16b8(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x16d8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1790(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x17c0(0xa0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1860(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1880(0x110)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1990(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x19b0(0xb8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x1a68(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1b30(0x30)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1b60(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1c18(0x30)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1c48(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1d00(0x30)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1d30(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1de8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1e18(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1e48(0x30)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x1e80(0x210)
	struct FRotator IdleRotation; // 0x2090(0x0c)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP-SMGL.ABP-SMGL_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP-SMGL.ABP-SMGL_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void ExecuteUbergraph_ABP-SMGL(int32_t EntryPoint); // Function ABP-SMGL.ABP-SMGL_C.ExecuteUbergraph_ABP-SMGL // (Final|UbergraphFunction) // @ game+0x2bad3b0
};

