// AnimBlueprintGeneratedClass ABP-Jaguar.ABP-Jaguar_C
// Size: 0x2cff6a10 (Inherited: 0x2cff6a40)
struct UABP-Jaguar_C : UBravoHotelVehicleAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xa40(0x08)
	struct FAnimNode_LookAt AnimGraphNode_LookAt; // 0xa50(0x1d0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0xc20(0x100)
	struct FAnimNode_LookAt AnimGraphNode_LookAt; // 0xd20(0x1d0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0xef0(0x100)
	struct FAnimNode_LookAt AnimGraphNode_LookAt; // 0xff0(0x1d0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x11c0(0x100)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x12c0(0x100)
	struct FAnimNode_LookAt AnimGraphNode_LookAt; // 0x13c0(0x1d0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x1590(0x100)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x1690(0x100)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1790(0x20)
	struct FAnimNode_MeshSpaceRefPose AnimGraphNode_MeshRefPose; // 0x17b0(0x10)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x17c0(0xa0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x1860(0x100)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1960(0x20)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x1980(0x100)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x1a80(0x38)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x1ab8(0x100)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x1bb8(0x100)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x1cb8(0x100)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x1db8(0x100)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier; // 0x1eb8(0x100)
	struct FAnimNode_LookAt AnimGraphNode_LookAt; // 0x1fc0(0x1d0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier; // 0x2190(0x100)
	struct FAnimNode_LookAt AnimGraphNode_LookAt; // 0x2290(0x1d0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2460(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2488(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x24b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x24d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2500(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2528(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2550(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x25c8(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2600(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2678(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x26b0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2728(0x38)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2760(0xb0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2810(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2830(0xb8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x28e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2910(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2938(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2960(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2988(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x29b0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x29d8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2a50(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2a88(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2b00(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2b38(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2bb0(0x38)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2be8(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2c98(0xb8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x2d50(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2e10(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2e40(0xa0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x2ee0(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2fa8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2fd8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3008(0x30)
	struct FAnimNode_WheelHandler AnimGraphNode_WheelHandler; // 0x3038(0xe8)
	struct FAnimNode_MeshSpaceRefPose AnimGraphNode_MeshRefPose; // 0x3120(0x10)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3130(0x20)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3150(0xc0)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP-Jaguar.ABP-Jaguar_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_B4E46DA04232D436CA8AB7A7DF748FA0(); // Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_B4E46DA04232D436CA8AB7A7DF748FA0 // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_12D6BAAC48D8617280ABFE8702E64DBF(); // Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_12D6BAAC48D8617280ABFE8702E64DBF // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_13C224B849356C6D3DD37382826D0405(); // Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_13C224B849356C6D3DD37382826D0405 // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_242BED4B45B1A7FDAE9E439F69FD83EF(); // Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_242BED4B45B1A7FDAE9E439F69FD83EF // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_BAF725EF49AC581D85E7288C8F2C0291(); // Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_BAF725EF49AC581D85E7288C8F2C0291 // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_E80C90FB4B76E2B9607AC5AC0007B163(); // Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_E80C90FB4B76E2B9607AC5AC0007B163 // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_22F89B5F4C5458C220BE8B85DEDD2C33(); // Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_22F89B5F4C5458C220BE8B85DEDD2C33 // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_9E3117C348262890CD40EEB85D6D430D(); // Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_9E3117C348262890CD40EEB85D6D430D // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_EDDB324546E00AFEB5F013959ADD4C28(); // Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_EDDB324546E00AFEB5F013959ADD4C28 // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_4FDE95304315E46EFC294CA76F3A3A16(); // Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_4FDE95304315E46EFC294CA76F3A3A16 // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_D2D4D25442E67A69AFA5DD8EFFA3A785(); // Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_D2D4D25442E67A69AFA5DD8EFFA3A785 // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_28F578EE445E01B1F320658013D226AA(); // Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_28F578EE445E01B1F320658013D226AA // (BlueprintEvent) // @ game+0x2bad3b0
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP-Jaguar.ABP-Jaguar_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void AnimNotify_FPP_Entered_Idle(); // Function ABP-Jaguar.ABP-Jaguar_C.AnimNotify_FPP_Entered_Idle // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void AnimNotify_FPP_Left_Idle(); // Function ABP-Jaguar.ABP-Jaguar_C.AnimNotify_FPP_Left_Idle // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ExecuteUbergraph_ABP-Jaguar(int32_t EntryPoint); // Function ABP-Jaguar.ABP-Jaguar_C.ExecuteUbergraph_ABP-Jaguar // (Final|UbergraphFunction) // @ game+0x2bad3b0
};

