// AnimBlueprintGeneratedClass ABP-LobbyPawn.ABP-LobbyPawn_C
// Size: 0x2c00e698 (Inherited: 0x2cff6a80)
struct UABP-LobbyPawn_C : UBravoHotelLobbyAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x280(0x08)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x290(0x450)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x6e0(0x450)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0xb30(0x450)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0xf80(0x450)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x13d0(0x450)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1820(0x20)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x1840(0x450)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1c90(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1cb8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1ce0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1d08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1d30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1d58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1d80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1da8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1dd0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1e48(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1e80(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1ef8(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1f30(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1fa8(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1fe0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2058(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2090(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2108(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2140(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x21b8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2258(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x22d0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2370(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x23e8(0xa0)
	struct FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer; // 0x2488(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2500(0x38)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2538(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x25e8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x26a0(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x26d0(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2700(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2730(0x30)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x2760(0x450)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x2bb0(0x450)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x3000(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x3260(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x34c0(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x3720(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x3980(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x3be0(0x260)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController; // 0x3e40(0x130)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController; // 0x3f70(0x130)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController; // 0x40a0(0x130)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController; // 0x41d0(0x130)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController; // 0x4300(0x130)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController; // 0x4430(0x130)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController; // 0x4560(0x130)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController; // 0x4690(0x130)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x47c0(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x47e0(0xb8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4898(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4948(0x78)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x49c0(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4a80(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4af8(0x78)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x4b70(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4c30(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4ca8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4d20(0x78)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x4d98(0xd0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4e68(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4e98(0x30)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x4ec8(0xb8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4f80(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5020(0x78)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x5098(0xa0)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x5140(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x53a0(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x5600(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x5860(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x5ac0(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x5d20(0x260)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5f80(0x78)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x6000(0x260)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x6260(0x38)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x62a0(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x6500(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x6760(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x69c0(0x260)
	struct FAnimNode_LookAt AnimGraphNode_LookAt; // 0x6c20(0x1d0)
	struct FAnimNode_LookAt AnimGraphNode_LookAt; // 0x6df0(0x1d0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x6fc0(0xa0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x7060(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x7080(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x70a0(0x20)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x70c0(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x7320(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x7580(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x77e0(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x7a40(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x7ca0(0x260)
	struct FAnimNode_LookAt AnimGraphNode_LookAt; // 0x7f00(0x1d0)
	int32_t PawnIndex; // 0x80d0(0x04)
	int32_t IdleNum; // 0x80d4(0x04)
	struct UAnimSequence* IdleAnimSequence; // 0x80d8(0x08)
	struct ABP-LobbyPawn_C* CharacterRef; // 0x80e0(0x08)
	bool bIsMale; // 0x80e8(0x01)
	bool bIsEquippingWeapon; // 0x80e9(0x01)
	enum class EWeaponAnimationType WeaponAnimType; // 0x80ea(0x01)
	struct UAnimSequence* HandAnim; // 0x80f0(0x08)
	enum class EWeaponAttachmentGrip GripType; // 0x80f8(0x01)
	bool bIsEquippingNormalGrip; // 0x80f9(0x01)
	struct FVector HandL_Location; // 0x80fc(0x0c)
	struct FRotator HandL_Rotation; // 0x8108(0x0c)
	float LeftHandIK_Alpha; // 0x8114(0x04)
	struct FVector AnimDynamicsForce; // 0x8118(0x0c)
	float PrevCharacterRotationYaw; // 0x8124(0x04)
	float RightHandIK_Alpha; // 0x8128(0x04)
	bool bReady; // 0x812c(0x01)
	struct UAnimSequence* ReadyAnimSequence; // 0x8130(0x08)
	struct UAnimSequence* Readyon_AnimSequence; // 0x8138(0x08)
	struct UAnimSequence* Readyoff_AnimSequence; // 0x8140(0x08)
	float DeltaTimeX; // 0x8148(0x04)
	float HairAnimDynamicsAlpha; // 0x814c(0x04)
	struct FString ScenePage; // 0x8150(0x10)
	struct UAnimSequence* TournamentWinAnimSequence; // 0x8160(0x08)
	struct UAnimSequence* TournamentDefeatAnimSequence; // 0x8168(0x08)
	bool bIsTournamentWin; // 0x8170(0x01)
	bool bIsTournamentDefeat; // 0x8171(0x01)
	struct FMulticastInlineDelegate Event_TournamentWinAnimEnded; // 0x8178(0x10)
	struct FMulticastInlineDelegate Event_TournamentDefeatAnimEnded; // 0x8188(0x10)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP-LobbyPawn.ABP-LobbyPawn_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	bool IsNeedToApplyLeftHandIK(); // Function ABP-LobbyPawn.ABP-LobbyPawn_C.IsNeedToApplyLeftHandIK // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_TransitionResult_9E645A4D4DEC06D0A967F1923AAC5BE1(); // Function ABP-LobbyPawn.ABP-LobbyPawn_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_TransitionResult_9E645A4D4DEC06D0A967F1923AAC5BE1 // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_TransitionResult_04B16ED749103ED7679AC79EA68C0454(); // Function ABP-LobbyPawn.ABP-LobbyPawn_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_TransitionResult_04B16ED749103ED7679AC79EA68C0454 // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_TransitionResult_B1938DBB4FA07527E591E291B7304361(); // Function ABP-LobbyPawn.ABP-LobbyPawn_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_TransitionResult_B1938DBB4FA07527E591E291B7304361 // (BlueprintEvent) // @ game+0x2bad3b0
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP-LobbyPawn.ABP-LobbyPawn_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_TransitionResult_5F4429C24615D1D556AB4C92EB9C64DC(); // Function ABP-LobbyPawn.ABP-LobbyPawn_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_TransitionResult_5F4429C24615D1D556AB4C92EB9C64DC // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_BlendListByBool_33E4E39D4A02E4AC7B25D5A6078416FC(); // Function ABP-LobbyPawn.ABP-LobbyPawn_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_BlendListByBool_33E4E39D4A02E4AC7B25D5A6078416FC // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_BlendListByBool_FF6FDBD94EF98D630BE389A246785B0A(); // Function ABP-LobbyPawn.ABP-LobbyPawn_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_BlendListByBool_FF6FDBD94EF98D630BE389A246785B0A // (BlueprintEvent) // @ game+0x2bad3b0
	void AnimNotify_TournamentWinEndEvent(); // Function ABP-LobbyPawn.ABP-LobbyPawn_C.AnimNotify_TournamentWinEndEvent // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void AnimNotify_TournamentDefeatEndEvent(); // Function ABP-LobbyPawn.ABP-LobbyPawn_C.AnimNotify_TournamentDefeatEndEvent // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void AnimNotify_TournamentDefeatStartEvent(); // Function ABP-LobbyPawn.ABP-LobbyPawn_C.AnimNotify_TournamentDefeatStartEvent // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void AnimNotify_TournamentWinStartEvent(); // Function ABP-LobbyPawn.ABP-LobbyPawn_C.AnimNotify_TournamentWinStartEvent // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ExecuteUbergraph_ABP-LobbyPawn(int32_t EntryPoint); // Function ABP-LobbyPawn.ABP-LobbyPawn_C.ExecuteUbergraph_ABP-LobbyPawn // (Final|UbergraphFunction) // @ game+0x2bad3b0
	void Event_TournamentDefeatAnimEnded__DelegateSignature(); // Function ABP-LobbyPawn.ABP-LobbyPawn_C.Event_TournamentDefeatAnimEnded__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Event_TournamentWinAnimEnded__DelegateSignature(); // Function ABP-LobbyPawn.ABP-LobbyPawn_C.Event_TournamentWinAnimEnded__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
};

