// AnimBlueprintGeneratedClass ABP-InventoryPawn.ABP-InventoryPawn_C
// Size: 0x2c00e6d5 (Inherited: 0x2cff6a70)
struct UABP-InventoryPawn_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x270(0x08)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x278(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x338(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3b0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x428(0x78)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x4a0(0xc0)
	struct FAnimNode_HandIKRetargeting AnimGraphNode_HandIKRetargeting; // 0x560(0x138)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x6a0(0x210)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x8b0(0x20)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x8d0(0x210)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xae0(0x110)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xbf0(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xc10(0xb8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xcc8(0xd0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xd98(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xe10(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xe88(0x78)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xf00(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xfc0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1038(0x78)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x10b0(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1170(0x78)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x11e8(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1298(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1350(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1380(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1420(0x78)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1498(0xb8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1550(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x15c8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1668(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x16e0(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1780(0xb8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1838(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x18b0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1950(0x78)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x19c8(0xb8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1a80(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1af8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1b98(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1c10(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1cb0(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1ce0(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1d10(0x30)
	struct FAnimNode_HandIKRetargeting AnimGraphNode_HandIKRetargeting; // 0x1d40(0x138)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x1e80(0x210)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2090(0x20)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x20b0(0x210)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x22c0(0x110)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x23d0(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x23f0(0x78)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2468(0xd0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2538(0x78)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x25b0(0x20)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x25d0(0x450)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x2a20(0x450)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2e70(0x20)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x2e90(0x450)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x32e0(0x450)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x3730(0x450)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x3b80(0x450)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x3fd0(0x450)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x4420(0x450)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x4870(0x450)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x4cc0(0x450)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x5110(0x450)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5560(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x55d8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5678(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x56f0(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x5768(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5808(0x78)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x5880(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x5ae0(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x5d40(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x5fa0(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x6200(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x6460(0x260)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x66c0(0x78)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x6738(0xc0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x67f8(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x68a8(0x78)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x6920(0xb0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x69d0(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6a90(0x78)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x6b08(0xd0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6bd8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6c50(0x78)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x6cc8(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6d88(0x78)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x6e00(0xd0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6ed0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6f48(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6fc0(0x78)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x7038(0xd0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x7108(0x78)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController; // 0x7180(0x130)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController; // 0x72b0(0x130)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController; // 0x73e0(0x130)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController; // 0x7510(0x130)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController; // 0x7640(0x130)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController; // 0x7770(0x130)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController; // 0x78a0(0x130)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController; // 0x79d0(0x130)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x7b00(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x7d60(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x7fc0(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x8220(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x8480(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x86e0(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x8940(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x8ba0(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x8e00(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x9060(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x92c0(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x9520(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x9780(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x99e0(0x260)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x9c40(0x78)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x9cb8(0xd0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x9d88(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x9db8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x9de8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x9e18(0x30)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x9e48(0xb8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x9f00(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x9fc0(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xa078(0xb8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xa130(0xb0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0xa1e0(0x38)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0xa220(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0xa480(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0xa6e0(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0xa940(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0xaba0(0x260)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0xae00(0x260)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xb060(0xb8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xb118(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xb190(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xb208(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xb2a8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xb348(0x78)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xb3c0(0x30)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xb3f0(0xb8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xb4a8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xb520(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xb598(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xb638(0x30)
	struct ABravoHotelCharacter* Character; // 0xb668(0x08)
	enum class EWeaponAnimationType WeaponAnimType; // 0xb670(0x01)
	struct UAnimSequence* HandAnim; // 0xb678(0x08)
	struct FVector HandL_Location; // 0xb680(0x0c)
	struct FRotator HandL_Rotation; // 0xb68c(0x0c)
	struct ABP-CharacterRecording_C* Recorder; // 0xb698(0x08)
	enum class EWeaponAttachmentGrip GripType; // 0xb6a0(0x01)
	bool IsEquippingNormalGrip; // 0xb6a1(0x01)
	struct UAnimSequence* UnarmedIdlePose; // 0xb6a8(0x08)
	int32_t IdleNum; // 0xb6b0(0x04)
	bool bIsMale; // 0xb6b4(0x01)
	bool bIsEquippingGatling; // 0xb6b5(0x01)
	bool bIsEquippingRPG; // 0xb6b6(0x01)
	struct ABravoHotelInventoryCharacter* InventoryCharacter; // 0xb6b8(0x08)
	struct FVector AnimDynamicsForce; // 0xb6c0(0x0c)
	float PrevMeshRotationYaw; // 0xb6cc(0x04)
	float BoneDrivenValue; // 0xb6d0(0x04)
	bool bIsHUSState; // 0xb6d4(0x01)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP-InventoryPawn.ABP-InventoryPawn_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void UpdateAnimDynamicsForce(); // Function ABP-InventoryPawn.ABP-InventoryPawn_C.UpdateAnimDynamicsForce // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Get Preview Character Mesh(struct USkeletalMeshComponent*& Skeletal Mesh Component); // Function ABP-InventoryPawn.ABP-InventoryPawn_C.Get Preview Character Mesh // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void Get Current Preview Weapon(struct ABravoHotelWeaponBase*& Current Preview Weapon); // Function ABP-InventoryPawn.ABP-InventoryPawn_C.Get Current Preview Weapon // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void Update References(); // Function ABP-InventoryPawn.ABP-InventoryPawn_C.Update References // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	bool Get Is Equipping RPG(); // Function ABP-InventoryPawn.ABP-InventoryPawn_C.Get Is Equipping RPG // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	bool Get Is Equipping Gatling(); // Function ABP-InventoryPawn.ABP-InventoryPawn_C.Get Is Equipping Gatling // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP-InventoryPawn.ABP-InventoryPawn_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void ExecuteUbergraph_ABP-InventoryPawn(int32_t EntryPoint); // Function ABP-InventoryPawn.ABP-InventoryPawn_C.ExecuteUbergraph_ABP-InventoryPawn // (Final|UbergraphFunction|HasDefaults) // @ game+0x2bad3b0
};

