// AnimBlueprintGeneratedClass ABP-Quadski.ABP-Quadski_C
// Size: 0x2cffe6a9 (Inherited: 0x2cff6a40)
struct UABP-Quadski_C : UBravoHotelVehicleAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xa40(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0xa48(0x38)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xa80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xaa8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xad0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xaf8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xb20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xb48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xb70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xb98(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xbc0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0xc38(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xc70(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0xce8(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xd20(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0xd98(0x38)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xdd0(0x28)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xdf8(0x20)
	struct FAnimNode_MeshSpaceRefPose AnimGraphNode_MeshRefPose; // 0xe18(0x10)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xe28(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xec8(0x78)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xf40(0xc0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1000(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1020(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1040(0x110)
	struct FAnimNode_WheelHandler AnimGraphNode_WheelHandler; // 0x1150(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1238(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x12b0(0x38)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x12e8(0x100)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x13e8(0x100)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x14e8(0x100)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x15e8(0x100)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x16e8(0x100)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x17e8(0x100)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x18e8(0x100)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x19e8(0x100)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x1ae8(0x100)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x1be8(0x100)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x1ce8(0x100)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x1de8(0x100)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1ee8(0x20)
	struct FAnimNode_MeshSpaceRefPose AnimGraphNode_MeshRefPose; // 0x1f08(0x10)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1f18(0xa0)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x1fc0(0x450)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2410(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2430(0x110)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2540(0x20)
	struct FAnimNode_WheelHandler AnimGraphNode_WheelHandler; // 0x2560(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2648(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x26c0(0x38)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x26f8(0xb0)
	bool bIsAmphibiousMode; // 0x27a8(0x01)
	char pad_2CFF87A1[0x5f08]; // 0x2cff87a1(0x5f08)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP-Quadski.ABP-Quadski_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_C584BAB4475226CF5A96DA84563281E0(); // Function ABP-Quadski.ABP-Quadski_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_C584BAB4475226CF5A96DA84563281E0 // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_5B320C8249FFAA1FF5372BA69A6E9633(); // Function ABP-Quadski.ABP-Quadski_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_5B320C8249FFAA1FF5372BA69A6E9633 // (BlueprintEvent) // @ game+0x2bad3b0
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP-Quadski.ABP-Quadski_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void ExecuteUbergraph_ABP-Quadski(int32_t EntryPoint); // Function ABP-Quadski.ABP-Quadski_C.ExecuteUbergraph_ABP-Quadski // (Final|UbergraphFunction) // @ game+0x2bad3b0
};

