// AnimBlueprintGeneratedClass ABP_Camaro.ABP_Camaro_C
// Size: 0x2cff6a08 (Inherited: 0x2cff6a40)
struct UABP_Camaro_C : UBravoHotelVehicleAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xa40(0x08)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0xa48(0x100)
	struct FAnimNode_LookAt AnimGraphNode_LookAt; // 0xb50(0x1d0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0xd20(0x100)
	struct FAnimNode_LookAt AnimGraphNode_LookAt; // 0xe20(0x1d0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0xff0(0x100)
	struct FAnimNode_LookAt AnimGraphNode_LookAt; // 0x10f0(0x1d0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x12c0(0x100)
	struct FAnimNode_LookAt AnimGraphNode_LookAt; // 0x13c0(0x1d0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x1590(0x100)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1690(0x20)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x16b0(0x100)
	struct FAnimNode_MeshSpaceRefPose AnimGraphNode_MeshRefPose; // 0x17b0(0x10)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x17c0(0xa0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1860(0x20)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x1880(0x100)
	struct FAnimNode_WheelHandler AnimGraphNode_WheelHandler; // 0x1980(0xe8)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x1a68(0x100)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x1b68(0x38)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x1ba0(0x100)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x1ca0(0x100)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x1da0(0x100)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x1ea0(0x100)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier; // 0x1fa0(0x100)
	struct FAnimNode_LookAt AnimGraphNode_LookAt; // 0x20a0(0x1d0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier; // 0x2270(0x100)
	struct FAnimNode_LookAt AnimGraphNode_LookAt; // 0x2370(0x1d0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2540(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2568(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2590(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x25b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x25e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2608(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2630(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x26a8(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x26e0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2758(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2790(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2808(0x38)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2840(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x28f0(0xb8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x29a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x29d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x29f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2a20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2a48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2a70(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2a98(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2b10(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2b48(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2bc0(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2bf8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2c70(0x38)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2ca8(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2d58(0xb8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x2e10(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2ed0(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2f00(0xa0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x2fa0(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3068(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3098(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x30c8(0x30)
	struct FAnimNode_MeshSpaceRefPose AnimGraphNode_MeshRefPose; // 0x30f8(0x10)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3108(0xc0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x31c8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x31e8(0x20)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_Camaro.ABP_Camaro_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_B676CFA34CE7A52EF43EC0AB21A88407(); // Function ABP_Camaro.ABP_Camaro_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_B676CFA34CE7A52EF43EC0AB21A88407 // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_ECCAF0444D5429883EF85DBFE6C87835(); // Function ABP_Camaro.ABP_Camaro_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_ECCAF0444D5429883EF85DBFE6C87835 // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_8148B76C4329BC2F8A8243B4DC2EA5D6(); // Function ABP_Camaro.ABP_Camaro_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_8148B76C4329BC2F8A8243B4DC2EA5D6 // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_D3A6CEB64500CBDDAC6731982AA2B8CB(); // Function ABP_Camaro.ABP_Camaro_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_D3A6CEB64500CBDDAC6731982AA2B8CB // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_631723E04832D92DC95F69A67AD9A02F(); // Function ABP_Camaro.ABP_Camaro_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_631723E04832D92DC95F69A67AD9A02F // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_4F07996042D4157DCD054DAA17CBAFC0(); // Function ABP_Camaro.ABP_Camaro_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_4F07996042D4157DCD054DAA17CBAFC0 // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_09EF52904BA5FF006178DFBECCF4C9F1(); // Function ABP_Camaro.ABP_Camaro_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_09EF52904BA5FF006178DFBECCF4C9F1 // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_4FA9353648610A2F305F4285607D767D(); // Function ABP_Camaro.ABP_Camaro_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_4FA9353648610A2F305F4285607D767D // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_6DFFB4074DD63F36D8B6A29A65886B11(); // Function ABP_Camaro.ABP_Camaro_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_6DFFB4074DD63F36D8B6A29A65886B11 // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_991E42824386AA192671B1B4DC05B089(); // Function ABP_Camaro.ABP_Camaro_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_991E42824386AA192671B1B4DC05B089 // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_C073E4914C688292A9D5FFAEB8F80989(); // Function ABP_Camaro.ABP_Camaro_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_C073E4914C688292A9D5FFAEB8F80989 // (BlueprintEvent) // @ game+0x2bad3b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_6568699844C457EB1BC6FDB6052E5CB8(); // Function ABP_Camaro.ABP_Camaro_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_6568699844C457EB1BC6FDB6052E5CB8 // (BlueprintEvent) // @ game+0x2bad3b0
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_Camaro.ABP_Camaro_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void AnimNotify_FPP_Entered_Idle(); // Function ABP_Camaro.ABP_Camaro_C.AnimNotify_FPP_Entered_Idle // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void AnimNotify_FPP_Left_Idle(); // Function ABP_Camaro.ABP_Camaro_C.AnimNotify_FPP_Left_Idle // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ExecuteUbergraph_ABP_Camaro(int32_t EntryPoint); // Function ABP_Camaro.ABP_Camaro_C.ExecuteUbergraph_ABP_Camaro // (Final|UbergraphFunction) // @ game+0x2bad3b0
};

