// UserDefinedStruct AdvancedEffectFeaturesNoCustomDepth.AdvancedEffectFeaturesNoCustomDepth
// Size: 0x2cff692c (Inherited: 0x00)
struct FAdvancedEffectFeaturesNoCustomDepth {
	enum class BlendModes BlendMode_12_09737E6C44063CBE16D45A8896564C06; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct UTexture2D* BlendMask_15_664A106449FD3C01747ABC9174124057; // 0x08(0x08)
	struct FVector2DN BlendMaskScale_18_615A76A449B11B7912A0AEA82EB64EA5; // 0x10(0x08)
	float BlendDistance_23_BD484C304DC4B8E69152DA879158606B; // 0x18(0x04)
	float BlendDistanceSharpness_24_17B5A9EF45A85808BD4C3DB4D7A1BDE3; // 0x1c(0x04)
	bool BlendDistanceInvert_26_BAA4896D4DB1D15370EB73ABA02CBF01; // 0x20(0x01)
	char pad_21[0x3]; // 0x21(0x03)
	float BlendingOpacity_10_63DB57664274BA07E8C302A5DE11468B; // 0x24(0x04)
	int32_t EffectPriority_11_EDF854034FC93238C76D8FA5C8F7CD2F; // 0x28(0x04)
	char pad_2C[0x2cff6900]; // 0x2c(0x2cff6900)
};

