// BlueprintGeneratedClass BP-Jeep.BP-Jeep_C
// Size: 0x2cff69c1 (Inherited: 0x2cff6a68)
struct ABP-Jeep_C : ABP-DefaultGroundVehicle_C {
	struct UBravoHotelVehicleTireComponent* BravoHotelVehicleTire_RR; // 0xe68(0x08)
	struct UBravoHotelVehicleTireComponent* BravoHotelVehicleTire_RL; // 0xe70(0x08)
	struct UBravoHotelVehicleTireComponent* BravoHotelVehicleTire_FR; // 0xe78(0x08)
	struct UBravoHotelVehicleTireComponent* BravoHotelVehicleTire_FL; // 0xe80(0x08)
	struct UBP-DestructibleComponent_C* BP-DestructibleComponent3; // 0xe88(0x08)
	struct UBP-DestructibleComponent_C* BP-DestructibleComponent2; // 0xe90(0x08)
	struct UBP-DestructibleComponent_C* BP-DestructibleComponent0; // 0xe98(0x08)
	struct UBP-DestructibleComponent_C* BP-DestructibleComponent1; // 0xea0(0x08)
	struct UBravoHotelVehicleSeatComponent* BravoHotelVehicleSeat04; // 0xea8(0x08)
	struct UBravoHotelVehicleSeatComponent* BravoHotelVehicleSeat03; // 0xeb0(0x08)
	struct UBravoHotelVehicleSeatComponent* BravoHotelVehicleSeat02; // 0xeb8(0x08)
	bool bSnowy; // 0xec0(0x01)
};

