// BlueprintGeneratedClass BP-PlatedJeep_Blue.BP-PlatedJeep_Blue_C
// Size: 0x2cff6cf0 (Inherited: 0x2cff6a68)
struct ABP-PlatedJeep_Blue_C : ABP-DefaultGroundVehicle_C {
	struct UParticleSystemComponent* PS-Car_RearLight02; // 0xe68(0x08)
	struct UParticleSystemComponent* PS-Car_HeadLight06; // 0xe70(0x08)
	struct UParticleSystemComponent* PS-Car_HeadLight05; // 0xe78(0x08)
	struct UParticleSystemComponent* PS-Car_HeadLight04; // 0xe80(0x08)
	struct UParticleSystemComponent* PS-Car_HeadLight03; // 0xe88(0x08)
	struct UParticleSystemComponent* PS-Car_HeadLight02; // 0xe90(0x08)
	struct UParticleSystemComponent* PS-Car_RearLight01; // 0xe98(0x08)
	struct UParticleSystemComponent* PS-Car_HeadLight01; // 0xea0(0x08)
	struct UBravoHotelVehicleTireComponent* BravoHotelVehicleTire_RR; // 0xea8(0x08)
	struct UBravoHotelVehicleTireComponent* BravoHotelVehicleTire_RL; // 0xeb0(0x08)
	struct UBravoHotelVehicleTireComponent* BravoHotelVehicleTire_FR; // 0xeb8(0x08)
	struct UBravoHotelVehicleTireComponent* BravoHotelVehicleTire_FL; // 0xec0(0x08)
	struct UBP-DestructibleComponent_C* BP-DestructibleComponent1; // 0xec8(0x08)
	struct UBP-DestructibleComponent_C* BP-DestructibleComponent; // 0xed0(0x08)
	struct UBravoHotelVehicleSeatComponent* BravoHotelVehicleSeat04; // 0xed8(0x08)
	struct UBravoHotelVehicleSeatComponent* BravoHotelVehicleSeat03; // 0xee0(0x08)
	struct UBravoHotelVehicleSeatComponent* BravoHotelVehicleSeat02; // 0xee8(0x08)
	char pad_2CFF6AF0[0x200]; // 0x2cff6af0(0x200)
};

