// BlueprintGeneratedClass BP-PlatedJeep.BP-PlatedJeep_C
// Size: 0x2cff6cb0 (Inherited: 0x2cff6a68)
struct ABP-PlatedJeep_C : ABP-DefaultGroundVehicle_C {
	struct UBravoHotelVehicleTireComponent* BravoHotelVehicleTire_RR; // 0xe68(0x08)
	struct UBravoHotelVehicleTireComponent* BravoHotelVehicleTire_RL; // 0xe70(0x08)
	struct UBravoHotelVehicleTireComponent* BravoHotelVehicleTire_FR; // 0xe78(0x08)
	struct UBravoHotelVehicleTireComponent* BravoHotelVehicleTire_FL; // 0xe80(0x08)
	struct UBP-DestructibleComponent_C* BP-DestructibleComponent1; // 0xe88(0x08)
	struct UBP-DestructibleComponent_C* BP-DestructibleComponent; // 0xe90(0x08)
	struct UBravoHotelVehicleSeatComponent* BravoHotelVehicleSeat04; // 0xe98(0x08)
	struct UBravoHotelVehicleSeatComponent* BravoHotelVehicleSeat03; // 0xea0(0x08)
	struct UBravoHotelVehicleSeatComponent* BravoHotelVehicleSeat02; // 0xea8(0x08)
	char pad_2CFF6AB0[0x200]; // 0x2cff6ab0(0x200)
};

