// BlueprintGeneratedClass BP_GameSettings.BP_GameSettings_C
// Size: 0x2cff6b1d (Inherited: 0x2cff6ab0)
struct UBP_GameSettings_C : UBravoHotelLocalSavedSettings {
	float Look Horizontal Sensitivity; // 0x1b0(0x04)
	float Look Vertical Sensitivity; // 0x1b4(0x04)
	bool Look Horizontal Invert; // 0x1b8(0x01)
	bool Look Vertical Invert; // 0x1b9(0x01)
	struct TScriptInterface<IBPI_GameSettingsInterface_C> Game Settings Interface; // 0x1c0(0x10)
	struct FString Save File Name; // 0x1d0(0x10)
	int32_t Save File User Index; // 0x1e0(0x04)
	struct TArray<struct FSAudioUpdateStruct> AudioEmittors; // 0x1e8(0x10)
	float Audio Multiplier Master; // 0x1f8(0x04)
	float Audio Multiplier Music; // 0x1fc(0x04)
	float Audio Multiplier Voice; // 0x200(0x04)
	float Audio Multiplier Effect; // 0x204(0x04)
	float Audio Multiplier Ambient; // 0x208(0x04)
	float Audio Multiplier UI; // 0x20c(0x04)
	float Volume Master; // 0x210(0x04)
	float Volume Music; // 0x214(0x04)
	float Volume Voice; // 0x218(0x04)
	float Volume Effect; // 0x21c(0x04)
	float Volume Ambient; // 0x220(0x04)
	int32_t Video X Resolution; // 0x224(0x04)
	int32_t Video Y Resolution; // 0x228(0x04)
	struct TArray<struct UCameraComponent*> Camera List; // 0x230(0x10)
	enum class EWindowMode Screen Mode; // 0x240(0x01)
	int32_t Resolution Scale Quality; // 0x244(0x04)
	float View Distance Scale; // 0x248(0x04)
	int32_t Anti Aliasing Quality; // 0x24c(0x04)
	int32_t Post Processing Quality; // 0x250(0x04)
	int32_t Shadow Quality; // 0x254(0x04)
	int32_t Texture Quality; // 0x258(0x04)
	int32_t Effect Quality; // 0x25c(0x04)
	int32_t Foliage Quality; // 0x260(0x04)
	float Field Of View FOV; // 0x264(0x04)
	float Motion Blur Strength; // 0x268(0x04)
	bool VSync Enabled; // 0x26c(0x01)
	bool My Custom Checkbox; // 0x26d(0x01)
	int32_t My Custom RadioBox; // 0x270(0x04)
	float My Custom Slider; // 0x274(0x04)
	float Bloom Intensity; // 0x278(0x04)
	float Gamma Intensity; // 0x27c(0x04)
	float Gain Intensity; // 0x280(0x04)
	struct UBP_GameSettings_C* Previous Setting State; // 0x288(0x08)
	struct FString My Custom Combobox; // 0x290(0x10)
	float Current Frame Time; // 0x2a0(0x04)
	struct TArray<struct UBP_KeyAction_C*> Key Actions; // 0x2a8(0x10)
	struct TArray<struct UBP_KeyInput_C*> Input Float Axis List; // 0x2b8(0x10)
	struct TArray<struct FSKeyActionSave> Saved Key Inputs; // 0x2c8(0x10)
	float Volume UI; // 0x2d8(0x04)
	enum class EWindowMode Old ScreenMode State; // 0x2dc(0x01)
	float TemporalAAFilterSize; // 0x2e0(0x04)
	bool TemporalAACatmullRom; // 0x2e4(0x01)
	bool TemporalAAPauseCorrect; // 0x2e5(0x01)
	float TemporalAACurrentFrameWeight; // 0x2e8(0x04)
	int32_t TemporalAASamples; // 0x2ec(0x04)
	float TonemapperSharpen; // 0x2f0(0x04)
	float MinBrightness; // 0x2f4(0x04)
	float MaxBrightness; // 0x2f8(0x04)
	float Contrast; // 0x2fc(0x04)
	bool PostProcessVolume; // 0x300(0x01)
	bool ScreenModeChange; // 0x301(0x01)
	bool FilmToe; // 0x302(0x01)
	float ColorGrading Global Gamma; // 0x304(0x04)
	bool ClearFog; // 0x308(0x01)
	int32_t ViewDistanceQuality; // 0x30c(0x04)
	int32_t ScalabilityQuality; // 0x310(0x04)
	int32_t CurrentFileVersion; // 0x314(0x04)
	int32_t UpdateFileVersion; // 0x318(0x04)
	bool Smooth Frame Enabled; // 0x31c(0x01)

	void SetAutoReloadSetting(bool Value, bool Apply, bool& Result); // Function BP_GameSettings.BP_GameSettings_C.SetAutoReloadSetting // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void GetAutoReloadSetting(bool& autoReload); // Function BP_GameSettings.BP_GameSettings_C.GetAutoReloadSetting // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void ModifyAutoReloadSetting(enum class EModifySetting Modify); // Function BP_GameSettings.BP_GameSettings_C.ModifyAutoReloadSetting // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Get Smooth Frame Rate(bool& Value); // Function BP_GameSettings.BP_GameSettings_C.Get Smooth Frame Rate // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
