// Class BravoHotelGame.AmbientSoundVolume
// Size: 0x2cff6a58 (Inherited: 0x2cff6a40)
struct AAmbientSoundVolume : AVolume {
	struct FString Ambience; // 0x340(0x10)
	int32_t Priority; // 0x350(0x04)
	char pad_2CFF6A54[0x4]; // 0x2cff6a54(0x04)

	void OnOverlapEnd(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function BravoHotelGame.AmbientSoundVolume.OnOverlapEnd // (Final|Native|Protected) // @ game+0x2215e30
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function BravoHotelGame.AmbientSoundVolume.OnOverlapBegin // (Final|Native|Protected|HasOutParms) // @ game+0x2215c20
};

// Class BravoHotelGame.AnimNotifyState_PlaySound
// Size: 0x2cff6a60 (Inherited: 0x2cff6a38)
struct UAnimNotifyState_PlaySound : UAnimNotifyState {
	struct USoundBase* Sound; // 0x38(0x08)
	float VolumeMultiplier; // 0x40(0x04)
	float PitchMultiplier; // 0x44(0x04)
	char bFollow : 1; // 0x48(0x01)
	struct FName AttachName; // 0x4c(0x0c)
	char pad_2CFF6A54_1 : 7; // 0x2cff6a54(0x01)
	char pad_2CFF6A55[0xb]; // 0x2cff6a55(0x0b)
};

// Class BravoHotelGame.BravoHotelGameModeBase
// Size: 0x2cff6af8 (Inherited: 0x2cff6af8)
struct ABravoHotelGameModeBase : AGameMode {
};

// Class BravoHotelGame.BravoHotelGameMode
// Size: 0x2cff6ad0 (Inherited: 0x2cff6af8)
struct ABravoHotelGameMode : ABravoHotelGameModeBase {
	bool bFriendlyFire; // 0x3fc(0x01)
	enum class EMatchingType MatchingType; // 0x3ff(0x01)
	struct TMap<char, struct FTeamInfo> TeamInfoMap; // 0x408(0x50)
	struct TMap<struct FString, struct FTournamentQualifyingTeamInfo> TournamentQualifyingTeamInfoMap; // 0x458(0x50)
	int32_t TeamSize; // 0x4a8(0x04)
	struct TMap<struct FString, struct APlayerController*> PCReceivedPlayerInfos; // 0x550(0x50)
	struct AAIController* TestAIControllerClass; // 0x5a0(0x08)
	bool UsingOuterBlueZone; // 0x639(0x01)
	struct FName SelectedPlayZoneName; // 0x63c(0x0c)
	struct ABravoHotelBlueZone* BlueZoneClass; // 0x648(0x08)
	struct FString CQRType; // 0x650(0x10)
	struct ABravoHotelBlueZone* BlueZone; // 0x6c8(0x08)
	struct FName BlueZoneSpawnRateKey; // 0x6d4(0x0c)
	struct TMap<struct FName, struct FAreaSpawnRateInfo> AreaSpawnRateList; // 0x6e0(0x50)
	struct FAreaSpawnRateInfo BlueZoneSpawnRateInfo; // 0x730(0x88)
	struct UCurveFloat* VehicleSpawnRateCurve; // 0x7b8(0x08)
	struct TMap<struct FName, struct FVehicleAreaSpawnRateInfo> VehicleAreaSpawnRateList; // 0x7c0(0x50)
	bool ItemSpawnInBlueZone; // 0x810(0x01)
	struct FVehicleAreaSpawnRateInfo VehicleBlueZoneSpawnRateInfo; // 0x818(0x78)
	struct FLocalSpawnRate CustomVehicleBlueZoneSpawnRateInfo; // 0x890(0x28)
	struct TMap<struct FName, struct FLocalSpawnRate> CustomVehicleAreaSpawnRateList; // 0x8b8(0x50)
	struct FName VehicleBlueZoneSpawnRateKey; // 0x908(0x0c)
	struct FVehicleAreaSpawnRateInfo NoneVehicleData; // 0x918(0x78)
	bool UsingMaxVehicleSpawnCount; // 0x990(0x01)
	int32_t MaxVehicleSpawnCount; // 0x994(0x04)
	int32_t CurrentSpawnVehicleCount; // 0x998(0x04)
	bool DisivisonComplete; // 0x99c(0x01)
	int32_t EnabledPlayFeatures; // 0x9a0(0x04)

	void SetTestAIChangeLocation(struct AAIController* AIController); // Function BravoHotelGame.BravoHotelGameMode.SetTestAIChangeLocation // (Final|Native|Public) // @ game+0x2313490
	struct FString GetSpawnAreaName(struct AController* Player); // Function BravoHotelGame.BravoHotelGameMode.GetSpawnAreaName // (Final|Native|Protected|BlueprintCallable) // @ game+0x23133b0
	float GetCurrentOutOfCircleDamage(); // Function BravoHotelGame.BravoHotelGameMode.GetCurrentOutOfCircleDamage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2313380
	struct ABravoHotelBlueZone* GetBlueZone(); // Function BravoHotelGame.BravoHotelGameMode.GetBlueZone // (Final|Native|Public) // @ game+0x2313350
};

// Class BravoHotelGame.BattleRoyaleGameMode
// Size: 0x2cff6a78 (Inherited: 0x2cff6ad0)
struct ABattleRoyaleGameMode : ABravoHotelGameMode {
	struct TArray<struct APlayerState*> RemovePendingPlayerArray; // 0x9d0(0x10)
	enum class EGameViewType GameViewType; // 0x9e0(0x01)
	struct FString Training; // 0x9e8(0x10)
	struct FString Clean; // 0xa00(0x10)
	int32_t AIGrade; // 0xa10(0x04)
	struct FMulticastInlineDelegate UpdateSurvivalCircleDelegate; // 0xa18(0x10)
	struct UBravoHotelScenarioComponent* ScenarioComponent; // 0xa28(0x08)
	char WinnerTeamIndex; // 0xa58(0x01)
	struct TArray<struct FString> SendPlayerEndedEvent; // 0xa60(0x10)
	struct TArray<int32_t> SendPlayerRankedEvent; // 0xa70(0x10)
	struct APawn* AircraftViewPawnClass; // 0xa98(0x08)
	struct APawn* AircraftFlightPawnClass; // 0xaa0(0x08)
	bool bAutoStart; // 0xaa8(0x01)
	float StartingPlayerCountRate; // 0xaac(0x04)
	int32_t WaitingTime; // 0xab0(0x04)
	int32_t ReadyTime; // 0xab4(0x04)
	int32_t DescentDelay; // 0xab8(0x04)
	int32_t DescentableTime; // 0xabc(0x04)
	struct ABravoHotelAircraftFlight* AircraftFlight; // 0xac0(0x08)
	bool bIsUseAircraft; // 0xac8(0x01)
	bool bUseAircraftViewPawn; // 0xadd(0x01)
	bool bEndlessGame; // 0xade(0x01)
	struct ABravoHotelRedZoneManager* RedZoneManagerClass; // 0xaf8(0x08)
	struct ABravoHotelRedZoneManager* RedZoneManager; // 0xb00(0x08)
	struct ABHPersonalSupplyBoxManager* PersonalSupplyBoxManagerClass; // 0xb08(0x08)
	struct ABHPersonalSupplyBoxManager* PersonalSupplyBoxManager; // 0xb10(0x08)
	struct FLogBuildCountData DivisionItemCountResult; // 0xb18(0x10)
	struct FStandardGroupKeyCountInfo StandardGroupKeyCountInfo; // 0xd28(0x58)
	struct FAreaSpawnRateInfo NoneData; // 0xd80(0x88)
	struct FLocalSpawnRate CustomBlueZoneSpawnRateInfo; // 0xe08(0x28)
	struct TMap<struct FName, struct FLocalSpawnRate> CustomAreaSpawnRateList; // 0xe30(0x50)
	float ItemDivisionDelay; // 0xe88(0x04)
	bool UsingWorldItemSpawnTalbeInBlueZone; // 0xe8c(0x01)
	bool UnlimitItemSpawnCnt; // 0xe8d(0x01)
	int32_t MaxItemDivisionCountAtOnce; // 0xe90(0x04)
	bool ItemDivisionLevelLoadComplet; // 0xe94(0x01)
	bool ItemDivisionGameReady; // 0xe95(0x01)
	bool UsingMaxPickUpItemSpawnCount; // 0xe96(0x01)
	int32_t MaxPickUpItemSpawnCount; // 0xe98(0x04)
	int32_t MaxPickUpVehicleSpawnCount; // 0xe9c(0x04)
	bool UsingDynamicMaxPickUpItemSpawnCount; // 0xea0(0x01)
	struct FItemSpawnLimitInfo ItemSpawnLimitInfo; // 0xea4(0x14)
	bool GCRecordData; // 0xeb8(0x01)
	struct FString GCRecordDataTitle; // 0xec0(0x10)
	bool RecordBuildingData; // 0xed0(0x01)
	bool RecordPersonalSupplyBoxData; // 0xed1(0x01)
	bool RecordItemTimeInfoData; // 0xed2(0x01)
	int32_t LimitCountOfDamageInfo; // 0xed4(0x04)
	struct UCurveFloat* ItemSpawnRateCurve; // 0xed8(0x08)
	int32_t CurrentDivisionItemCount; // 0xee0(0x04)
	struct TArray<struct ABravoHotelCharacter*> CheckCharacters; // 0xf00(0x10)
	struct TArray<struct FLoadBuildingInfo> LoadCompleteList; // 0xf20(0x10)
	struct TArray<struct FVector> AIMajorPoints; // 0xf38(0x10)
	struct TArray<int32_t> AIMajorPointIndexList; // 0xf48(0x10)
	struct TArray<int32_t> AutoBotIds; // 0xf58(0x10)
	struct TArray<int32_t> AutoBotInfoSendIDList; // 0xf68(0x10)

	void UpdateSurvivalCircleDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode.UpdateSurvivalCircleDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void UpdateItemSpawnState(); // Function BravoHotelGame.BattleRoyaleGameMode.UpdateItemSpawnState // (Final|Native|Public) // @ game+0x22168d0
	void UpdateCheckStartPlayCharacters(); // Function BravoHotelGame.BattleRoyaleGameMode.UpdateCheckStartPlayCharacters // (Final|Native|Private) // @ game+0x22168b0
	void ServerCheat(bool Active, enum class EDediGameCheatType Type); // Function BravoHotelGame.BattleRoyaleGameMode.ServerCheat // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x22167e0
	void OnBattleRoyalStateChanged(enum class EBattleRoyaleState PrevState, enum class EBattleRoyaleState CurrentState); // Function BravoHotelGame.BattleRoyaleGameMode.OnBattleRoyalStateChanged // (Final|Native|Public) // @ game+0x2216720
	struct ABravoHotelRedZoneManager* GetRedZoneManager(); // Function BravoHotelGame.BattleRoyaleGameMode.GetRedZoneManager // (Final|Native|Public) // @ game+0x22166f0
	enum class EBattleRoyaleState GetBattleRoyaleState(); // Function BravoHotelGame.BattleRoyaleGameMode.GetBattleRoyaleState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22166c0
	void DestroyRedZoneManager(); // Function BravoHotelGame.BattleRoyaleGameMode.DestroyRedZoneManager // (Final|Native|Public) // @ game+0x22166a0
	bool CreateRedZoneManager(); // Function BravoHotelGame.BattleRoyaleGameMode.CreateRedZoneManager // (Final|Native|Public) // @ game+0x2216670
	void Cheat(bool Active, int8_t Type); // Function BravoHotelGame.BattleRoyaleGameMode.Cheat // (Final|Exec|Native|Public) // @ game+0x22165b0
	void AddAIPlayerByTimer(bool bByTimer); // Function BravoHotelGame.BattleRoyaleGameMode.AddAIPlayerByTimer // (Final|Native|Public) // @ game+0x2216520
};

// Class BravoHotelGame.BattleRoyaleGameMode_Login
// Size: 0x2cff6a58 (Inherited: 0x2cff6af8)
struct ABattleRoyaleGameMode_Login : ABravoHotelGameModeBase {
	float MatchingTimeout; // 0x3f8(0x04)
	struct TArray<struct FPlayerPawnList> PlayerPawnList; // 0x400(0x10)
	struct ACharacter* CustomizeCharacter; // 0x410(0x08)
	struct ACharacter* RankingCharacter; // 0x418(0x08)
	struct USkeletalMeshComponent* AppearingMotionCharacter; // 0x420(0x08)
	struct FTimerHandle Loading_TimerHandle; // 0x540(0x08)
	struct FTimerHandle PartyInfo_TimerHandle; // 0x548(0x08)
	struct FTimerHandle Ping_TimerHandle; // 0x550(0x08)
	struct FTimerHandle GeeGeeLoginToken_TimerHandle; // 0x558(0x08)
	struct FTimerHandle SteamLoginToken_TimerHandle; // 0x560(0x08)
	struct FTimerHandle AveragePingRequest_TimerHandle; // 0x568(0x08)
	struct FTimerHandle DuplicatedReconnectTimeout_TimerHandle; // 0x570(0x08)
	struct FTimerHandle UpdateWeaponAsyncLoad_TimerHandle; // 0x578(0x08)
	struct TArray<struct FSteamDlcDownloadInfo> SteamDlcDownloads; // 0x588(0x10)
	struct FMulticastInlineDelegate OnLoginSucceeded; // 0x598(0x10)
	struct FMulticastInlineDelegate OnLoginNotify; // 0x5a8(0x10)
	struct FMulticastInlineDelegate OnLoginFailed; // 0x5b8(0x10)
	struct FMulticastInlineDelegate OnMatchingPending; // 0x5c8(0x10)
	struct FMulticastInlineDelegate OnMatchingStarted; // 0x5d8(0x10)
	struct FMulticastInlineDelegate OnMatchingSucceeded; // 0x5e8(0x10)
	struct FMulticastInlineDelegate OnMatchingFailed; // 0x5f8(0x10)
	struct FMulticastInlineDelegate OnPartyInvited; // 0x608(0x10)
	struct FMulticastInlineDelegate OnPartyInfoChanged; // 0x618(0x10)
	struct FMulticastInlineDelegate OnCreateCharacter; // 0x628(0x10)
	struct FMulticastInlineDelegate OnTrainingModeOffDelegate; // 0x638(0x10)

	void UpdatePCInfo(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.UpdatePCInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x2219020
	void TurnOnOffPlayAssist(bool bFlag, int32_t GoalLevel, struct FBravoHotelPartyInfo& InPartyInfo, bool bIgnoreFirstCheckingFlag); // Function BravoHotelGame.BattleRoyaleGameMode_Login.TurnOnOffPlayAssist // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x2218e20
	void StartTutorialPlay(bool bOpeningTutorial); // Function BravoHotelGame.BattleRoyaleGameMode_Login.StartTutorialPlay // (Final|Native|Public|BlueprintCallable) // @ game+0x2218d90
	void StartTrainingPlay(struct FString OptionString); // Function BravoHotelGame.BattleRoyaleGameMode_Login.StartTrainingPlay // (Final|Native|Public|BlueprintCallable) // @ game+0x2218ca0
	void StartStandalonePlay(struct FString OptionString); // Function BravoHotelGame.BattleRoyaleGameMode_Login.StartStandalonePlay // (Final|Native|Public|BlueprintCallable) // @ game+0x2218bb0
	void StartLoginEx(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.StartLoginEx // (Final|Native|Public|BlueprintCallable) // @ game+0x2218b90
	void StartLogin(struct TMap<struct FString, struct FString>& AppIDs, struct TMap<struct FString, struct FString>& LoginKeys, enum class ELoginType Type); // Function BravoHotelGame.BattleRoyaleGameMode_Login.StartLogin // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2218960
	void StartCombineTutorialPlay(bool bOpeningTutorial); // Function BravoHotelGame.BattleRoyaleGameMode_Login.StartCombineTutorialPlay // (Final|Native|Public|BlueprintCallable) // @ game+0x22188d0
	void ShowValidationFailedPopup(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.ShowValidationFailedPopup // (Final|Native|Protected|BlueprintCallable) // @ game+0x22188b0
	void SetVisibleRankingCharacter(bool bState); // Function BravoHotelGame.BattleRoyaleGameMode_Login.SetVisibleRankingCharacter // (Final|Native|Public|BlueprintCallable) // @ game+0x2218820
	void SetRankingCharacter(struct ACharacter* SpawnCharacter); // Function BravoHotelGame.BattleRoyaleGameMode_Login.SetRankingCharacter // (Final|Native|Public|BlueprintCallable) // @ game+0x22187a0
	void SetPawnList(struct TArray<struct ACharacter*>& PawnList); // Function BravoHotelGame.BattleRoyaleGameMode_Login.SetPawnList // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x22186f0
	void SetCustomizeCharacter(struct ACharacter* SpawnCustomizeCharacter); // Function BravoHotelGame.BattleRoyaleGameMode_Login.SetCustomizeCharacter // (Final|Native|Public|BlueprintCallable) // @ game+0x2218670
	void SetAppearingMotionCharacter(struct USkeletalMeshComponent* MeshComponent); // Function BravoHotelGame.BattleRoyaleGameMode_Login.SetAppearingMotionCharacter // (Final|Native|Public|BlueprintCallable) // @ game+0x22185f0
	void SendTrainingModeOff(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.SendTrainingModeOff // (Final|Native|Public|BlueprintCallable) // @ game+0x22185d0
	void ResponseTrainingModeOff__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.ResponseTrainingModeOff__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void PartyInvited__DelegateSignature(struct FBravoHotelPartyInvitation& Invitation); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.PartyInvited__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x2bad3b0
	void PartyInfoChanged__DelegateSignature(struct FBravoHotelPartyInfo& PartyInfo); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.PartyInfoChanged__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x2bad3b0
	void OnReadFriendsListComplete(int32_t LocalPlayerNum, bool bWasSuccessful, struct FString ListName, struct FString PlatformName); // Function BravoHotelGame.BattleRoyaleGameMode_Login.OnReadFriendsListComplete // (Final|Native|Protected) // @ game+0x2218450
	void MatchingSucceeded__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.MatchingSucceeded__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void MatchingStarted__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.MatchingStarted__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void MatchingSettingsChanged__DelegateSignature(struct FBravoHotelMatchingSettings& Settings); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.MatchingSettingsChanged__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x2bad3b0
	void MatchingPending__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.MatchingPending__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void MatchingFailed__DelegateSignature(int32_t ErrorCode, struct FString ExtraDescription); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.MatchingFailed__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void LoginSucceeded__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.LoginSucceeded__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void LoginNotify__DelegateSignature(struct FString Parameters); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.LoginNotify__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void LoginFailed__DelegateSignature(int32_t ErrorCode, struct FString ExtraDescription); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.LoginFailed__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void LocalPawnEquipAttachment(enum class EWeaponAttachmentType& AttachmentType, enum class EWeaponAttachmentItem& AttachmentItem); // Function BravoHotelGame.BattleRoyaleGameMode_Login.LocalPawnEquipAttachment // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x2218370
	bool IsValidationPassed(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.IsValidationPassed // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x2218340
	struct TArray<struct FString> GetServicePlatforms(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.GetServicePlatforms // (Final|Native|Public|BlueprintCallable) // @ game+0x2218260
	struct FString GetServicePlatformName(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.GetServicePlatformName // (Final|Native|Public|BlueprintCallable) // @ game+0x22181e0
	void GetLocalPlayerLevel(int32_t& outLevel, float& outExpPercent); // Function BravoHotelGame.BattleRoyaleGameMode_Login.GetLocalPlayerLevel // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x2218100
	struct ABravoHotelCharacter* GetLobbyPawn(int32_t Index); // Function BravoHotelGame.BattleRoyaleGameMode_Login.GetLobbyPawn // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x2218070
	struct ABravoHotelCharacter* GetCustomizePawn(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.GetCustomizePawn // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x2218040
	void EquipDefaultWeapon(struct ABravoHotelCharacter* TargetCharacter, struct FName& ItemRowName, int32_t TargetWeaponSlotIndex); // Function BravoHotelGame.BattleRoyaleGameMode_Login.EquipDefaultWeapon // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x2217f30
	void DestroyAllWeapons(struct ABravoHotelCharacter* TargetCharacter); // Function BravoHotelGame.BattleRoyaleGameMode_Login.DestroyAllWeapons // (Final|Native|Public|BlueprintCallable) // @ game+0x2217eb0
	void CreateCharacter__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.CreateCharacter__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
};

// Class BravoHotelGame.BattleRoyaleGameMode_StoreWeb
// Size: 0x2cff6af8 (Inherited: 0x2cff6af8)
struct ABattleRoyaleGameMode_StoreWeb : ABravoHotelGameModeBase {

	void ChangeLevel(struct FString NextLevelName); // Function BravoHotelGame.BattleRoyaleGameMode_StoreWeb.ChangeLevel // (Final|Native|Public|BlueprintCallable) // @ game+0x22191c0
};

// Class BravoHotelGame.BravoHotelGameState
// Size: 0x2cff6ae0 (Inherited: 0x2cff6a80)
struct ABravoHotelGameState : AGameState {
	struct FMulticastInlineDelegate OnChangedMapModeDelegate; // 0x380(0x10)
	char MatchWinnerTeam; // 0x398(0x01)
	struct ABravoHotelPlayerState* WinnerPlayerState; // 0x3a0(0x08)
	int32_t TimeRemaining; // 0x3a8(0x04)
	struct FName CurrentSeasonID; // 0x3ac(0x0c)
	struct FName CurrentMapMode; // 0x3b8(0x0c)
	int32_t PerkMode; // 0x3c4(0x04)
	int32_t RecipeMode; // 0x3c8(0x04)
	int32_t MaxPerkCount; // 0x3cc(0x04)
	int32_t OverrideUltimateLevel; // 0x3d0(0x04)
	struct TMap<struct FName, int32_t> PerkClassNumCap; // 0x3d8(0x50)
	struct TMap<struct FName, float> PerkClassWeightModifier; // 0x428(0x50)
	struct TArray<struct FName> PerkClassBlock; // 0x478(0x10)
	bool bBlockSpawnVehicle; // 0x488(0x01)
	bool bBlockRedZone; // 0x489(0x01)
	bool PerkLevelUpAllUserSame; // 0x48a(0x01)
	struct FString CQRKey; // 0x490(0x10)
	enum class EGameViewType GameViewType; // 0x4a0(0x01)
	enum class EMatchingType MatchingType; // 0x4a1(0x01)
	struct FDateTime StartGameTime; // 0x4a8(0x08)
	struct FName ExpertWeaponTableID; // 0x4b0(0x0c)
	int32_t PersonalSupplyBoxPositionType; // 0x4bc(0x04)
	bool NoDelaySpawnPersonalSupplyBox; // 0x4c0(0x01)
	bool MustSpawnPersonalSupplyBox; // 0x4c1(0x01)
	int32_t RetiredPlayerCount; // 0x4c4(0x04)
	bool bDrawGame; // 0x4e0(0x01)
	bool bCancelGame; // 0x4e1(0x01)
	struct TMap<int32_t, struct ABravoHotelPlayerState*> UniqueIDPlayerStates; // 0x4e8(0x50)
	struct FString MatchID; // 0x538(0x10)
	struct FString GameServerID; // 0x548(0x10)
	struct FString MatchMakingTag; // 0x558(0x10)
	struct FMatchModeInfo MatchModeInfo; // 0x568(0x30)
	struct FRawTournamentInfo RawTournamentInfo; // 0x598(0xd8)
	struct FGameSettingClassSelectInfoElement DefaultClassSelectInfo; // 0x6d0(0x28)
	struct FGameSettingClassChangeInfoElement DefaultClassChangeInfo; // 0x6f8(0x60)
	struct FGameSettingInfo CurrentGameSettingInfo; // 0x758(0x160)
	bool IsUsingOuterAreaBlueZone; // 0x8b8(0x01)
	struct ABravoHotelBlueZone* BlueZone; // 0x8c0(0x08)
	struct FMulticastInlineDelegate OnBlueZoneDelegate; // 0x8c8(0x10)
	struct FMulticastInlineDelegate OnChangePerkModeDelegate; // 0x8d8(0x10)
	float RecoilModifier_AR; // 0x900(0x04)
	float RecoilModifier_SMG; // 0x904(0x04)
	float RecoilModifier_SG; // 0x908(0x04)
	float RecoilModifier_DMR; // 0x90c(0x04)
	float RecoilModifier_SR; // 0x910(0x04)
	int32_t TotalPlayerCount; // 0x914(0x04)
	int32_t TotalAIPlayerCount; // 0x918(0x04)
	int32_t CurrentPlayerCount; // 0x91c(0x04)
	int32_t CurrentTeamCount; // 0x920(0x04)
	int32_t TotalTeamCount; // 0x924(0x04)
	int32_t TeamSize; // 0x928(0x04)
	struct FMulticastInlineDelegate OnRepTeamSize; // 0x930(0x10)
	struct FMulticastInlineDelegate OnRepCurrentPlayerCount; // 0x940(0x10)
	struct FMulticastInlineDelegate OnRepCurrentTeamCount; // 0x950(0x10)
	struct TArray<struct UBravoHotelPlayFeatureState*> PlayFeatureStates; // 0x960(0x10)
	struct FMulticastInlineDelegate OnChangeTournamentInfoDelegate; // 0x970(0x10)
	struct FMulticastInlineDelegate OnChangeMatchModeInfoDelegate; // 0x980(0x10)
	struct FMulticastInlineDelegate OnChangeRemainTournamentTimeDelegate; // 0x990(0x10)
	struct FMulticastInlineDelegate OnChangeCQRKeyDelegate; // 0x9a0(0x10)
	struct FMulticastInlineDelegate OnChangeGameViewTypeDelegate; // 0x9b0(0x10)
	struct FMulticastInlineDelegate OnChangeMatchingTypeDelegate; // 0x9c0(0x10)
	bool EnableAITeleport; // 0x9d0(0x01)
	int32_t AITeleportMinPhase; // 0x9d4(0x04)
	int32_t AITeleportMaxPhase; // 0x9d8(0x04)
	int32_t AITeleportMaxKillCount; // 0x9dc(0x04)

	void ShowTimeHUDMessage(); // Function BravoHotelGame.BravoHotelGameState.ShowTimeHUDMessage // (Native|Public) // @ game+0x231d4a0
	void RemainTournamentTimeBroadcast(int32_t RemainTime); // Function BravoHotelGame.BravoHotelGameState.RemainTournamentTimeBroadcast // (Final|Native|Public|BlueprintCallable) // @ game+0x231d420
	void RemainTournamentTime__DelegateSignature(int32_t RemainTime); // DelegateFunction BravoHotelGame.BravoHotelGameState.RemainTournamentTime__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnRepTeamSize__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelGameState.OnRepTeamSize__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnRepCurrentPlayerCount__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelGameState.OnRepCurrentPlayerCount__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnRep_TimeRemaining(); // Function BravoHotelGame.BravoHotelGameState.OnRep_TimeRemaining // (Final|Native|Public) // @ game+0x231d400
	void OnRep_TeamSize(); // Function BravoHotelGame.BravoHotelGameState.OnRep_TeamSize // (Native|Public) // @ game+0x231d3e0
	void OnRep_RecipeMode(); // Function BravoHotelGame.BravoHotelGameState.OnRep_RecipeMode // (Final|Native|Public) // @ game+0x231d3c0
	void OnRep_RawTournamentInfo(); // Function BravoHotelGame.BravoHotelGameState.OnRep_RawTournamentInfo // (Final|Native|Public) // @ game+0x231d3a0
	void OnRep_PerkMode(); // Function BravoHotelGame.BravoHotelGameState.OnRep_PerkMode // (Final|Native|Public) // @ game+0x231d380
	void OnRep_OverrideUltimateLevel(); // Function BravoHotelGame.BravoHotelGameState.OnRep_OverrideUltimateLevel // (Final|Native|Public) // @ game+0x231d360
	void OnRep_MatchModeInfo(); // Function BravoHotelGame.BravoHotelGameState.OnRep_MatchModeInfo // (Final|Native|Public) // @ game+0x231d320
	void OnRep_MatchingType(); // Function BravoHotelGame.BravoHotelGameState.OnRep_MatchingType // (Final|Native|Public) // @ game+0x231d340
	void OnRep_MapMode(); // Function BravoHotelGame.BravoHotelGameState.OnRep_MapMode // (Final|Native|Public) // @ game+0x231d300
	void OnRep_GameViewType(); // Function BravoHotelGame.BravoHotelGameState.OnRep_GameViewType // (Final|Native|Public) // @ game+0x231d2e0
	void OnRep_CurrentTeamCount(); // Function BravoHotelGame.BravoHotelGameState.OnRep_CurrentTeamCount // (Native|Public) // @ game+0x231d2c0
	void OnRep_CurrentPlayerCount(); // Function BravoHotelGame.BravoHotelGameState.OnRep_CurrentPlayerCount // (Native|Public) // @ game+0x231d2a0
	void OnRep_CurrentGameSettingInfo(); // Function BravoHotelGame.BravoHotelGameState.OnRep_CurrentGameSettingInfo // (Final|Native|Public) // @ game+0x231d280
	void OnRep_CQRKey(); // Function BravoHotelGame.BravoHotelGameState.OnRep_CQRKey // (Final|Native|Public) // @ game+0x231d260
	void OnRep_BlueZone(); // Function BravoHotelGame.BravoHotelGameState.OnRep_BlueZone // (Final|Native|Public) // @ game+0x231d240
	void OnMatchModeInfo__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelGameState.OnMatchModeInfo__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnChangeTournamentInfo__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelGameState.OnChangeTournamentInfo__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnChangePerkModeDelegate__DelegateSignature(int32_t PerkMode); // DelegateFunction BravoHotelGame.BravoHotelGameState.OnChangePerkModeDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnChangedMapModeDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelGameState.OnChangedMapModeDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	bool IsEnablePhaseAIMoveToNewbie(); // Function BravoHotelGame.BravoHotelGameState.IsEnablePhaseAIMoveToNewbie // (Final|Native|Public) // @ game+0x231d210
	bool IsDuplicateSelectPossible(); // Function BravoHotelGame.BravoHotelGameState.IsDuplicateSelectPossible // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x231d1e0
	bool IsCurrentStatusParty(); // Function BravoHotelGame.BravoHotelGameState.IsCurrentStatusParty // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x231d1b0
	bool GetTournamentStep(enum class ETournamentStep& OutStep, int32_t& OutRound); // Function BravoHotelGame.BravoHotelGameState.GetTournamentStep // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x231d0c0
	void GetTournamentInfo(struct FMatchModeInfo& OutMatchModeInfo, struct FRawTournamentInfo& OutRawTournamentInfo); // Function BravoHotelGame.BravoHotelGameState.GetTournamentInfo // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x231cd80
	struct ABravoHotelPlayerState* GetPlayerStateByUniqueID(int32_t UniqueId); // Function BravoHotelGame.BravoHotelGameState.GetPlayerStateByUniqueID // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x231ccf0
	struct FString GetMatchIDString(); // Function BravoHotelGame.BravoHotelGameState.GetMatchIDString // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x231cc20
	struct ABravoHotelBlueZone* GetBlueZone(); // Function BravoHotelGame.BravoHotelGameState.GetBlueZone // (Native|Public|BlueprintCallable) // @ game+0x231cbf0
	void GameInfo__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelGameState.GameInfo__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void ChangeRemainTime(int32_t RemainTime); // Function BravoHotelGame.BravoHotelGameState.ChangeRemainTime // (Native|Public) // @ game+0x231cb60
	void BlueZoneDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelGameState.BlueZoneDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
};

// Class BravoHotelGame.BattleRoyaleGameState
// Size: 0x2cff6a88 (Inherited: 0x2cff6ae0)
struct ABattleRoyaleGameState : ABravoHotelGameState {
	bool IsNewItemSpawnMode; // 0x9e0(0x01)
	enum class EGameMode GameRule; // 0x9e1(0x01)
	enum class EBattleRoyaleState BattleRoyaleState; // 0x9e2(0x01)
	struct FMulticastInlineDelegate OnBattleRoyalStateChanged; // 0x9e8(0x10)
	struct FMulticastInlineDelegate OnRocketLaunch; // 0x9f8(0x10)
	struct FMulticastInlineDelegate OnItemSpawnModeChanged; // 0xa08(0x10)
	struct FMulticastInlineDelegate OnChangeRemainTime; // 0xa18(0x10)
	int32_t GhostPlayerCountForTest; // 0xa2c(0x04)
	struct TArray<struct FCharacterDiedInfo> CharacterDiedInfos; // 0xa30(0x10)
	struct TArray<struct FTeamEndInfo> TeamEndInfos; // 0xa40(0x10)
	struct TArray<struct FAirCraftBoardingPlayerList> AirCraftBoardingInfos; // 0xa50(0x10)
	struct ABravoHotelRedZone* redzone; // 0xa60(0x08)
	struct ABravoHotelRedZoneManager* RedZoneManager; // 0xa68(0x08)
	struct FMulticastInlineDelegate AirCraftDescentPlayerInfoEvent; // 0xad8(0x10)
	struct FMulticastInlineDelegate EndAirCraftBoardingPlayerEvent; // 0xae8(0x10)
	struct ABravoHotelAircraftFlight* AircraftFlightRef; // 0xaf8(0x08)
	struct FMulticastInlineDelegate OnUpdateClassCount; // 0xb00(0x10)
	struct TArray<struct UObject*> RestoreList; // 0xb10(0x10)
	struct FTimerHandle TimerHandle_MoveToLobbyLevel; // 0xb28(0x08)
	struct TMap<struct FName, int32_t> CurrentClassCounts; // 0xb30(0x50)
	int32_t AutoBotCount; // 0xb80(0x04)

	void SetDescentPlayerInfo(int32_t PlayerId); // Function BravoHotelGame.BattleRoyaleGameState.SetDescentPlayerInfo // (Final|Native|Public) // @ game+0x221a4b0
	void SetAutoBotCount(int32_t Count); // Function BravoHotelGame.BattleRoyaleGameState.SetAutoBotCount // (Final|Native|Public) // @ game+0x221a430
	void SetAirCraftBoardingPlayerInfo(bool IsTeam, int32_t TeamID, int32_t PlayerId); // Function BravoHotelGame.BattleRoyaleGameState.SetAirCraftBoardingPlayerInfo // (Final|Native|Public) // @ game+0x221a330
	void ResetAirCraftBoardingPlayerInfo(); // Function BravoHotelGame.BattleRoyaleGameState.ResetAirCraftBoardingPlayerInfo // (Final|Native|Public) // @ game+0x221a310
	void RemainTimeDelegate__DelegateSignature(int32_t RemainTime); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.RemainTimeDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnUpdateClassCount__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.OnUpdateClassCount__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnRocketLaunch__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.OnRocketLaunch__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnRep_ChangeNewItemSpawnMode(); // Function BravoHotelGame.BattleRoyaleGameState.OnRep_ChangeNewItemSpawnMode // (Final|Native|Public) // @ game+0x221a2f0
	void OnRep_BattleRoyaleState(); // Function BravoHotelGame.BattleRoyaleGameState.OnRep_BattleRoyaleState // (Final|Native|Public) // @ game+0x221a2d0
	void MulticastOnRocketLaunch(); // Function BravoHotelGame.BattleRoyaleGameState.MulticastOnRocketLaunch // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x221a2b0
	void MulticastMoveToLobbyLevel(); // Function BravoHotelGame.BattleRoyaleGameState.MulticastMoveToLobbyLevel // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x221a290
	void ItemSpawnModeDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.ItemSpawnModeDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	struct ABravoHotelRedZone* GetRedZone(); // Function BravoHotelGame.BattleRoyaleGameState.GetRedZone // (Final|Native|Public|BlueprintCallable) // @ game+0x221a260
	void FindAirCraftFlightActor(); // Function BravoHotelGame.BattleRoyaleGameState.FindAirCraftFlightActor // (Final|Native|Public) // @ game+0x221a240
	void EndAirCraftBoardingPlayer__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.EndAirCraftBoardingPlayer__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void EndAirCraftBoardingPlayer(); // Function BravoHotelGame.BattleRoyaleGameState.EndAirCraftBoardingPlayer // (Final|Native|Public) // @ game+0x221a220
	void DoRestore(); // Function BravoHotelGame.BattleRoyaleGameState.DoRestore // (Final|Native|Public) // @ game+0x221a200
	void DoMoveToLobbyLevel(float DelayTime); // Function BravoHotelGame.BattleRoyaleGameState.DoMoveToLobbyLevel // (Final|Native|Public) // @ game+0x221a180
	void ClientExcuteEndAirCraftBoardingPlayerEvent(); // Function BravoHotelGame.BattleRoyaleGameState.ClientExcuteEndAirCraftBoardingPlayerEvent // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x221a160
	void ClientExcuteAirCraftDescentPlayerInfoEvent(int32_t AirCraftID, int32_t SeatID, int32_t PlayerId); // Function BravoHotelGame.BattleRoyaleGameState.ClientExcuteAirCraftDescentPlayerInfoEvent // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x221a070
	void BattleRoyalStateChanged__DelegateSignature(enum class EBattleRoyaleState PrevState, enum class EBattleRoyaleState CurrentState); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.BattleRoyalStateChanged__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void AirCraftDescentPlayerInfo__DelegateSignature(int32_t AirCraftID, int32_t SeatID, int32_t PlayerId); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.AirCraftDescentPlayerInfo__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
};

// Class BravoHotelGame.BHPersonalSupplyBox
// Size: 0x2cff6a78 (Inherited: 0x2cff6b08)
struct ABHPersonalSupplyBox : AActor {
	bool NeedInit; // 0x308(0x01)
	struct UBoxComponent* RootBoxComponent; // 0x318(0x08)
	struct USphereComponent* InteractiveSphereComponent; // 0x320(0x08)
	struct UBoxComponent* InteractiveCancleSphereComponent; // 0x328(0x08)
	struct FName BoxName; // 0x330(0x0c)
	struct TArray<int32_t> RelatedPlayerIds; // 0x340(0x10)
	struct ABHPersonalSupplyBoxDummy* RefClientDummy; // 0x350(0x08)
	enum class EBoxStateType CurrentStateType; // 0x359(0x01)
	bool CheckRePosition; // 0x35a(0x01)
	struct FTimerHandle TimeHandle_CheckRePosition; // 0x360(0x08)
	int32_t CustomIndex; // 0x368(0x04)
	bool TraceLand; // 0x36c(0x01)
	struct FTimerHandle TimerHandle_Destroy; // 0x370(0x08)

	void UpdateCheckRePosition(); // Function BravoHotelGame.BHPersonalSupplyBox.UpdateCheckRePosition // (Final|Native|Public) // @ game+0x221b510
	void RequestRePosition(float StartZ, float EndZ); // Function BravoHotelGame.BHPersonalSupplyBox.RequestRePosition // (Final|Native|Public) // @ game+0x221b450
	void RePosition(struct FVector& NewLocation); // Function BravoHotelGame.BHPersonalSupplyBox.RePosition // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x221b3c0
	void OnRep_SetStateType(); // Function BravoHotelGame.BHPersonalSupplyBox.OnRep_SetStateType // (Native|Public) // @ game+0x221b3a0
	void OnRep_RelatedPlayerIds(); // Function BravoHotelGame.BHPersonalSupplyBox.OnRep_RelatedPlayerIds // (Final|Native|Public) // @ game+0x221b380
	void OnRep_CheckRePosition(); // Function BravoHotelGame.BHPersonalSupplyBox.OnRep_CheckRePosition // (Final|Native|Public) // @ game+0x221b360
	void OnRecall(); // Function BravoHotelGame.BHPersonalSupplyBox.OnRecall // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnOverlapEnd(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function BravoHotelGame.BHPersonalSupplyBox.OnOverlapEnd // (Final|Native|Public) // @ game+0x221b220
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function BravoHotelGame.BHPersonalSupplyBox.OnOverlapBegin // (Final|Native|Public|HasOutParms) // @ game+0x221b010
	void OnChangeState(enum class EBoxStateType StateType); // Function BravoHotelGame.BHPersonalSupplyBox.OnChangeState // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnAssigned(); // Function BravoHotelGame.BHPersonalSupplyBox.OnAssigned // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	bool IsReplatedBP(); // Function BravoHotelGame.BHPersonalSupplyBox.IsReplatedBP // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x221afe0
	void GetRelatedPlayerIds(struct TArray<int32_t>& outList); // Function BravoHotelGame.BHPersonalSupplyBox.GetRelatedPlayerIds // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x221af30
	void DestroyBox(); // Function BravoHotelGame.BHPersonalSupplyBox.DestroyBox // (Final|Native|Public) // @ game+0x221af10
	void ChangeBoxMesh(bool IsMyBox); // Function BravoHotelGame.BHPersonalSupplyBox.ChangeBoxMesh // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
};

// Class BravoHotelGame.BravoHotelDropBoxActor
// Size: 0x2cff6ab0 (Inherited: 0x2cff6b08)
struct ABravoHotelDropBoxActor : AActor {
	enum class EPickupRoot RootType; // 0x308(0x01)
	struct UBoxComponent* RootBoxComponent; // 0x310(0x08)
	struct UDropBoxInventoryComponent* InventoryComponent; // 0x318(0x08)
	struct USphereComponent* InteractiveSphereComponent; // 0x320(0x08)
	struct UBoxComponent* InteractiveCancleSphereComponent; // 0x328(0x08)
	struct FString DropperNickName; // 0x330(0x10)
	struct FString DropperCountryCode; // 0x340(0x10)
	struct FText BoxName; // 0x350(0x18)
	int32_t RarityIndex; // 0x368(0x04)
	struct ABravoHotelCharacter* DetectedCharacter; // 0x370(0x08)

	void SetItemInBlueprint(struct FName& ItemKey); // Function BravoHotelGame.BravoHotelDropBoxActor.SetItemInBlueprint // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2bad3b0
	void OnOverlapEnd(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function BravoHotelGame.BravoHotelDropBoxActor.OnOverlapEnd // (Native|Public) // @ game+0x23062e0
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function BravoHotelGame.BravoHotelDropBoxActor.OnOverlapBegin // (Native|Public|HasOutParms) // @ game+0x23060e0
	void OnDeactivated(); // Function BravoHotelGame.BravoHotelDropBoxActor.OnDeactivated // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void OnBoxChanged(); // Function BravoHotelGame.BravoHotelDropBoxActor.OnBoxChanged // (Native|Public) // @ game+0x23040d0
	void OnActivated(); // Function BravoHotelGame.BravoHotelDropBoxActor.OnActivated // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	struct FString GetDropperNickName(); // Function BravoHotelGame.BravoHotelDropBoxActor.GetDropperNickName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2306010
	struct FText GetCurrentBoxName(); // Function BravoHotelGame.BravoHotelDropBoxActor.GetCurrentBoxName // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x2305f70
	struct FText GetBoxName(); // Function BravoHotelGame.BravoHotelDropBoxActor.GetBoxName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2305ec0
	void AddItemsToBox(struct TArray<struct FSpawnItemResult>& ItemsToSpawn); // Function BravoHotelGame.BravoHotelDropBoxActor.AddItemsToBox // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x2305de0
};

// Class BravoHotelGame.BHPersonalSupplyBoxDummy
// Size: 0x2cff6ab8 (Inherited: 0x2cff6ab0)
struct ABHPersonalSupplyBoxDummy : ABravoHotelDropBoxActor {
	int32_t playerGUID; // 0x3b0(0x04)
	char pad_2CFF6AB4[0x4]; // 0x2cff6ab4(0x04)
};

// Class BravoHotelGame.BHPersonalSupplyBoxManager
// Size: 0x2cff6ac8 (Inherited: 0x2d003708)
struct ABHPersonalSupplyBoxManager : AInfo {
	struct ABHPersonalSupplyBox* SupplyBoxClass; // 0x308(0x08)
	struct TArray<struct FPersonalSupplyPhaseInfo> ListPhaseInfo; // 0x310(0x10)
	int32_t CurrentPhaseNum; // 0x320(0x04)
	struct TArray<struct ABHPersonalSupplyBox*> ListUsableSupplyBox; // 0x328(0x10)
	struct TMap<int32_t, struct ABHPersonalSupplyBox*> MapSupplyBox; // 0x338(0x50)
	struct FName TestRandomTableID; // 0x388(0x0c)
	bool UseTestRandom; // 0x394(0x01)
	struct TArray<struct ABHPersonalSupplyBox*> SpawnedSupplyBoxList; // 0x3a8(0x10)
	struct TArray<struct ABHPersonalSupplyBox*> ForceSpawnedSupplyBoxList; // 0x3b8(0x10)

	void SetCurrentPhaseNum(int32_t PhaseNum); // Function BravoHotelGame.BHPersonalSupplyBoxManager.SetCurrentPhaseNum // (Final|Native|Public|BlueprintCallable) // @ game+0x221ba60
	void RecallAll(); // Function BravoHotelGame.BHPersonalSupplyBoxManager.RecallAll // (Final|Native|Public|BlueprintCallable) // @ game+0x221ba40
	void ReassignAll(int32_t Phase, bool Force); // Function BravoHotelGame.BHPersonalSupplyBoxManager.ReassignAll // (Final|Native|Public|BlueprintCallable) // @ game+0x221b980
};

// Class BravoHotelGame.BravoHotelCharacter
// Size: 0x2cff6ab0 (Inherited: 0x2cff6ae0)
struct ABravoHotelCharacter : ACharacter {
	struct UAkComponent* AudioComponent; // 0xb80(0x08)
	struct USceneComponent* CameraBase; // 0x34c8(0x08)
	struct USpringArmComponent* CameraAssistant3P; // 0x1638(0x08)
	struct UBravoHotelCameraComponent* Camera3P; // 0x39d0(0x08)
	struct UPointLightComponent* CharacterBackLight; // 0x22c8(0x08)
	struct UPointLightComponent* CharacterBackLightSecond; // 0x3af0(0x08)
	float BackLightIntensity_FPP; // 0x32a4(0x04)
	float BackLightIntensity_ADS; // 0x24bc(0x04)
	struct TArray<struct UParticleSystemComponent*> BuffParticleComponents; // 0x2468(0x10)
	struct UCustomizableSkeletalComponent* MutableComponent; // 0x3490(0x08)
	struct USphereComponent* InteractiveSphereComponent; // 0xbc8(0x08)
	struct USphereComponent* InteractiveCancleSphereComponent; // 0x2490(0x08)
	struct USkeletalMeshComponent* Parachute; // 0x39c0(0x08)
	struct UParticleSystemComponent* WaterParticleSystem; // 0x3d08(0x08)
	struct UParticleSystemComponent* FlameDamageParticleComponent; // 0x36d0(0x08)
	struct UParticleSystem* FlameDamageParticle; // 0x2ad8(0x08)
	struct UBravoHotelSTMComponent* STMComponent; // 0x2eb0(0x08)
	struct UBravoHotelActionComponent* ActionComponent; // 0x29e8(0x08)
	struct UBravoHotelPerkComponent* PerkComponent; // 0x26e0(0x08)
	struct UTeamInfoUpdaterComponent* TeamInfoUpdaterComponentRef; // 0x3c80(0x08)
	struct FTimerHandle TimeHandle_MolotovDotDamage; // 0x3b08(0x08)
	struct FAnimSlot Stand_FlameDotDamageAnim; // 0x3d30(0x10)
	struct FAnimSlot Prone_FlameDotDamageAnim; // 0xc70(0x10)
	struct TArray<struct FMolotovFlameDotDamageInfo> FlameDamageInfos; // 0x1798(0x10)
	struct FString NPCNickName; // 0x38d8(0x10)
	bool bAllowToggleCamera; // 0x3038(0x01)
	bool bThirdPerson; // 0x1990(0x01)
	float SprintingMoveRightModifier; // 0x19f8(0x04)
	float LeanValue; // 0x18e0(0x04)
	float LeanDegreeMax; // 0x3d40(0x04)
	float LeanUpdateSpeed; // 0x13d8(0x04)
	enum class ELeanState SaveLeanState; // 0x22e8(0x01)
	enum class ELeanState PrevLeanState; // 0xa65(0x01)
	bool bFixLeanDegreeMax; // 0x1e30(0x01)
	bool bFixFPPFoV; // 0xb8d(0x01)
	float Health; // 0x3cdc(0x04)
	float ShortTimeHealth; // 0x34c4(0x04)
	float TargetHealth; // 0x279c(0x04)
	float BandageTargetHealth; // 0x2cf8(0x04)
	float OverHealHealth; // 0x2f18(0x04)
	struct UCameraPostProcessPreset* PP_Preset_ShortHealth; // 0x1ce8(0x08)
	struct UCameraPostProcessPreset* PPInst_ShortHealth; // 0x2c50(0x08)
	struct TMap<enum class ETargetHealthType, struct FTargetHealthInfo> TargetHealthMap; // 0x2820(0x50)
	float Oxygen; // 0x2b00(0x04)
	float SteadyPoint; // 0x15e0(0x04)
	int8_t BoostPercent; // 0x3a54(0x01)
	float Default3PFOV; // 0x3c88(0x04)
	float Default3PFOV_AOS; // 0x2030(0x04)
	float Default3PFOV_AMP; // 0x16f0(0x04)
	float Default3PFOV_HeartBeatSensor; // 0x3ee8(0x04)
	float Default3PFOV_SkillMAP; // 0x276c(0x04)
	float ForwardAxisValue; // 0x2c70(0x04)
	float RightAxisValue; // 0x1280(0x04)
	float InputMovementAttenuationTime; // 0x2804(0x04)
	float InputMovementAttenuationTimeIdleToCrouch; // 0x297c(0x04)
	float InputMovementAttenuationTimeIdleToProne; // 0x32a0(0x04)
	float InputMovementAttenuationTimeProneToIdle; // 0x2ad0(0x04)
	float InputMovementAttenuationValueIdleToCrouch; // 0x3a50(0x04)
	float InputMovementAttenuationValueIdleToProne; // 0xe58(0x04)
	float InputMovementAttenuationValueProneToIdle; // 0x2554(0x04)
	float InputMovementAttenuationValue; // 0x18a8(0x04)
	bool bMovementKeyPushed; // 0x1778(0x01)
	bool bLastMovementKeyPushed; // 0x3498(0x01)
	bool bMovementInputLock; // 0x14e0(0x01)
	struct FVector2D InputAxisOnLockMovement; // 0x39f8(0x08)
	struct TMap<struct UObject*, float> ShortTimeHealthMap; // 0x1bb8(0x50)
	bool bInputKeyJump; // 0x39e1(0x01)
	float DoubleTapDelay_ToggleLean; // 0x10dc(0x04)
	bool bShouldSprint; // 0x3980(0x01)
	enum class EFireType FireTypeComplete; // 0xe68(0x01)
	struct UDataTable* PerBoneDamageTable; // 0x2740(0x08)
	struct UDataTable* MeleeDamageTable; // 0x34a0(0x08)
	struct UDataTable* PistolsDamageTable; // 0x3708(0x08)
	struct UDataTable* ShotgunsDamageTable; // 0x29a0(0x08)
	struct UDataTable* SMGsDamageTable; // 0x2d50(0x08)
	struct UDataTable* ARsDamageTable; // 0x1900(0x08)
	struct UDataTable* DMRsDamageTable; // 0x3860(0x08)
	struct UDataTable* SRsDamageTable; // 0x3fa0(0x08)
	struct ABravoHotelBrokenEquipment* BrokenHelmetClass; // 0x3a58(0x08)
	bool bNeedToSpawnBrokenEquipment; // 0xf98(0x01)
	float BrokenEquipmentLevel; // 0x1160(0x04)
	struct FVector BrokenEquipmentDamagedDirection; // 0x3fe0(0x0c)
	enum class EWearableItemType BrokenEquipmentType; // 0x3138(0x01)
	enum class EInteractionType InteractionType; // 0x1e60(0x01)
	float InteractionTraceDistance; // 0x34b0(0x04)
	struct AActor* DetectedInteractionActor; // 0xe60(0x08)
	struct UPrimitiveComponent* DetectedInteractionComponet; // 0x3180(0x08)
	struct USceneComponent* DetectedVehicleSeatComponent; // 0x3fc8(0x08)
	struct TArray<struct AActor*> DetectedInteractionCancleActors; // 0x18c0(0x10)
	struct TMap<struct UObject*, float> InteractionDistRatioMap; // 0x31a0(0x50)
	float ResurrectionCameraBlendTime; // 0x2e88(0x04)
	struct UCameraPostProcessPreset* PostProcessResurrectionClass; // 0xe88(0x08)
	struct UCurveFloat* ResurrectionEffectCurve; // 0x2f68(0x08)
	struct TScriptInterface<IMaterialControllableInterface> ResurrectionMaterialController; // 0x4188(0x10)
	struct ABravoHotelPickup* DetectedPickableItem; // 0x2710(0x08)
	struct TArray<struct ABravoHotelPickup*> DetectedItemList; // 0x1c88(0x10)
	struct TArray<struct ABravoHotelDropBoxActor*> DetectedBoxList; // 0x3cc8(0x10)
	struct TArray<struct ABravoHotelCharacter*> DetectedStealableList; // 0x3008(0x10)
	struct TArray<struct ABravoHotelPickup*> DetectedItemHideList; // 0x3938(0x10)
	struct FTimerHandle TimerHandle_CheckDetectedItemList; // 0x2bd0(0x08)
	struct UPlayerInventoryComponent* InventoryComponent; // 0x3a60(0x08)
	struct UBravoHotelAbilityComponent* AbilityComponent; // 0x1248(0x08)
	struct UBravoHotelDoorComponent* DoorComponent; // 0x20e0(0x08)
	struct UParkourComponent* ParkourComponent; // 0x2250(0x08)
	struct UBravoHotelBlueZoneGameRule* BlueZoneGameRule; // 0x3c00(0x08)
	struct UBravoHotelVoiceComponent* VoiceComponent; // 0x2c48(0x08)
	struct ULadderComponent* LadderComponent; // 0x4040(0x08)
	struct UBHStationaryCharInfo* StationaryCharInfo; // 0x2d88(0x08)
	struct UBHCharacterReplication* CharacterReplication; // 0x3930(0x08)
	struct FAnimSlot CombineAnim_Stand; // 0x2700(0x10)
	struct FAnimSlot CombineAnim_Prone; // 0x2520(0x10)
	struct FAnimSlot RepairAnim_Stand; // 0x3528(0x10)
	struct FAnimSlot RepairAnim_Prone; // 0x1840(0x10)
	struct UAnimMontage* CurrentPickupMontage; // 0x2570(0x08)
	struct FAnimSlot PickUpAnim_Unarmed_Floor; // 0x19b8(0x10)
	struct FAnimSlot PickUpAnim_Unarmed_Table; // 0x2050(0x10)
	struct FAnimSlot PickUpAnim_Unarmed_Crouch; // 0x3ec8(0x10)
	struct FAnimSlot PickUpAnim_Unarmed_Prone; // 0x3060(0x10)
	struct FAnimSlot PickUpAnim_Rifle_Floor; // 0x1db8(0x10)
	struct FAnimSlot PickUpAnim_Rifle_Table; // 0x27b8(0x10)
	struct FAnimSlot PickUpAnim_Rifle_Crouch; // 0x3078(0x10)
	struct FAnimSlot PickUpAnim_Rifle_Prone; // 0x3140(0x10)
	struct FAnimSlot PickUpAnim_Pistol_Floor; // 0x4000(0x10)
	struct FAnimSlot PickUpAnim_Pistol_Table; // 0x2498(0x10)
	struct FAnimSlot PickUpAnim_Pistol_Crouch; // 0x1150(0x10)
	struct FAnimSlot PickUpAnim_Pistol_Prone; // 0x3b98(0x10)
	struct FAnimSlot PickUpAnim_Shield_Floor; // 0x2c28(0x10)
	struct FAnimSlot DoorAnim_Open; // 0x3d50(0x10)
	struct FAnimSlot DoorAnim_Close; // 0x3278(0x10)
	struct FAnimSlot DoorAnim_Kick; // 0x1088(0x10)
	struct FAnimSlot MovementAnim_GetUpFromBack; // 0x3690(0x10)
	struct FAnimSlot MovementAnim_GetUpFromFront; // 0x1dc8(0x10)
	struct FAnimSlot ConditionAnim_ShakeOut_Unarmed; // 0x3458(0x10)
	struct FAnimSlot ConditionAnim_ShakeOut_Rifle; // 0x26c0(0x10)
	struct TArray<struct FAnimSlot> MeleeAnim_Punch_Idle; // 0x1300(0x10)
	struct TArray<struct FAnimSlot> MeleeAnim_Punch_Crouch; // 0x1620(0x10)
	struct FAnimSlot MeleeAnim_Punch_Jump; // 0x2cd0(0x10)
	struct TArray<struct FAnimSlot> MeleeAnim_Rifle_Idle; // 0xfb0(0x10)
	struct TArray<struct FAnimSlot> MeleeAnim_Rifle_Crouch; // 0x2a08(0x10)
	struct TArray<struct FAnimSlot> MeleeAnim_Pistol_Idle; // 0x3330(0x10)
	struct TArray<struct FAnimSlot> MeleeAnim_Pistol_Crouch; // 0x3e50(0x10)
	struct TArray<struct FAnimSlot> DeathAnim_Crouch; // 0x4110(0x10)
	struct TArray<struct FAnimSlot> DeathAnim_FlameDamage; // 0x3838(0x10)
	struct TArray<struct FAnimSlot> DeathAnim_Grenade; // 0x30c8(0x10)
	struct TArray<struct FAnimSlot> DeathAnim_HeadShot; // 0xb38(0x10)
	struct TArray<struct FAnimSlot> DeathAnim_Natural; // 0x15f0(0x10)
	struct TArray<struct FAnimSlot> DeathAnim_Rifle; // 0x1d18(0x10)
	struct TArray<struct FAnimSlot> DeathAnim_Shotgun; // 0x2e68(0x10)
	struct TArray<struct FAnimSlot> DeathAnim_Sprint; // 0x3af8(0x10)
	struct TArray<struct FAnimSlot> DeathAnim_Falling; // 0x3368(0x10)
	struct UAnimationAsset* DeathAnim_ClosedEyes; // 0x2238(0x08)
	struct UAkAudioEvent* PickUpStartEvent; // 0x3d48(0x08)
	struct UAkAudioEvent* PickUpBackpackEvent; // 0x3058(0x08)
	struct FAnimSlot EquipAnim_MainWeapon1; // 0x2fd0(0x10)
	struct FAnimSlot EquipAnim_MainWeapon1_Prone; // 0x3bd0(0x10)
	struct FAnimSlot EquipAnim_MainWeapon2; // 0x3c18(0x10)
	struct FAnimSlot EquipAnim_MainWeapon2_Prone; // 0x3cf0(0x10)
	struct FAnimSlot EquipAnim_SubWeapon; // 0x3a40(0x10)
	struct FAnimSlot EquipAnim_SubWeapon_Prone; // 0x1c10(0x10)
	struct FAnimSlot EquipAnim_Melee; // 0x2d58(0x10)
	struct FAnimSlot EquipAnim_Melee_Prone; // 0x1d50(0x10)
	struct FAnimSlot EquipAnim_Amplifier; // 0x22b0(0x10)
	struct FAnimSlot EquipAnim_Amplifier_Prone; // 0xee0(0x10)
	struct FAnimSlot EquipAnim_HeartBeatSensor; // 0x32c0(0x10)
	struct FAnimSlot EquipAnim_HeartBeatSensor_Prone; // 0x1368(0x10)
	struct FAnimSlot SlidingAnim; // 0x2948(0x10)
	struct FAnimSlot RollingAnim; // 0x2968(0x10)
	struct FAnimSlot KnockbackRollingAnim; // 0x1e70(0x10)
	struct FAnimSlot EquipAnim_ThrowingWeapon; // 0x3eb0(0x10)
	struct FAnimSlot EquipAnim_Prone_ThrowingWeapon; // 0x29d0(0x10)
	struct FAnimSlot UnequipAnim_MainWeapon1; // 0x15b0(0x10)
	struct FAnimSlot UnequipAnim_MainWeapon1_Prone; // 0x2aa0(0x10)
	struct FAnimSlot UnequipAnim_MainWeapon2; // 0x20c8(0x10)
	struct FAnimSlot UnequipAnim_MainWeapon2_Prone; // 0x15d0(0x10)
	struct FAnimSlot UnequipAnim_SubWeapon; // 0x29b8(0x10)
	struct FAnimSlot UnequipAnim_SubWeapon_Prone; // 0x2c58(0x10)
	struct FAnimSlot UnequipAnim_Melee; // 0x1688(0x10)
	struct FAnimSlot UnequipAnim_Melee_Prone; // 0x2a50(0x10)
	struct FAnimSlot UnequipAnim_Amplifier; // 0x3678(0x10)
	struct FAnimSlot UnequipAnim_Amplifier_Prone; // 0x2ce8(0x10)
	struct FAnimSlot UnequipAnim_HeartBeatSensor; // 0x1a38(0x10)
	struct FAnimSlot UnequipAnim_HeartBeatSensor_Prone; // 0x1010(0x10)
	struct FAnimSlot UnequipAnim_ThrowingWeapon; // 0x2300(0x10)
	struct FAnimSlot UnequipAnim_Prone_ThrowingWeapon; // 0x10a0(0x10)
	struct FAnimSlot LandingAnim_LandStop; // 0x3d98(0x10)
	struct FAnimSlot LandingAnim_Parachute; // 0x26d0(0x10)
	struct FAnimSlot LandingAnim_Unarmed; // 0x3918(0x10)
	struct FAnimSlot LandingAnim_Rifle; // 0x2f50(0x10)
	struct FAnimSlot LandingAnim_Pistol; // 0x3778(0x10)
	struct TArray<struct FResuscitationAnimSet> ResuscitationAnimSets; // 0x40c0(0x10)
	struct TArray<struct UAkAudioEvent*> WeaponEquipEvents; // 0x3c70(0x10)
	struct TArray<struct UAkAudioEvent*> AttachmentEquipEvents; // 0x2258(0x10)
	struct TArray<struct UAkAudioEvent*> WearableEquipEvents; // 0x1e98(0x10)
	struct TArray<struct UAkAudioEvent*> ConsumablesEvents; // 0x3b78(0x10)
	struct UAkAudioEvent* MedipackUseEvent; // 0xfa0(0x08)
	struct UAkAudioEvent* ItemDropEvent; // 0xe90(0x08)
	struct UAkAudioEvent* ADSEnterEvent; // 0x1560(0x08)
	struct UAkAudioEvent* ADSEnterEvent_Digital; // 0x2330(0x08)
	struct UAkAudioEvent* ADSExitEvent; // 0x1c20(0x08)
	struct UAkAudioEvent* ADSExitEvent_Digital; // 0x10c8(0x08)
	struct UAkAudioEvent* AOSEnterEvent; // 0xc98(0x08)
	struct UAkAudioEvent* AOSExitEvent; // 0x2980(0x08)
	struct UAkAudioEvent* AMPEnterEvent; // 0x1790(0x08)
	struct UAkAudioEvent* AMPExitEvent; // 0x3c60(0x08)
	struct UAkAudioEvent* AMPNoiseEvent; // 0x1730(0x08)
	struct UAkAudioEvent* AMPNoiseStopEvent; // 0x2a68(0x08)
	struct UAkAudioEvent* PlosiveSoundDetection3LvEvent; // 0x3658(0x08)
	struct UAkAudioEvent* HeartBeatSensorEnterEvent; // 0x3b28(0x08)
	struct UAkAudioEvent* HeartBeatSensorExitEvent; // 0x36d8(0x08)
	struct UAkAudioEvent* HeartBeatSensorNoiseEvent; // 0x2140(0x08)
	struct UAkAudioEvent* HeartBeatSensorNoiseStopEvent; // 0x3ca0(0x08)
	struct UAkAudioEvent* DamagedEvent; // 0x1098(0x08)
	struct UAkAudioEvent* HitEvent; // 0x39d8(0x08)
	struct UAkAudioEvent* SnowAreaEnteringEvent; // 0x2a38(0x08)
	struct UAkAudioEvent* UltimateSprintEvent; // 0x1940(0x08)
	bool bIsParachuteLanding; // 0x1739(0x01)
	float ParachuteLandingHeight; // 0x174c(0x04)
	struct UAkAudioEvent* StartDescendingEvent; // 0xac8(0x08)
	struct UAkAudioEvent* ParachuteFoldEvent; // 0x2990(0x08)
	struct FTimerHandle TimerHandle_Sequnce; // 0x3ea8(0x08)
	struct UWidgetComponent* TeamPosition; // 0x1fb0(0x08)
	float AdditionalTeamPositionWidgetHeight; // 0x1d38(0x04)
	float TeamPositionWidgetInterpSpeed; // 0x1c78(0x04)
	float CurrentTeamPositionHeight; // 0x2a60(0x04)
	struct FMulticastInlineDelegate OnChangeDetectedItems; // 0x2878(0x10)
	struct FMulticastInlineDelegate Delegate_OnViewCameraInWater; // 0x3668(0x10)
	struct FMulticastInlineDelegate Delegate_OnViewCameraOutWater; // 0x23e0(0x10)
	bool bInSmoke; // 0x39e0(0x01)
	struct FMulticastInlineDelegate Delegate_OnInSmoke; // 0x11e0(0x10)
	struct FMulticastInlineDelegate Delegate_OnOutSmoke; // 0x1a08(0x10)
	struct TArray<struct AActor*> SmokeActors; // 0x20e8(0x10)
	struct UAkAudioEvent* SwimDiveEvent; // 0xab0(0x08)
	bool bIsEnterIndoorVolume; // 0x2158(0x01)
	struct USkyLightComponent* SkyLightRef; // 0xfd8(0x08)
	float PrevSkyLightIntensityCache; // 0x3c38(0x04)
	struct FColor PrevSkyLightOcclusionTintCache; // 0x2d9c(0x04)
	float SkyLightCurrentPriority; // 0x2798(0x04)
	struct TArray<struct UInDoorVolumeComponent*> OverlappedInDoorVolumes; // 0x2e40(0x10)
	struct UBravoHotelPhysicalMaterial* LastSteppedSurface; // 0x1c80(0x08)
	enum class EPhysicalSurface SurfaceType; // 0x3c68(0x01)
	enum class EPhysicalSurface SurfaceType_LastTick; // 0x3468(0x01)
	float MP_SnowInterpSpeed; // 0x172c(0x04)
	struct FTimerHandle TimerHandle_BreathEffect; // 0xe70(0x08)
	struct UParticleSystemComponent* BreathParticleComponent; // 0x3960(0x08)
	struct UParticleSystem* BreathParticle_Idle; // 0x17a8(0x08)
	struct UParticleSystem* BreathParticle_Moving; // 0x3ee0(0x08)
	struct UParticleSystem* InWaterParticle; // 0x27a0(0x08)
	struct FMulticastInlineDelegate OnUpdateMutableDelegate; // 0x13f8(0x10)
	struct ABravoHotelWaterPhysicsVolume* OverlapWaterVolume; // 0x3560(0x08)
	bool bIsMelee; // 0xd8c(0x01)
	bool bIsMeleeJumpAttack; // 0x1738(0x01)
	bool bCanJumpMeleeAttack; // 0x3ea0(0x01)
	bool bIsMeleeAttackBlocked; // 0x15e8(0x01)
	float LastMeleeAttackTime; // 0xd40(0x04)
	struct FAnimSlot CurrentMeleeAnimSlot; // 0x10b0(0x10)
	struct TArray<struct AActor*> ActorsToIgnore_Melee; // 0x2450(0x10)
	struct TArray<struct UPrimitiveComponent*> MeshesToIgnore_Melee; // 0x1048(0x10)
	float UnarmedMeleeDamage_Ground; // 0xe78(0x04)
	float UnarmedMeleeDamage_Jump; // 0x2278(0x04)
	bool bIsFired; // 0x1a21(0x01)
	bool bWantsToFire; // 0x1c58(0x01)
	bool bWantsToAOS; // 0xd54(0x01)
	bool bIsLanded; // 0x402d(0x01)
	float FiredTimeCount; // 0x2ae4(0x04)
	float StartFireTime; // 0x23d8(0x04)
	char bIsADSFireToCamera : 1; // 0x2cc0(0x01)
	float FireToCameraLocationCorrection; // 0x22ac(0x04)
	struct FRotator ArmsLagRotation; // 0x3be0(0x0c)
	float ArmsLagDeltaMin; // 0x2288(0x04)
	float ArmsLagDeltaMax; // 0x30f8(0x04)
	float DefaultsArmsLagRotationMax; // 0x3100(0x04)
	float DefaultsArmsLagRotationSpeed; // 0x2e2c(0x04)
	struct TMap<enum class EWeaponAttachmentItem, struct FBravoHotelArmsLag> ArmsLags; // 0x2bd8(0x50)
	float ArmsLagBaseModify; // 0x1658(0x04)
	float ArmsLagWeaponModify; // 0x4028(0x04)
	struct FRotator ArmsLagWeaponRotation; // 0x2e30(0x0c)
	struct FRotator ADSDeltaRotation; // 0x3f00(0x0c)
	struct FVector ADSEndLocation; // 0xbec(0x0c)
	bool bSteadyAim; // 0x3904(0x01)
	struct FVector LastSwayRotationOnSteadyAim; // 0xfc8(0x0c)
	struct UAkAudioEvent* SteadyAimReadyEvent; // 0xa58(0x08)
	struct UAkAudioEvent* SteadyAimStartEvent; // 0x2960(0x08)
	struct UAkAudioEvent* SteadyAimEndEvent; // 0x2a88(0x08)
	float HeadShotBloodEffectDistance; // 0x31f0(0x04)
	struct UParticleSystem* HeadShotHelmetFxEmitterTemplate; // 0x27d0(0x08)
	float BoltActionDelayTime; // 0x2728(0x04)
	bool bWaitingADSReturn; // 0x2100(0x01)
	float ADSReturnEnableTime; // 0x12c4(0x04)
	float Delay_AOSToADS; // 0x28d8(0x04)
	bool bNeedToBeADS; // 0x3954(0x01)
	struct FTimerHandle TimerHandle_ADSProcess; // 0x2e08(0x08)
	struct UCameraPostProcessPreset* PP_Preset_ADS; // 0x2f88(0x08)
	struct UCameraPostProcessPreset* PPInst_ADS; // 0x12f0(0x08)
	float ReplayInputForwardAxisValue; // 0x2af8(0x04)
	float ReplayInputRightAxisValue; // 0x3e7c(0x04)
	struct FVector2D CurrentInputAxis; // 0xed4(0x08)
	struct FMulticastInlineDelegate Delegate_OnCameraViewModeChanged; // 0x5f8(0x10)
	struct UAkAudioEvent* ZoomInAudioEvent_Digital; // 0x1380(0x08)
	struct UAkAudioEvent* ZoomOutAudioEvent_Digital; // 0x1d30(0x08)
	float ZoomAudioEventRepeatDelay; // 0x29a8(0x04)
	float ZoomAudioEventLastPlayTime; // 0x2b98(0x04)
	struct FMulticastInlineDelegate OnPickableItemDetected; // 0x660(0x10)
	float OverHeadTraceDistance; // 0x3dc4(0x04)
	bool bShouldAdjustOverHead; // 0xd78(0x01)
	float UpdateAnimationDistance; // 0xaac(0x04)
	bool bIsDisarming; // 0x6a0(0x01)
	struct UAkAudioEvent* ResuscitationStopEvents; // 0x1970(0x08)
	struct ABravoHotelCharacter* ResuscitatingCharacter; // 0x38b8(0x08)
	float RequestResuscitationCoolTime; // 0x1dd8(0x04)
	struct FAnimSlot CurrentResuscitationAnimSlot; // 0x3fd0(0x10)
	struct FTimerHandle TimerHandle_SetIsFired; // 0x2d00(0x08)
	float KillAssistValidTime; // 0x3908(0x04)
	int32_t KillAssistMaxCount; // 0xd88(0x04)
	float KnockOutAssistValidTime; // 0x161c(0x04)
	int32_t KnockOutAssistMaxCount; // 0x2478(0x04)
	struct TArray<struct FAssistInfo> AssistInfo; // 0x1d80(0x10)
	struct FDamageInstigatorInfo KnockOutInstigatorInfo; // 0x3208(0x60)
	float ThrowingWeaponFireDelay; // 0x229c(0x04)
	float PreMaxHealth; // 0x3714(0x04)
	bool bIsParachuteAvailable; // 0x3b70(0x01)
	float ParachuteInputForward; // 0x1d28(0x04)
	float ParachuteInputRight; // 0x3104(0x04)
	float ParachuteForwardMomentum; // 0xcb0(0x04)
	struct FRotator ParachuteLastRotator; // 0x11d4(0x0c)
	float CurrentParachuteMaxMomentum; // 0x3c50(0x04)
	float ParachuteMaxMomentum; // 0x32a8(0x04)
	float ParachuteMomentumAcc; // 0x1c0c(0x04)
	float ParachuteMomentumDeacc; // 0x2368(0x04)
	float ParachuteMomentumZ; // 0x3ad8(0x04)
	float DescentInputVectorAcc; // 0xb88(0x04)
	float ParachuteInputVectorAcc; // 0x15e4(0x04)
	float ParachuteVelocityChangeFinalRate; // 0x3b20(0x04)
	float ParachuteVelocityChangeZDecRate; // 0x15ec(0x04)
	float ParachuteLandingVelocityZ; // 0x2ab8(0x04)
	float ParachuteLandingVelocityXY; // 0x315c(0x04)
	float ForwardMomentumRangeMin; // 0x24ec(0x04)
	float ForwardMomentumRangeMax; // 0x3878(0x04)
	float CurrentYawSpeed; // 0x29e0(0x04)
	float CurrentRollSpeed; // 0x40fc(0x04)
	float CurrentPitchSpeed; // 0x2ae0(0x04)
	float MinPitchInParachute; // 0x3d04(0x04)
	float MaxPitchInParachute; // 0x2370(0x04)
	float GlidePitchInParachute; // 0x2c38(0x04)
	float MinRollInParachute; // 0x2f70(0x04)
	float MaxRollInParachute; // 0x2098(0x04)
	float MaxRollInParachuteVelocity; // 0xa94(0x04)
	float ParachuteTurnSpeedYaw; // 0xa24(0x04)
	float ParachuteTurnSpeedPitch; // 0x3e98(0x04)
	float ParachuteTurnSpeedRoll; // 0x4060(0x04)
	float ParachuteTurnChangeSpeedYaw; // 0x18d4(0x04)
	float ParachuteTurnChangeSpeedPitch; // 0x1140(0x04)
	float ParachuteTurnChangeSpeedRoll; // 0x206c(0x04)
	float HeightToGetInParachuteFromLand; // 0x2f00(0x04)
	float ForceHeightToGetInParachuteFromLand; // 0x40a8(0x04)
	struct FVector_NetQuantize ReplicatedParachuteVelocity; // 0x3590(0x0c)
	struct UCurveFloat* ParachutePitchCurve; // 0x1b20(0x08)
	struct TArray<struct TSoftObjectPtr<UMaterialInterface>> ParachuteSkinMaterials; // 0x3028(0x10)
	struct UMaterialInterface* CurrentParachuteSkin; // 0x3320(0x08)
	bool bChangeNearClipPlane; // 0x3448(0x01)
	float DescentStartZPosition; // 0x24c0(0x04)
	float ParachuteAvailableFallingDistance; // 0x2cc4(0x04)
	float DescentZ; // 0x11d0(0x04)
	float SeaLevelZ; // 0x123c(0x04)
	float SaveMaxWalkSpeed; // 0x30fc(0x04)
	float SaveCameraBoomLocationZ; // 0x2234(0x04)
	float PosToGetInParachute; // 0x3eec(0x04)
	struct UCameraPostProcessPreset* AccelerationPPClass; // 0x3a68(0x08)
	struct UCurveFloat* RadialOnDescentCurve; // 0xca8(0x08)
	float RadialRate; // 0x28c4(0x04)
	float DescentBlurWidth; // 0x22d0(0x04)
	struct UCameraPostProcessPreset* AccelerationPPInst; // 0x3bf0(0x08)
	float TargetSpringArmLengthDescent; // 0xa20(0x04)
	float SpeedSpringArmLengthDesecnt; // 0xc64(0x04)
	bool bDescentCameraShakeLoop; // 0x3849(0x01)
	float DescentCameraShakeDelay; // 0x2f60(0x04)
	struct UCameraShake* DescentCameraShake; // 0xd60(0x08)
	struct UParticleSystem* CloudFxEmitterTemplate; // 0x1a28(0x08)
	struct UParticleSystemComponent* CloudFxInDescent; // 0x998(0x08)
	float VelocityZ_LandStop; // 0x2508(0x04)
	float VelocityZ_Falling; // 0x1b30(0x04)
	float PrevMeshRelativeZ; // 0x2b74(0x04)
	float PronedEyeHeight; // 0x2718(0x04)
	bool bIsProneWeaponIdle; // 0x3b8c(0x01)
	bool bIsAutoSprint; // 0x38a0(0x01)
	float PronedDeltaHeightCamera3P; // 0x18ac(0x04)
	float CrouchedDeltaHeightCamera3P; // 0x2448(0x04)
	float CrouchMovedDeltaHeightCamera3P; // 0x1a30(0x04)
	float StandDeltaHeightCamera3P; // 0x1b38(0x04)
	float StandSprintDeltaHeightCamera3P; // 0x1c7c(0x04)
	struct FVector Camera1PInterpSrc; // 0x21dc(0x0c)
	struct FVector Camera3PInterpSrc; // 0x1314(0x0c)
	struct FVector Camera3PInterpDst; // 0x1070(0x0c)
	float TargetArmLength; // 0x1634(0x04)
	float TargetArmLengthInterpSpeed; // 0x407c(0x04)
	float TargetArmLengthInterpSpeed_AMP; // 0x3e38(0x04)
	float TargetArmLengthInterpSpeed_HeartBeatSensor; // 0xfac(0x04)
	float TargetFieldOfView; // 0x12a4(0x04)
	struct FVector TargetSocketOffset; // 0x40d0(0x0c)
	float DefaultCameraLag; // 0x23d0(0x04)
	float ReturnCameraLag; // 0x2048(0x04)
	struct FVector DefaultSocketOffset_VehicleAOS; // 0x2f34(0x0c)
	struct FVector DefaultSocketOffset_LeftHipshot; // 0x2c74(0x0c)
	struct FVector DefaultSocketOffset_Hipshot; // 0x1320(0x0c)
	struct FVector DefaultSocketOffset_RightHipshot; // 0x3fb8(0x0c)
	struct FVector DefaultSocketOffset_LeftLeanAOS; // 0x2134(0x0c)
	struct FVector DefaultSocketOffset_RightLeanAOS; // 0x2114(0x0c)
	struct FVector DefaultSocketOffset_LeftAOS_Idle; // 0x2564(0x0c)
	struct FVector DefaultSocketOffset_RightAOS_Idle; // 0x1750(0x0c)
	struct FVector DefaultSocketOffset_LeftAOS_Crouch; // 0x10e0(0x0c)
	struct FVector DefaultSocketOffset_RightAOS_Crouch; // 0x3a80(0x0c)
	struct FVector DefaultSocketOffset_LeftAOS_Prone; // 0x3090(0x0c)
	struct FVector DefaultSocketOffset_RightAOS_Prone; // 0x1958(0x0c)
	struct FVector DefaultTargetOffset_HipShot; // 0x177c(0x0c)
	struct FVector DefaultTargetOffset_AOS_Stand_Idle; // 0x11f0(0x0c)
	struct FVector DefaultTargetOffset_AOS_Stand_Lean; // 0x1da0(0x0c)
	struct FVector DefaultTargetOffset_AOS_Crouch_Idle; // 0x2bb8(0x0c)
	struct FVector DefaultTargetOffset_AOS_Crouch_Lean; // 0x3ae0(0x0c)
	float DefaultTargetArmLength_Hipshot; // 0x2a40(0x04)
	float DefaultTargetArmLength_AOS; // 0x3718(0x04)
	float Camera3P_FOV_InterpSpeed; // 0x30e8(0x04)
	float Camera3P_AMP_FOV_InterpSpeed; // 0x1498(0x04)
	float Camera3P_HeartBeatSensor_FOV_InterpSpeed; // 0x3c08(0x04)
	float Camera3P_Lean_InterpSpeed; // 0x12e8(0x04)
	struct AActor* DeathCamClass; // 0x2038(0x08)
	float DeathBeginTime; // 0x15ac(0x04)
	struct USkeletalMesh* BodyBaseSkeletalMesh; // 0x6c0(0x08)
	struct TArray<struct USkeletalMesh*> PendingReleaseMutableMesh_TPP; // 0x2ac0(0x10)
	struct TArray<struct USkeletalMesh*> PendingReleaseMutableMesh_FPP; // 0x3e40(0x10)
	bool bNeedToUpdatePreviewPawn; // 0x18d0(0x01)
	struct UCustomizableObjectInstance* Mutable_MaleInstance; // 0x2b80(0x08)
	struct UCustomizableObjectInstance* Mutable_FemaleInstance; // 0xe50(0x08)
	struct UCustomizableObjectInstance* Mutable_BotInstance; // 0x1ea8(0x08)
	struct ABravoHotel3DViewActor* PreviewPawn; // 0x3c58(0x08)
	struct ABravoHotelInventoryCharacter* InventoryCharacterClass; // 0x2bb0(0x08)
	struct ABravoHotelInventoryCharacter* InventoryCharacter; // 0x30f0(0x08)
	struct FMulticastInlineDelegate OnUpdateCastingDelegate; // 0x708(0x10)
	int32_t UsingBackpackItemIndex; // 0x3fec(0x04)
	float ItemInterruptInputSeconds; // 0x309c(0x04)
	struct FTimerHandle CastingItemTimer; // 0x21e8(0x08)
	struct FTimerHandle CastingSupplyTimer; // 0x3588(0x08)
	struct FTimerHandle CastingItemMontageTimer; // 0x1d48(0x08)
	struct FAnimSlot LastCastingItemAnimSlot_Stand; // 0xd30(0x10)
	struct FAnimSlot LastCastingItemAnimSlot_Prone; // 0xa10(0x10)
	struct TArray<struct UAkAudioEvent*> CastingStopEvents; // 0x2730(0x10)
	bool bIsCastingItem; // 0x1ba1(0x01)
	struct FCompletedCasting CompletedCastingInfo; // 0x2530(0x08)
	int32_t BasicSetting_gender; // 0xb48(0x04)
	int32_t BasicSetting_face; // 0x23d4(0x04)
	int32_t BasicSetting_face_color; // 0x40f4(0x04)
	int32_t BasicSetting_hair; // 0x2ca4(0x04)
	int32_t BasicSetting_hair_color; // 0x2298(0x04)
	int32_t BasicSetting_makeup; // 0x3c6c(0x04)
	struct TArray<struct FInventoryItemInfo> BasicSettingItemInfos; // 0x4068(0x10)
	struct FName CombineTargetRecipe; // 0x19fc(0x0c)
	struct TArray<struct FName> CombineTargetMaterials; // 0x2d18(0x10)
	struct UAkAudioEvent* CombineCompleteAudioEvent; // 0x1c60(0x08)
	bool bEnabledFur; // 0x20c0(0x01)
	struct FName WearableNameHasFur; // 0x1c3c(0x0c)
	float CooldownTimeForEnterVehicle; // 0x10d0(0x04)
	float CoolDownTimeForUseLadder; // 0x3158(0x04)
	struct TArray<struct ABravoHotelVehicle*> NearbyVehicles; // 0xec0(0x10)
	struct FMulticastInlineDelegate Delegate_OnEnteredVehicle; // 0x718(0x10)
	float MaxVehicleEscapeSpeed; // 0x1440(0x04)
	struct UBravoHotelVehicleSeatComponent* PreviousVehicleSeat; // 0x1c68(0x08)
	struct TArray<struct ABravoHotelProjectileGrenade*> ProjectileGrenades; // 0x3d18(0x10)
	struct FMulticastInlineDelegate OnChangeProjectilePredictPath; // 0x3e88(0x10)
	bool IsBlind; // 0x12f8(0x01)
	struct FMulticastInlineDelegate OnAirCraftDelegate; // 0x27a8(0x10)
	struct FMulticastInlineDelegate OnCharacterGroundStateChangeDelegate; // 0x3828(0x10)
	float FlashBangAngle; // 0x1228(0x04)
	struct UCameraPostProcessPreset* PostProcessFlashBangClass; // 0x39e8(0x08)
	struct UAkAudioEvent* GrenadeFlashBangStartEvent; // 0x2818(0x08)
	struct UAkAudioEvent* GrenadeFlashBangEndEvent; // 0x3508(0x08)
	struct UAkAudioEvent* GrenadeFragmentExplosionSineStopEvent; // 0x2e18(0x08)
	float FallingDamagedBloodAlpha; // 0x3120(0x04)
	struct UCameraPostProcessPreset* PostProcessBloodHitClass; // 0x35a8(0x08)
	struct UCurveFloat* DamagedDissolveAnimationCurve; // 0x1c98(0x08)
	struct UCameraPostProcessPreset* PostProcessBloodHit; // 0x2f08(0x08)
	float DamagedDissolveRateTime; // 0x313c(0x04)
	float DamagedTermTime; // 0xd1c(0x04)
	float DamagedDissolveAnimaitionMaxTime; // 0x2c90(0x04)
	float HitBlinkTime; // 0x24c4(0x04)
	float InternalDamagedTermTime; // 0x1ba4(0x04)
	float InternalHitBlinkTime; // 0x38d0(0x04)
	float DamagedDissolveAnimationValue; // 0x346c(0x04)
	bool IsEndTermTime; // 0x3a04(0x01)
	bool IsPlayingDamage; // 0xeb8(0x01)
	bool IsHit; // 0x255c(0x01)
	bool IsDissolve; // 0x250e(0x01)
	bool DamageReset; // 0x1164(0x01)
	int32_t HitBlinkState; // 0x2760(0x04)
	int32_t CurrentDamageCount; // 0x137c(0x04)
	int32_t DissolveCount; // 0x3478(0x04)
	struct UCameraPostProcessPreset* PostProcessOuterPlayZoneClass; // 0x2ea0(0x08)
	float ShowTimePostProcessOuterPlayZone; // 0x1c08(0x04)
	struct FTimerHandle TimerHandle_OuterPlayZone; // 0x29f8(0x08)
	struct UCameraPostProcessPreset* PostProcessBlueZoneHitClass; // 0x1660(0x08)
	struct FTimerHandle TimerHandle_BlueZone; // 0x2280(0x08)
	struct UCameraPostProcessPreset* PostProcessMagneticHitClass; // 0x2088(0x08)
	struct UCameraPostProcessPreset* PostProcessMagneticHit; // 0x1b40(0x08)
	struct UCurveFloat* MagneticDamagedDissolveAnimationCurve; // 0x2f20(0x08)
	float MagneticDamagedTermTime; // 0x2c84(0x04)
	float MagneticDamagedDissolveAnimaitionMaxTime; // 0x1630(0x04)
	float MagneticHitBlinkTime; // 0x2a00(0x04)
	float InternalMagneticDamagedTermTime; // 0x2d7c(0x04)
	float InternalMagneticHitBlinkTime; // 0x2978(0x04)
	float MagneticDamagedDissolveAnimationValue; // 0x1680(0x04)
	float BluezoneMaterialOnTime; // 0x308c(0x04)
	bool IsMagneticEndTermTime; // 0x120c(0x01)
	bool IsMagneticDamage; // 0x4080(0x01)
	bool IsMagneticHit; // 0x36a9(0x01)
	bool IsMagneticDissolve; // 0x12c0(0x01)
	bool MagneticDamageReset; // 0x1684(0x01)
	struct UCameraPostProcessPreset* PostProcessDustClass; // 0x28b8(0x08)
	struct UCurveFloat* DustDissolveAnimationCurve; // 0x3d10(0x08)
	struct UCameraPostProcessPreset* PostProcessDust; // 0x2758(0x08)
	float DustDissolveAnimaitionMaxTime; // 0x40dc(0x04)
	float DustDissolveDelayTime; // 0x2090(0x04)
	float InternalDustDissolveDelayTime; // 0x2d34(0x04)
	float DustDissolveAnimationValue; // 0x1c38(0x04)
	bool IsOnDust; // 0x32b8(0x01)
	bool IsDustDissolve; // 0xb21(0x01)
	bool DustReset; // 0x233a(0x01)
	struct ABravoHotelPickup* LastPickup; // 0x3198(0x08)
	struct UCameraPostProcessPreset* PP_Preset_PickupOutline; // 0x1298(0x08)
	struct UCameraPostProcessPreset* PP_PickupOutlineRef; // 0x4030(0x08)
	float CurrentOutlineThickness; // 0x3050(0x04)
	float InitOutlineThickness; // 0x2d78(0x04)
	float MaxOutlineThickness; // 0x10d4(0x04)
	float OutlineThicknessInterpSpeed; // 0x311c(0x04)
	float CurrentCameraModifyerX; // 0x3a70(0x04)
	float CurrentCameraModifyerY; // 0x3048(0x04)
	enum class EMouseSensitivityState CurrentEMouseSensitivityState; // 0x1640(0x01)
	bool bPendingOpenDoor; // 0x2120(0x01)
	struct ABravoHotelDoor* KickTargetDoor; // 0x2148(0x08)
	struct UParticleSystem* DoorBreachingParticle; // 0x3bb8(0x08)
	struct UParticleSystem* WindowBreachingParticle; // 0x3788(0x08)
	struct UAkAudioEvent* BreachingAudioEvent; // 0x2028(0x08)
	struct UAkAudioEvent* BreachingAudioEvent_Silence; // 0x1a18(0x08)
	struct UBravoHotelAnimInstance* AnimInstance; // 0x3a78(0x08)
	struct UBravoHotelAnimInstancePostprocess* PostprocessAnimInstance; // 0x3bb0(0x08)
	struct UBravoHotelAnimInstanceFPP* AnimInstance_FPP; // 0x2020(0x08)
	struct UBravoHotelAnimInstanceFPP* AnimClass_FPP; // 0x1550(0x08)
	struct ABravoHotelGameState* BravoHotelGameState; // 0x3450(0x08)
	struct ABravoHotelPlayerController* BravoHotelPlayerController; // 0x2e80(0x08)
	int32_t IdleNum; // 0x1310(0x04)
	float IdleWaitingTime; // 0xb24(0x04)
	struct FName LevelUpEffectBuffName; // 0x1348(0x0c)
	struct TArray<struct FName> DefaultBuffName; // 0x24f8(0x10)
	struct TArray<struct FPerkInfo> DefaultPerkInfo; // 0x1a48(0x10)
	struct TArray<struct FString> UberUser; // 0xbf8(0x10)
	struct TArray<struct FPerkInfo> CurrentPerkInfos; // 0x3dd8(0x10)
	struct FPerkInfo UltimatePerkInfo; // 0x3d60(0x30)
	struct TArray<struct FPerkUIInfo> PerkUIInfos; // 0x38c0(0x10)
	struct FPerkUIInfo UltimateUIInfo; // 0x3b30(0x40)
	struct TArray<struct FPerkDeckElement> CurrentPerkCards; // 0x30a8(0x10)
	struct FMatchClassInfo OverrideMatchClassInfo; // 0xf70(0x28)
	struct TArray<struct FMutableData> MutableBuffList; // 0x1700(0x10)
	struct UAutoAimBuffData* AutoAimBuffDatas; // 0x770(0x08)
	enum class EBuffEventType CurrentSkillType; // 0x2e10(0x01)
	struct FMulticastInlineDelegate OnChangeFireType; // 0x2b60(0x10)
	struct FMulticastInlineDelegate Delegate_OnEndSearchInstinct; // 0x19e8(0x10)
	struct TArray<struct AActor*> UsedTrapList; // 0x3578(0x10)
	enum class EPerkLevelUpType PerkLevelUpType; // 0x1d3c(0x01)
	struct FMulticastInlineDelegate OnChangedClassLevel; // 0x1670(0x10)
	struct TArray<struct FName> ChangedPerkNameList; // 0x19c8(0x10)
	int32_t ActiveSkillInitIndex; // 0x18b0(0x04)
	int32_t ActiveSkillCount; // 0x3e60(0x04)
	struct FDisplayAbility CurrentDisplayAbility; // 0x2538(0x0c)
	struct TArray<struct UObject*> LoadedClasses; // 0x2938(0x10)
	int32_t PerkDeckChangingCount; // 0x3270(0x04)
	struct FMulticastInlineDelegate OnMovementInputPressedDelegate; // 0x7a8(0x10)
	float Input_LockTime; // 0x2c88(0x04)
	char bIsMoving : 1; // 0x344a(0x01)
	char bForceMoving : 1; // 0xb8c(0x01)
	struct UBravoHotelDamageType* LastDamagedType; // 0xaa0(0x08)
	float LastDamagedAmount; // 0x3e78(0x04)
	struct UBravoHotelDamageType* LastHitType; // 0x27c8(0x08)
	struct FBravoHotelTakeDamageInfo LastSimulatedTakeDamageInfo; // 0x23f0(0x58)
	struct FHitResult DebuffHitResult; // 0x17b0(0x90)
	struct UBravoHotelDamageType* DebuffHitDamageType; // 0x3f88(0x08)
	struct TArray<struct FAnimSlot> TakeDamageMontageList; // 0x3868(0x10)
	struct UParticleSystem* BloodSplatterEffect; // 0x3128(0x08)
	struct UParticleSystem* PunchEffect; // 0x2a90(0x08)
	struct UParticleSystem* ThrowingWeaponDirectHitEffect; // 0x3740(0x08)
	float BloodEffectNearbyDist; // 0xdc4(0x04)
	struct FBravoHotelDefaultItemSetting DefaultItemSetting; // 0x1ca8(0x38)
	struct FBravoHotelDefaultWearableSetting DefaultWearableSetting; // 0x3760(0x18)
	struct TArray<struct FBravoHotelItemPresetForBlackMarket> BlackMarketItemPresetList; // 0x3c90(0x10)
	struct FMulticastInlineDelegate OnCanProneFailedDelegate; // 0x7c0(0x10)
	bool bShowProneTraceDebug; // 0x7d8(0x01)
	float MinDamageableFallingSpeed; // 0x3ec0(0x04)
	float MaxDamageableFallingSpeed; // 0xa60(0x04)
	float MinDamageableFallingSpeedFromVehicle; // 0x1768(0x04)
	float MaxDamageableFallingSpeedFromVehicle; // 0x28b0(0x04)
	enum class ELandingReason LandingReason; // 0x250c(0x01)
	struct FMulticastInlineDelegate Delegate_OnExitFallingState; // 0x13e0(0x10)
	struct TArray<struct TWeakObjectPtr<struct UBravoHotelPhysicalMaterial>> OverlappedPhysicMaterials; // 0x1338(0x10)
	float BushSoundSpawnDelay; // 0x2c40(0x04)
	float BushLandingDamageMultiplier; // 0x2a04(0x04)
	struct TSet<struct UPrimitiveComponent*> OverlappedCantProneComponent; // 0x9a8(0x50)
	bool bIsInsideBlueZone; // 0x1ba0(0x01)
	bool bIsSpectated; // 0x2998(0x01)
	struct UCurveFloat* CurrentCameraCurve; // 0x988(0x08)
	struct UCurveFloat* CurrentCameraHeightCurve; // 0x1d68(0x08)
	struct TMap<struct FName, struct FVector> Camera3P_DeltaTargetOffsets; // 0xcc8(0x50)
	struct TMap<struct FName, float> Camera3P_DeltaTargetArmLengthOffsets; // 0x2188(0x50)
	bool bReplaceFreeLook; // 0x18b8(0x01)
	bool bUpdateDeathRotation; // 0x28c0(0x01)
	struct FVector RagdollLocation; // 0x38f8(0x0c)
	struct FVector RagdollVelocity; // 0x2544(0x0c)
	struct UDamageType* LastDamageType; // 0xb30(0x08)
	float Ragdoll_ZOffset; // 0xa28(0x04)
	bool bApplyRagdollForce; // 0x2764(0x01)
	struct UBravoHotelCharacterMovementComponent* BravoHotelCharacterMovement; // 0x7f8(0x08)
	enum class EMovementMode PrevMovementMode; // 0x2460(0x01)
	enum class EMovementMode NewMovementMode; // 0xa64(0x01)
	enum class ECustomMovementMode PrevCustomMovementMode; // 0x1b18(0x01)
	enum class ECustomMovementMode NewCustomMovementMode; // 0x3848(0x01)
	struct FVector MovementInputVector; // 0x30b8(0x0c)
	struct FTimeline Timeline_TunnelEffect; // 0x1f08(0xa8)
	struct TMap<enum class EWeaponAttachmentItem, struct UCurveFloat*> Curve_TunnelEffect; // 0x1b50(0x50)
	struct FTimeline Timeline_CameraInterp; // 0x3380(0xa8)
	struct UCurveFloat* Curve_CameraInterp; // 0x12c8(0x08)
	struct UCurveFloat* Curve_AdsCameraInterp; // 0x1e68(0x08)
	struct FTimerHandle TimerHandle_MinTimeJumpingBeforeLand; // 0xd48(0x08)
	float MinTimeJumpingBeforeLand; // 0x274c(0x04)
	float DescentXYAcc; // 0x2464(0x04)
	float DescentAirControl; // 0x1bb4(0x04)
	float DescentSpeed; // 0x2510(0x04)
	float DescentGravityScale; // 0xaa8(0x04)
	float DescentDeacceleration; // 0x1fcc(0x04)
	float DescentMaxAcceleration; // 0x29ac(0x04)
	struct FVector DescentCameraLocation; // 0x31f8(0x0c)
	float ParachuteAirControl; // 0x3ac0(0x04)
	float ParachuteSpeed; // 0x3bac(0x04)
	float ParachuteGravity; // 0x2270(0x04)
	float ParachuteDeacceleration; // 0x2170(0x04)
	float ParachuteMaxAcceleration; // 0x3308(0x04)
	struct FVector ParachuteCameraLocation; // 0x3ab4(0x0c)
	float ParachuteSocketOffsetY; // 0x1f04(0x04)
	float ParachuteSocketDeltaOffsetZ; // 0x3b90(0x04)
	float ParachuteReadyToLandHeight; // 0x3fa8(0x04)
	float ParachuteQuickLandingStartHeight; // 0x2ab0(0x04)
	float ParachuteQuickLandingStartRadius; // 0x2f90(0x04)
	float ParachuteQuickLandingVelocityModifierXY; // 0x1924(0x04)
	float ParachuteQuickLandingVelocityModifierZ; // 0x2cfc(0x04)
	float ParachuteQuickLandingDMGRate; // 0x3c3c(0x04)
	bool bCanQuickLanding; // 0x14b8(0x01)
	struct FVector LastQuickLandingAllowedLocation; // 0x15c4(0x0c)
	struct FVector ParachuteTargetCameraLocation; // 0xcb4(0x0c)
	float ParachuteTargetCameraSpeed; // 0x2d30(0x04)
	float ParachuteTargetArmLengthSpeedStart; // 0x3dc8(0x04)
	float ParachuteTargetArmLengthSpeedEnd; // 0x1208(0x04)
	struct UCameraShake* ParachuteUnfoldCameraShake; // 0x32b0(0x08)
	struct UAkAudioEvent* BreathStartEvent; // 0x2790(0x08)
	struct UAkAudioEvent* BreathEndEvent; // 0x2ea8(0x08)
	struct UAkAudioEvent* BreathStopEvent; // 0x2a48(0x08)
	struct FVector2D SprintingBeginRange; // 0x2888(0x08)
	struct FVector2D SprintingRange; // 0x384c(0x08)
	float ReduceCharacterSpeedTime; // 0x1ce0(0x04)
	float InternalReduceCharacterSpeedTime; // 0x3044(0x04)
	bool IsInReduceSpeedExplosionRange; // 0xc90(0x01)
	struct UDataTable* PostProcessEffectsTable; // 0x2070(0x08)
	struct TMap<struct FName, struct FBravoHotelPostProcessSettings> PostProcessAssignedList; // 0x28e0(0x50)
	struct TArray<struct UCameraPostProcessPreset*> PostProcessBuffList; // 0x12d8(0x10)
	int32_t CurrentTerrainType; // 0x347c(0x04)
	struct FVector AttachInAircraftOffset; // 0x2ebc(0x0c)
	struct FRotator AttachInAircraftRotationOffset; // 0x2d90(0x0c)
	struct FVector AttachInAircraftCameraLocaiton; // 0x2010(0x0c)
	float InitSpringArmLengthInAircraft; // 0x2154(0x04)
	float TargetSpringArmLengthInAircraft; // 0x3c34(0x04)
	float SpeedSpringArmLengthInAirCraft; // 0xdc0(0x04)
	float PrevBloomIntensity; // 0x24c8(0x04)
	float PrevBloomThreshold; // 0x2104(0x04)
	float TargetBloomIntensityInAirCraft; // 0xc08(0x04)
	float SpeedBloomIntensityInAirCraft; // 0x2b58(0x04)
	float BloomStartDelayTimeInAirCraft; // 0x2000(0x04)
	float CineDurationTimeMax; // 0x18b4(0x04)
	float CineTextAnimationAppearTime; // 0x2bc4(0x04)
	float GetPerkOnStartTime; // 0x3dc0(0x04)
	struct UBravoHotelCameraComponent* FPSK_Camera; // 0x2350(0x08)
	struct UCustomizableSkeletalComponent* FPSK_MutableArms; // 0xa00(0x08)
	struct USkeletalMeshComponent* FPSK_Arms; // 0x1250(0x08)
	struct FVector FPSK_CameraHeight; // 0x2fa8(0x0c)
	float FPSK_CameraProbe; // 0x3cd8(0x04)
	float FPSK_CameraPitchDeltaX; // 0x36ac(0x04)
	struct FVector FPSK_CameraLocation_Idle; // 0x3c28(0x0c)
	struct FName FPSK_CameraBone_Idle; // 0x3bc0(0x0c)
	struct FVector FPSK_CameraLocation_ADS; // 0x1230(0x0c)
	struct FVector FPSK_CameraLocation_Parkour; // 0x409c(0x0c)
	struct FName FPSK_CameraBone_Parkour; // 0x11fc(0x0c)
	float FPSK_CameraHeight_Stand; // 0x2358(0x04)
	float FPSK_CameraHeight_Crouch; // 0x20a0(0x04)
	float FPSK_CameraHeight_Prone; // 0x20d8(0x04)
	struct FVector FPSK_CameraLocation_Collide; // 0xa88(0x0c)
	struct FVector FPSK_CameraLocation_LeftLeanDelta; // 0x1dac(0x0c)
	struct FVector FPSK_CameraLocation_RightLeanDelta; // 0x1e50(0x0c)
	float FPSK_CameraLocation_CollideAlpha; // 0x2ccc(0x04)
	struct FVector FPSK_StartCameraHeight; // 0x2f40(0x0c)
	struct FVector FPSK_DestCameraHeight; // 0x3948(0x0c)
	struct USkeletalMeshComponent* FPSK_WeaponShadow; // 0x1850(0x08)
	struct UStaticMeshComponent* FPSK_SightShadow; // 0x2ba0(0x08)
	struct UStaticMeshComponent* FPSK_GripShadow; // 0x2360(0x08)
	struct UStaticMeshComponent* FPSK_MagazineShadow; // 0x2fc8(0x08)
	struct UStaticMeshComponent* FPSK_StockShadow; // 0x4090(0x08)
	struct UStaticMeshComponent* FPSK_TacticalAttachmentShadow; // 0x1710(0x08)
	struct USkeletalMeshComponent* FPSK_BarrelShadow; // 0x1948(0x08)
	struct USkeletalMeshComponent* FPSK_MuzzleShadow; // 0x35a0(0x08)
	struct TArray<struct UMeshComponent*> FPSK_WeaponAttachments; // 0x39a8(0x10)
	float FPSK_CollideCheckLength; // 0xc8c(0x04)
	float FPSK_CollideAngleCheckLength; // 0x2b78(0x04)
	bool bFPSK_UseCustomCurve; // 0x1260(0x01)
	bool bFPSK_IsFPSMode; // 0x21fc(0x01)
	struct FTransform FPSK_CurrentWeaponTransform; // 0x2200(0x30)
	struct FTransform FPSK_IdleWeaponTransform; // 0x1570(0x30)
	struct FTransform FPSK_CollideWeaponTransform; // 0xf40(0x30)
	struct FTransform FPSK_ADS_DefaultWeaponTransform; // 0xfe0(0x30)
	struct FTransform FPSK_ADS_TargetWeaponTransform; // 0x2580(0x30)
	struct FTransform FPSK_ADS_DefaultWeaponTransform_BasicSightCache; // 0xb90(0x30)
	struct FTransform FPSK_ADS_DefaultWeaponTransform_CurrentSightCache; // 0xb50(0x30)
	struct FTransform FPSK_ADS_WeaponTransform; // 0x3a10(0x30)
	struct FTransform FPSK_UnHandWeaponTransformIdle; // 0x34d0(0x30)
	struct FTransform FPSK_UnHandWeaponTransformADS; // 0xd90(0x30)
	float FPSK_ADSFOV; // 0x14c4(0x04)
	float FPSK_AOSFOV; // 0x209c(0x04)
	float FPSK_DefaultFOV; // 0x3328(0x04)
	float FPSK_CurrentMagnificationFactor; // 0x2ce0(0x04)
	float FPSK_TargetMagnificationFactor; // 0x30a0(0x04)
	struct UMaterialParameterCollection* MPC_WeaponFov; // 0x24d0(0x08)
	struct FVector FPSK_CurrentCameraRelativeLocation; // 0x4018(0x0c)
	float FPSK_ADSAlpha; // 0x2a28(0x04)
	float FPSK_StartFOV_Delta; // 0x40e0(0x04)
	float CameraInterpPlayRate; // 0x2004(0x04)
	float AdsCameraInterpPlayRate; // 0x2b94(0x04)
	float FPSK_TargetADSAlpha; // 0x30ec(0x04)
	struct FTimeline FPSK_Timeline_Sway_Idle; // 0x35b0(0xa8)
	struct FTimeline FPSK_Timeline_Sway_Move; // 0x1a70(0xa8)
	struct UCurveVector* FPSK_Curve_Sway_Idle_Default; // 0x2d80(0x08)
	struct UCurveVector* FPSK_Curve_Sway_Move_Default; // 0x3ed8(0x08)
	struct UCurveFloat* FPSK_Curve_Sway_Scale_With_Fov; // 0x1ba8(0x08)
	struct UCurveVector* FPSK_Curve_Sway_Idle; // 0x3300(0x08)
	struct UCurveVector* FPSK_Curve_Sway_Move; // 0x1968(0x08)
	bool bUseFPSK_Sway; // 0x24f0(0x01)
	float FPSK_SwayAlpha; // 0x359c(0x04)
	float FPSK_SwayAlphaMin; // 0x1c30(0x04)
	float FPSK_SwayAlphaMax; // 0x2a98(0x04)
	float FPSK_SwayScale; // 0x3114(0x04)
	struct FRotator FPSK_SwayRotationIdle; // 0x1ec4(0x0c)
	struct FRotator FPSK_SwayRotationMove; // 0x1e38(0x0c)
	struct FRotator FPSK_SwayRotationDeltaForSteadyAim; // 0x173c(0x0c)
	float FPSK_SwayInterpSpeed; // 0x2e60(0x04)
	struct FRotator FPSK_LeanRotation; // 0x2e20(0x0c)
	struct FVector FPSK_LeanLocation; // 0x16f4(0x0c)
	struct FTransform FPSK_CurrentCollideWeaponTransform; // 0x1110(0x30)
	float FPSK_CollideAlpha; // 0x303c(0x04)
	float FPSK_CollideAngle; // 0x2550(0x04)
	float FPSK_CollideAngle_LocalCache; // 0x175c(0x04)
	bool bFPSK_IsCollide; // 0x2e58(0x01)
	struct TMap<enum class EWeaponAttachmentItem, struct UCurveFloat*> FPSK_Curves_TunnelEffect; // 0xef0(0x50)
	float FPSK_TargetFOV; // 0x26ec(0x04)
	struct FTimerHandle TimerHandle_NoCarLandingDamageToTeam; // 0x12d0(0x08)
	float InAircraftNearClipPlane; // 0x1950(0x04)
	struct TArray<struct ABravoHotelCharacter*> AIBot_SearchedEnemyList; // 0x27f0(0x10)
	bool bEnableCustomDepth; // 0x2274(0x01)
	struct TMap<struct FName, struct FBravoHotelCameraPPUpdateInfo> CameraPostProcessUpdateList; // 0x830(0x50)
	struct FTimerHandle TimerHandle_HurtCondition; // 0x2e50(0x08)
	float ProneDamageScaleInRedZone; // 0x2230(0x04)
	struct UAkAudioEvent* BlueZoneFreezeEvent; // 0x1608(0x08)
	struct UAkAudioEvent* BlueZoneFreezeStopEvent; // 0x3348(0x08)
	struct UAkAudioEvent* BlueZoneDroneEvent; // 0x1330(0x08)
	struct UAkAudioEvent* BlueZoneDroneStopEvent; // 0x2e90(0x08)
	struct UAkAudioEvent* SupplyBoxNotifyAlertMe; // 0xd80(0x08)
	struct UAkAudioEvent* SupplyBoxNotifyAlertOther; // 0x2930(0x08)
	float CheckFreezeDistance; // 0x2ab4(0x04)
	float CheckDroneDistance; // 0x2ae8(0x04)
	struct FVector DefaultSocketOffset_LeftLeanAMP; // 0x3480(0x0c)
	struct FVector DefaultSocketOffset_RightLeanAMP; // 0x2240(0x0c)
	struct FVector DefaultSocketOffset_RightAMP; // 0x32f0(0x0c)
	struct FVector DefaultSocketOffset_LeftAMP; // 0x2784(0x0c)
	float DefaultTargetArmLength_AMP; // 0x3d90(0x04)
	float AmplifierFocusDistance; // 0x2a70(0x04)
	struct FVector DefaultSocketOffset_LeftLeanHeartBeatSensor; // 0xbdc(0x0c)
	struct FVector DefaultSocketOffset_RightLeanHeartBeatSensor; // 0x3894(0x0c)
	struct FVector DefaultSocketOffset_RightHeartBeatSensor; // 0x12a8(0x0c)
	struct FVector DefaultSocketOffset_LeftHeartBeatSensor; // 0x3108(0x0c)
	float DefaultTargetArmLength_HeartBeatSensor; // 0x1ec0(0x04)
	float HeartBeatSensorFocusDistance; // 0x351c(0x04)
	float CameraFocusDistanceAOS; // 0x1178(0x04)
	float CameraFocusDistanceADS; // 0x3e80(0x04)
	float CameraFocusDistanceHipShotFPP; // 0x2150(0x04)
	float CameraFocusCurrentAperture; // 0x24a8(0x04)
	struct UPostProcessComponent* CurrentWeaponPostProcessComponent; // 0x2378(0x08)
	float DetectedByEnemyDelayTime; // 0x1c34(0x04)
	float AirWalkStartTime; // 0xf9c(0x04)
	struct FTimerHandle TimerHandle_StopAirWalk; // 0x3470(0x08)
	float AirWalkBestRecord; // 0x1728(0x04)
	float AirWalkTotalRecord; // 0xb10(0x04)
	struct UAkAudioEvent* AirWalkAudioEvent; // 0x1e88(0x08)
	float CurrentAirWalkVelocityZ; // 0x3118(0x04)
	float AirWalkDuration; // 0xa98(0x04)
	float AirWalkGravity; // 0x1428(0x04)
	struct UBHPersonalSupplySystemComponent* PersonalSupplySystemComponent; // 0x2080(0x08)
	enum class ENetworkSmoothingMode PrevNetworkSmoothingMode; // 0x226d(0x01)
	struct FTimerHandle TimeHandle_SkyDive; // 0x890(0x08)
	bool bActiveCriticalTime; // 0x1fc8(0x01)
	float CriticalTimeTickInterval; // 0x1d00(0x04)
	float CriticalTimeLimitTime; // 0x1378(0x04)
	struct FVector CriticalTimeMeshLocaiton; // 0x247c(0x0c)
	struct TMap<struct UActorComponent*, float> CriticalTimeComponentTickIntervals; // 0x1de0(0x50)
	float ParachuteEnableHieght; // 0x12ec(0x04)
	struct ABravoHotelParachuteTriggerBox* ParachuteTriggerBox; // 0x1760(0x08)
	struct FHitResult CurHit; // 0x3794(0x90)
	struct UCurveFloat* Curve_Sliding; // 0xc80(0x08)
	struct UParticleSystem* ParticleSystem_Sliding; // 0xd58(0x08)
	struct FName ParticleSystemName_Sliding; // 0xe7c(0x0c)
	struct UParticleSystemComponent* ParticleSystemComponent_Sliding; // 0x18d8(0x08)
	float RollingStartTime; // 0x1358(0x04)
	struct UCameraPostProcessPreset* PostProcessWetFogClass; // 0x1910(0x08)
	struct TArray<struct ABravoHotelAreaSkillZone*> ActiveWetFogAreas; // 0x3c40(0x10)
	struct FAreaSkillZoneInfo WetFogInfo; // 0xa30(0x20)
	struct FWetFogZoneInfo WetFogZoneInfo; // 0x233c(0x0c)
	struct FTimerHandle TimerHandle_WetFog; // 0x22f8(0x08)
	struct UCameraPostProcessPreset* PostProcessBlackOutClass; // 0x2108(0x08)
	struct FName PostProcessBlackOutClassName; // 0x390c(0x0c)
	struct TArray<struct ABravoHotelAreaSkillZone*> ActivePowerInterruptions; // 0x20b0(0x10)
	struct FAreaSkillZoneInfo BlackOutInfo; // 0xae0(0x20)
	struct FTimerHandle TimerHandle_BlackOut; // 0x4088(0x08)
	struct UAkAudioEvent* StartBlackOutAudioEvent; // 0x4048(0x08)
	struct UParticleSystem* StartBlackOutParticle; // 0x2988(0x08)
	struct FName StartBlackOutParticleName; // 0xbd0(0x0c)
	struct UParticleSystemComponent* StartBlackOutParticleComponent; // 0x36b0(0x08)
	struct FMulticastInlineDelegate OnSpawnBlackOutDelegate; // 0x1168(0x10)
	struct UCameraPostProcessPreset* PostProcessForceFieldClass; // 0x19b0(0x08)
	struct TArray<struct ABravoHotelAreaSkillZone*> ActiveForceFields; // 0x1fb8(0x10)
	struct FAreaSkillZoneInfo ForceFieldInfo; // 0x3538(0x20)
	struct FTimerHandle TimerHandle_ForceField; // 0xac0(0x08)
	struct ABravoHotelSuperBarrier* SuperBarrierClass; // 0x3880(0x08)
	bool UsingSimulationBox; // 0x4078(0x01)
	bool HiddenSimulationBox; // 0x2b91(0x01)
	float SimulationBoxHeight; // 0xa9c(0x04)
	struct TSoftClassPtr<UObject> SimulationBoxClass; // 0x2ed0(0x30)
	struct FMulticastInlineDelegate OnCompleteActiveSkillDelegate; // 0x3ac8(0x10)
	struct ABravoHotelSkillTargetingBase* BombingTargetActor; // 0x22f0(0x08)
	struct UAkAudioEvent* StartBomingEvent; // 0x1148(0x08)
	bool IsBombing; // 0x2338(0x01)
	struct FBombingInfo BombingInfo; // 0x36e0(0x24)
	float AutoAimRadius; // 0x12a0(0x04)
	float AutoAimDistance; // 0x14bc(0x04)
	bool bShowAutoAimDebug; // 0x3190(0x01)
	struct UParticleSystem* TeleportFxTemplate; // 0x34a8(0x08)
	struct UParticleSystem* TeleportTraceFxTemplate; // 0x30e0(0x08)
	float TeleportDisappearTime; // 0x29f0(0x04)
	float TeleportAppearTime; // 0x3adc(0x04)
	float AllowRocketJumpHeight; // 0x3758(0x04)
	float AllowRocketJumpRadius; // 0x2f2c(0x04)
	float RocketJumpGravity; // 0x3ab0(0x04)
	struct UAkAudioEvent* RocketJumpAudioEvent; // 0x28c8(0x08)
	struct UAkAudioEvent* RocketJumpLandedAudioEvent; // 0x3858(0x08)
	struct UParticleSystem* ParticleSystem_RocketJump; // 0x2720(0x08)
	struct UParticleSystem* ParticleSystem_RocketJumpTrail; // 0x1648(0x08)
	struct UParticleSystem* ParticleSystem_RocketJumpLanded; // 0x3dd0(0x08)
	struct UParticleSystemComponent* RocketJumpTrailEffect; // 0x1a68(0x08)
	bool bFinishMeteorJump; // 0x122c(0x01)
	float MeteorJumpGravity; // 0x3d00(0x04)
	bool bMeteorStrikeBlockingHit; // 0x24e8(0x01)
	struct TArray<struct ABravoHotelProjectileGrenade*> MeteorGrenadeProjectileClass; // 0x2fb8(0x10)
	struct UAkAudioEvent* MeteorJumpAudioEvent; // 0x3750(0x08)
	struct UAkAudioEvent* MeteorJumpLandedAudioEvent; // 0x2d70(0x08)
	struct UParticleSystem* ParticleSystem_MeteorJump; // 0x3958(0x08)
	struct UParticleSystem* ParticleSystem_MeteorJumpTrail; // 0x3340(0x08)
	struct UParticleSystem* ParticleSystem_MeteorJumpLanded; // 0x3168(0x08)
	struct UParticleSystemComponent* MeteorJumpTrailEffect; // 0x14d8(0x08)
	struct AActor* MeteorTarget; // 0x1278(0x08)
	struct UParticleSystem* ParticleSystem_SiegeMode; // 0x1788(0x08)
	struct UParticleSystem* ParticleSystem_SiegeModeDuration; // 0x1258(0x08)
	struct UParticleSystemComponent* SiegeModeDurationEffect; // 0x3350(0x08)
	struct UCameraShake* CameraShake_SiegeMode; // 0x3738(0x08)
	struct UCameraPostProcessPreset* SiegeModePostProcessClass; // 0x3cb0(0x08)
	struct UCurveFloat* StartSiegeModePPCurve; // 0x3fb0(0x08)
	struct UCurveFloat* EndSiegeModePPCurve; // 0xcc0(0x08)
	struct UAkAudioEvent* SiegeModeAudioEvent_Active; // 0x1e48(0x08)
	struct UAkAudioEvent* SiegeModeAudioEvent_LoopStart; // 0x2b88(0x08)
	struct UAkAudioEvent* SiegeModeAudioEvent_LoopEnd; // 0x3ef8(0x08)
	struct UAkAudioEvent* SiegeModeAudioEvent_PP; // 0x1c28(0x08)
	float SimulateSiegeModeDelay; // 0x8a4(0x04)
	struct TArray<struct ABravoHotelProjectileGrenadeFlashbang*> ThrownFlashbangs; // 0x1d08(0x10)
	struct TArray<struct ABravoHotelProjectileGrenadeMolotovCocktail*> ThrownMolotovCocktails; // 0x1430(0x10)
	struct TArray<struct ABravoHotelProjectileGrenadeC4*> ThrownC4s; // 0x3b10(0x10)
	bool bIsUltimateSprint; // 0x39e2(0x01)
	bool IgnoreInteraction; // 0x20a4(0x01)
	int32_t LogSize; // 0x2b70(0x04)
	struct FTimerHandle TimeHandle_RequestBuildingInfo; // 0x1100(0x08)
	float LogIntervalTime; // 0x2348(0x04)
	int32_t LogRequestSize; // 0xab8(0x04)
	struct TArray<struct FString> LogList; // 0xb00(0x10)
	struct TArray<struct FString> LogJsonList; // 0x2a78(0x10)
	struct UParticleSystem* GodEffect1; // 0x1d40(0x08)
	struct UParticleSystem* GodEffect2; // 0x3d28(0x08)
	struct UParticleSystem* ParticleSystem_Knockout; // 0x2d28(0x08)
	struct FRepSimulatedHittedDamage RepSimulatedHittedDamage; // 0x2cb0(0x10)
	float FirstTimeHittedDamage; // 0x3524(0x04)
	float LastTimeHittedDamage; // 0xdc8(0x04)
	struct UParticleSystemComponent* GodParticle; // 0x1408(0x08)
	bool NeedFindPersonalSupplyBoxLocation; // 0x2eb8(0x01)
	int32_t PersonalSupplyBoxRePositionCount; // 0x2754(0x04)
	bool UsingPersonalSupplyBoxWeightMap; // 0x2339(0x01)
	bool UsingPersonalSupplyBoxRePosition; // 0x4010(0x01)
	float PersonalSupplyBoxRePositionDistance; // 0x1264(0x04)
	struct FTimerHandle TimeHandle_Ultimate_Recon; // 0x2c98(0x08)
	struct FAnimSlot AnimSlot_Ultimate_Recon; // 0x1d90(0x10)
	bool bIsUltimate_Recon; // 0x21d8(0x01)
	struct UAnimMontage* AvoidHeadShotMontage; // 0x2040(0x08)
	struct FVector StuntmanRollingDir; // 0x121c(0x0c)
	float StuntmanStartTime; // 0x22a4(0x04)
	struct FTimerHandle TimerHandle_Stuntman; // 0x1720(0x08)
	bool bNeedToUpdateNitroBoost; // 0x2e98(0x01)
	float NitroBoostTorqueScale; // 0xed0(0x04)
	struct ABravoHotelVehicle* NitroBoomTargetVehicle; // 0x3988(0x08)
	bool bNeedToUpdateNitroBoom; // 0x3905(0x01)
	float NitroBoomDuration; // 0x2748(0x04)
	bool bNeedToDrawNitroBoomTarget; // 0x18e4(0x01)
	struct FVector NitroBoomTargetLocation; // 0x2060(0x0c)
	float NitroBoomLastVehicleSetTime; // 0x2e5c(0x04)
	bool bNeedToUpdateUltimate_Driver; // 0x14c0(0x01)
	bool bNeedToCheckPlosiveSoundDetection; // 0x3710(0x01)
	struct ABravoHotelMoveElevator* EnteredElevatorRef; // 0x21f0(0x08)
	float OuterDamage; // 0x8a8(0x04)
	struct FTimerHandle TimerHandle_InOuterArea; // 0x8b0(0x08)
	struct FTimerHandle TimerHandle_UpdateInOuterArea; // 0x8b8(0x08)
	struct FMulticastInlineDelegate DelegateCheckSupplyCost; // 0x40b0(0x10)
	struct FSecuredVariablesCache SecuredCache; // 0x1ee0(0x04)
	struct UCurveFloat* DamageCorrectValueByPenetrationDepthCurve; // 0x1360(0x08)
	struct ABravoHotelAircraftFlight* AircraftFlightRef; // 0x4058(0x08)
	float InventoryScrollSpeed; // 0x8c0(0x04)
	float ThrowWeaponSelectionMenuDelayTime; // 0x8c4(0x04)
	struct TMap<struct FName, int32_t> HitPartsIndex; // 0x14e8(0x50)
	struct UAkAudioEvent* AutoPickupSound; // 0x950(0x08)
	struct UParticleSystem* AutoPickupItemParticle; // 0x958(0x08)
	struct UParticleSystem* AutoPickupCharacterParticle; // 0x960(0x08)

	void WearItem(enum class EWearableItemType Slot, struct FString UniqueKey, bool bUpdateSkeletalMesh); // Function BravoHotelGame.BravoHotelCharacter.WearItem // (Final|Native|Public|BlueprintCallable) // @ game+0x22b4140
	bool WasMeshRecentlyRenderedOnScreen(float Tolerance); // Function BravoHotelGame.BravoHotelCharacter.WasMeshRecentlyRenderedOnScreen // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22b40b0
	bool WantToFPSMode(); // Function BravoHotelGame.BravoHotelCharacter.WantToFPSMode // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22b4020
	bool WantsToRocketJump(); // Function BravoHotelGame.BravoHotelCharacter.WantsToRocketJump // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22b4080
	bool WantsToMeteorJump(); // Function BravoHotelGame.BravoHotelCharacter.WantsToMeteorJump // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22b4050
	bool ValidateEquippedWeaponsInVehicle(int32_t WeaponIndex); // Function BravoHotelGame.BravoHotelCharacter.ValidateEquippedWeaponsInVehicle // (Final|Native|Public|BlueprintCallable) // @ game+0x22b3f90
	void ValidateCameraInterp(); // Function BravoHotelGame.BravoHotelCharacter.ValidateCameraInterp // (Final|Native|Public) // @ game+0x22b3f70
	void UpdateWetFogPP(bool bForce); // Function BravoHotelGame.BravoHotelCharacter.UpdateWetFogPP // (Final|Native|Public) // @ game+0x22b3ee0
	void UpdateWalking_Prone(); // Function BravoHotelGame.BravoHotelCharacter.UpdateWalking_Prone // (Final|Native|Public) // @ game+0x22b3ec0
	void UpdateWalking(); // Function BravoHotelGame.BravoHotelCharacter.UpdateWalking // (Final|Native|Public) // @ game+0x22b3ea0
	void UpdateUltimate_Recon(); // Function BravoHotelGame.BravoHotelCharacter.UpdateUltimate_Recon // (Final|Native|Public) // @ game+0x22b3e80
	void UpdateTunnelEffect(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdateTunnelEffect // (Final|Native|Public) // @ game+0x22b3e00
	void UpdateTimeline(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateTimeline // (Final|Native|Public) // @ game+0x22b3d80
	void UpdateTerrainType(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateTerrainType // (Final|Native|Public) // @ game+0x22b3d00
	void UpdateTargetHealth(enum class ETargetHealthType Type, float InTargetHealth); // Function BravoHotelGame.BravoHotelCharacter.UpdateTargetHealth // (Final|Native|Public|BlueprintCallable) // @ game+0x22b3c40
	void UpdateSurfaceType(); // Function BravoHotelGame.BravoHotelCharacter.UpdateSurfaceType // (Final|Native|Public) // @ game+0x22b3c20
	void UpdateStatupMaterialEffect(); // Function BravoHotelGame.BravoHotelCharacter.UpdateStatupMaterialEffect // (Final|Native|Protected) // @ game+0x22b3c00
	void UpdateSliding(); // Function BravoHotelGame.BravoHotelCharacter.UpdateSliding // (Final|Native|Public) // @ game+0x22b3be0
	void UpdateRolling(); // Function BravoHotelGame.BravoHotelCharacter.UpdateRolling // (Final|Native|Public) // @ game+0x22b3bc0
	void UpdateReplaceFreeLook(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateReplaceFreeLook // (Final|Native|Public) // @ game+0x22b3b40
	void UpdatePowerInterruptionPP(bool bForce); // Function BravoHotelGame.BravoHotelCharacter.UpdatePowerInterruptionPP // (Final|Native|Public) // @ game+0x22b3ab0
	void UpdatePostProcess_Indoor(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdatePostProcess_Indoor // (Final|Native|Public) // @ game+0x22b3a30
	void UpdatePostProcess_FPP(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdatePostProcess_FPP // (Final|Native|Public) // @ game+0x22b39b0
	void UpdatePostProcess_CameraMonoChrome(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdatePostProcess_CameraMonoChrome // (Final|Native|Public) // @ game+0x22b3930
	void UpdatePostProcess_ADS(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdatePostProcess_ADS // (Final|Native|Public) // @ game+0x22b38b0
	void UpdatePostProcess(struct FName RowName, float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdatePostProcess // (Final|Native|Public) // @ game+0x22b37d0
	void UpdatePassengerLocation(); // Function BravoHotelGame.BravoHotelCharacter.UpdatePassengerLocation // (Final|Native|Public) // @ game+0x22b37b0
	void UpdateOuterPlayZonePP(bool bForce); // Function BravoHotelGame.BravoHotelCharacter.UpdateOuterPlayZonePP // (Final|Native|Public) // @ game+0x22b3720
	void UpdateNitroBoom(); // Function BravoHotelGame.BravoHotelCharacter.UpdateNitroBoom // (Final|Native|Protected) // @ game+0x22b3700
	void UpdateNearClipPlane(); // Function BravoHotelGame.BravoHotelCharacter.UpdateNearClipPlane // (Final|Native|Public) // @ game+0x22b36e0
	void UpdateMutableMesh(); // Function BravoHotelGame.BravoHotelCharacter.UpdateMutableMesh // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x22b36c0
	void UpdateMutableBuffList(); // Function BravoHotelGame.BravoHotelCharacter.UpdateMutableBuffList // (Final|Native|Public|BlueprintCallable) // @ game+0x22b36a0
	void UpdateMutable__DelegateSignature(struct ABravoHotelCharacter* Character); // DelegateFunction BravoHotelGame.BravoHotelCharacter.UpdateMutable__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void UpdateMeleeAttack(struct UBravoHotelAnimNotifyState_Melee* MeleeAnimNotifyClass, bool bDrawDebugObject); // Function BravoHotelGame.BravoHotelCharacter.UpdateMeleeAttack // (Final|Native|Public) // @ game+0x22b35d0
	void UpdateLeanValue(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateLeanValue // (Final|Native|Public) // @ game+0x22b3550
	void UpdateKnockOutParticle(); // Function BravoHotelGame.BravoHotelCharacter.UpdateKnockOutParticle // (Final|Native|Private) // @ game+0x22b3530
	void UpdateJetpackFuel(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateJetpackFuel // (Final|Native|Public) // @ game+0x22b34b0
	void UpdateInventoryOrder(); // Function BravoHotelGame.BravoHotelCharacter.UpdateInventoryOrder // (Final|Native|Public|BlueprintCallable) // @ game+0x22b3490
	void UpdateInteractionType(struct FHitResult& Hit); // Function BravoHotelGame.BravoHotelCharacter.UpdateInteractionType // (Final|Native|Public|HasOutParms) // @ game+0x22b33c0
	void UpdateInRagdoll(); // Function BravoHotelGame.BravoHotelCharacter.UpdateInRagdoll // (Final|Native|Public) // @ game+0x22b33a0
	void UpdateIdleNum(); // Function BravoHotelGame.BravoHotelCharacter.UpdateIdleNum // (Final|Native|Public) // @ game+0x22b3380
	void UpdateGroundFriction(); // Function BravoHotelGame.BravoHotelCharacter.UpdateGroundFriction // (Final|Native|Public) // @ game+0x22b3360
	void UpdateFurActivation(); // Function BravoHotelGame.BravoHotelCharacter.UpdateFurActivation // (Final|Native|Public|BlueprintCallable) // @ game+0x22b3340
	void UpdateFPSMode(); // Function BravoHotelGame.BravoHotelCharacter.UpdateFPSMode // (Final|Native|Public) // @ game+0x22b3250
	void UpdateForceFieldPP(bool bForce); // Function BravoHotelGame.BravoHotelCharacter.UpdateForceFieldPP // (Final|Native|Public) // @ game+0x22b32b0
	void UpdateFireInput(); // Function BravoHotelGame.BravoHotelCharacter.UpdateFireInput // (Final|Native|Public) // @ game+0x22b3290
	void UpdateFalling(); // Function BravoHotelGame.BravoHotelCharacter.UpdateFalling // (Final|Native|Public) // @ game+0x22b3270
	void UpdateDrive(); // Function BravoHotelGame.BravoHotelCharacter.UpdateDrive // (Final|Native|Public) // @ game+0x174cbb0
	void UpdateDebuffState(); // Function BravoHotelGame.BravoHotelCharacter.UpdateDebuffState // (Final|Native|Protected) // @ game+0x22b3230
	void UpdateCharacterOutlineMaterial(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateCharacterOutlineMaterial // (Final|Native|Public) // @ game+0x22b31b0
	void UpdateCharacterMagneticDamagedMaterial(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateCharacterMagneticDamagedMaterial // (Final|Native|Public) // @ game+0x22b3130
	void UpdateCharacterDustMaterial(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateCharacterDustMaterial // (Final|Native|Public) // @ game+0x22b30b0
	void UpdateCharacterDamagedMaterial(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateCharacterDamagedMaterial // (Final|Native|Public) // @ game+0x22b3030
	void UpdateCastingUI(); // Function BravoHotelGame.BravoHotelCharacter.UpdateCastingUI // (Final|Native|Public) // @ game+0x22b3010
	void UpdateCameraPPByBuff(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateCameraPPByBuff // (Final|Native|Protected) // @ game+0x22b2f90
	void UpdateCameraPP(bool bIsOn, float StartValue, float TargetValue, float InTime, float OutTime, struct FName AnimName, struct UCameraPostProcessPreset* PPPresetClass, struct FTimerHandle& DeactiveTimer, bool bForce); // Function BravoHotelGame.BravoHotelCharacter.UpdateCameraPP // (Final|Native|Public|HasOutParms) // @ game+0x22b2ce0
	void UpdateCameraInterp(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdateCameraInterp // (Final|Native|Public) // @ game+0x22b2c60
	void UpdateCamera(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateCamera // (Final|Native|Public) // @ game+0x22b2be0
	void UpdateBreathEffect(); // Function BravoHotelGame.BravoHotelCharacter.UpdateBreathEffect // (Final|Native|Public) // @ game+0x22b2bc0
	void UpdateBlueZonePP(bool bForce); // Function BravoHotelGame.BravoHotelCharacter.UpdateBlueZonePP // (Final|Native|Public) // @ game+0x22b2b30
	void UpdateAreaInfo(struct TArray<struct ABravoHotelAreaSkillZone*>& TargetActiveAreas, struct FAreaSkillZoneInfo& TargetSkillZoneInfo); // Function BravoHotelGame.BravoHotelCharacter.UpdateAreaInfo // (Final|Native|Public|HasOutParms) // @ game+0x22b2a10
	void UpdateAOSMode(); // Function BravoHotelGame.BravoHotelCharacter.UpdateAOSMode // (Final|Native|Public) // @ game+0x22b2970
	void UpdateADSReturnTrigger(); // Function BravoHotelGame.BravoHotelCharacter.UpdateADSReturnTrigger // (Final|Native|Public) // @ game+0x22b2950
	void UpdateAdsCameraInterp(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdateAdsCameraInterp // (Final|Native|Public) // @ game+0x22b2990
	void UnProne(bool bClientSimulation); // Function BravoHotelGame.BravoHotelCharacter.UnProne // (Native|Public|BlueprintCallable) // @ game+0x22b28a0
	void UnlockMovementInput(); // Function BravoHotelGame.BravoHotelCharacter.UnlockMovementInput // (Final|Native|Public) // @ game+0x22b2930
	void UndoHide(); // Function BravoHotelGame.BravoHotelCharacter.UndoHide // (Final|Native|Public|BlueprintCallable) // @ game+0x22986d0
	void TryRetreat(bool InIsRandomLocation, struct FVector InTargetLocation); // Function BravoHotelGame.BravoHotelCharacter.TryRetreat // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x22b27c0
	void TryNuclear(struct FVector InTargetLocation); // Function BravoHotelGame.BravoHotelCharacter.TryNuclear // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x22b2730
	void TryExitLadder(bool bIsForce); // Function BravoHotelGame.BravoHotelCharacter.TryExitLadder // (Final|Native|Public|BlueprintCallable) // @ game+0x22b26a0
	struct UBravoHotelPhysicalMaterial* TraceSteppedSurface(); // Function BravoHotelGame.BravoHotelCharacter.TraceSteppedSurface // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22b2670
	void ThrowingGrenade(); // Function BravoHotelGame.BravoHotelCharacter.ThrowingGrenade // (Final|Native|Public|BlueprintCallable) // @ game+0x22b2650
	void StopRagdoll(); // Function BravoHotelGame.BravoHotelCharacter.StopRagdoll // (Final|Native|Public) // @ game+0x22b2630
	void StopPostProcessEffects(struct FName RowName, bool bImmediately); // Function BravoHotelGame.BravoHotelCharacter.StopPostProcessEffects // (Final|Native|Public|BlueprintCallable) // @ game+0x22b2550
	void StopPlayingPickupAnim(); // Function BravoHotelGame.BravoHotelCharacter.StopPlayingPickupAnim // (Final|Native|Public) // @ game+0x22b2530
	void StopAllPostProcessEffects(); // Function BravoHotelGame.BravoHotelCharacter.StopAllPostProcessEffects // (Final|Native|Public) // @ game+0x22b2510
	void StartTunnelEffect(); // Function BravoHotelGame.BravoHotelCharacter.StartTunnelEffect // (Final|Native|Public) // @ game+0x22b24f0
	void StartSteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.StartSteadyAim // (Final|Native|Public|BlueprintCallable) // @ game+0x22b24d0
	void StartStatupMaterialEffect(struct FStatupAnimParameters& StatupParams); // Function BravoHotelGame.BravoHotelCharacter.StartStatupMaterialEffect // (Final|Native|Public|HasOutParms) // @ game+0x22b2420
	void StartSpawnBlackOut(float DelayTime); // Function BravoHotelGame.BravoHotelCharacter.StartSpawnBlackOut // (Final|Native|Public) // @ game+0x22b23a0
	void StartReplaceFreeLook(); // Function BravoHotelGame.BravoHotelCharacter.StartReplaceFreeLook // (Final|Native|Public|BlueprintCallable) // @ game+0x22b2380
	void StartRagdoll(); // Function BravoHotelGame.BravoHotelCharacter.StartRagdoll // (Final|Native|Public) // @ game+0x22b2360
	void StartPostProcessEffects(struct FName RowName); // Function BravoHotelGame.BravoHotelCharacter.StartPostProcessEffects // (Final|Native|Public|BlueprintCallable) // @ game+0x22b22c0
	void StartFalling(); // Function BravoHotelGame.BravoHotelCharacter.StartFalling // (Final|Native|Protected) // @ game+0x22b22a0
	void StartDescending(); // Function BravoHotelGame.BravoHotelCharacter.StartDescending // (Final|Native|Public|BlueprintCallable) // @ game+0x22b2280
	void StartADSProcess(); // Function BravoHotelGame.BravoHotelCharacter.StartADSProcess // (Final|Native|Public) // @ game+0x22b2260
	void SpectatedDelegate__DelegateSignature(bool bIsSpectated); // DelegateFunction BravoHotelGame.BravoHotelCharacter.SpectatedDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	struct ABravoHotelSkillTargetingBase* SpawnSkillTargeting(struct FName& ActorName, struct FVector& InSpawnLocation, float Radius); // Function BravoHotelGame.BravoHotelCharacter.SpawnSkillTargeting // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x22b2120
	void SpawnBrokenEquipment(); // Function BravoHotelGame.BravoHotelCharacter.SpawnBrokenEquipment // (Final|Native|Public) // @ game+0x22b2100
	void SimulatedTakeDamage(); // Function BravoHotelGame.BravoHotelCharacter.SimulatedTakeDamage // (Final|Native|Public) // @ game+0x22b20e0
	void ShowWorldTeleportWidget(); // Function BravoHotelGame.BravoHotelCharacter.ShowWorldTeleportWidget // (Final|Native|Public|BlueprintCallable) // @ game+0x22986d0
	void ShowTeleportAppearEffect(); // Function BravoHotelGame.BravoHotelCharacter.ShowTeleportAppearEffect // (Final|Native|Public|BlueprintCallable) // @ game+0x22b20c0
	void ShowSkillMap(float Radius); // Function BravoHotelGame.BravoHotelCharacter.ShowSkillMap // (Final|Native|Public) // @ game+0x22b2040
	void ShowParachuteMesh(bool bVisibility, bool bIsWithParachute); // Function BravoHotelGame.BravoHotelCharacter.ShowParachuteMesh // (Final|Native|Public|BlueprintCallable) // @ game+0x22b1f70
	void ShowKeyActions(); // Function BravoHotelGame.BravoHotelCharacter.ShowKeyActions // (Final|Native|Public|BlueprintCallable) // @ game+0x22b1f50
	void ShowInventoryNotEnoughSpaceMessage(); // Function BravoHotelGame.BravoHotelCharacter.ShowInventoryNotEnoughSpaceMessage // (Final|Native|Public|BlueprintCallable) // @ game+0x22b1f30
	void ShowInventoryNotEnoughGoldSpaceMessage(); // Function BravoHotelGame.BravoHotelCharacter.ShowInventoryNotEnoughGoldSpaceMessage // (Final|Native|Public|BlueprintCallable) // @ game+0x22b1f10
	void ShowInteractiveForPickup(struct FInteraction& InteractionInfo, struct FInventoryItemInfo& ItemInfo); // Function BravoHotelGame.BravoHotelCharacter.ShowInteractiveForPickup // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x22b1d20
	void ShowInteractiveForAction(struct FInteraction& InteractionInfo); // Function BravoHotelGame.BravoHotelCharacter.ShowInteractiveForAction // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x22b1be0
	void ShowInteractionWidget(struct FInteraction InteractionInfo); // Function BravoHotelGame.BravoHotelCharacter.ShowInteractionWidget // (Final|Native|Public) // @ game+0x22b1a00
	void ShowHUDbySequence(); // Function BravoHotelGame.BravoHotelCharacter.ShowHUDbySequence // (Final|Native|Public|BlueprintCallable) // @ game+0x22b19e0
	void ShowHeartBeatSensorEffect(bool IsHeartBeatSensorEffect, float HeartBeatSensorLength); // Function BravoHotelGame.BravoHotelCharacter.ShowHeartBeatSensorEffect // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void ShowGuideWidget(enum class EGuideWidgetType GuideType); // Function BravoHotelGame.BravoHotelCharacter.ShowGuideWidget // (Final|Native|Public) // @ game+0x22b1960
	void ShowGrenadeWeaponMenu(); // Function BravoHotelGame.BravoHotelCharacter.ShowGrenadeWeaponMenu // (Final|Native|Public|BlueprintCallable) // @ game+0x22b1940
	void ShowCloudFxInDescent(bool bWantsToShow); // Function BravoHotelGame.BravoHotelCharacter.ShowCloudFxInDescent // (Final|Native|Public) // @ game+0x22b18b0
	void ShowAmplifierEffect(bool IsAmplifierEffect, float AmplifierLength); // Function BravoHotelGame.BravoHotelCharacter.ShowAmplifierEffect // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void ShouldSprinting(bool bNewShouldSprinting); // Function BravoHotelGame.BravoHotelCharacter.ShouldSprinting // (Final|Native|Public|BlueprintCallable) // @ game+0x22b1820
	bool ShouldAdjustInDoor(enum class EInDoorAdjustmentTarget InTarget); // Function BravoHotelGame.BravoHotelCharacter.ShouldAdjustInDoor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22b1790
	void SetVisibleOutBlueZoneBlizzard(bool Visible); // Function BravoHotelGame.BravoHotelCharacter.SetVisibleOutBlueZoneBlizzard // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void SetTunnelEffectRatio(float Ratio); // Function BravoHotelGame.BravoHotelCharacter.SetTunnelEffectRatio // (Final|Native|Public|BlueprintCallable) // @ game+0x22b1710
	void SetTeleportEffect(bool bStart); // Function BravoHotelGame.BravoHotelCharacter.SetTeleportEffect // (Final|Native|Public|BlueprintCallable) // @ game+0x22b1680
	void SetTeamInfoVisibility(bool IsVisible); // Function BravoHotelGame.BravoHotelCharacter.SetTeamInfoVisibility // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetTargetHealth(enum class ETargetHealthType Type, float InTargetHealth, float InUsableHealth); // Function BravoHotelGame.BravoHotelCharacter.SetTargetHealth // (Final|Native|Public|BlueprintCallable) // @ game+0x22b1580
	void SetSteadyAim(bool SteadyAim); // Function BravoHotelGame.BravoHotelCharacter.SetSteadyAim // (Final|Native|Public|BlueprintCallable) // @ game+0x22b14f0
	void SetState(enum class ECharacterState NewState, bool bReplicated); // Function BravoHotelGame.BravoHotelCharacter.SetState // (Final|Native|Public) // @ game+0x22b1420
	void SetShakeOutMontage(); // Function BravoHotelGame.BravoHotelCharacter.SetShakeOutMontage // (Final|Native|Public) // @ game+0x22b1400
	void SetSavedPlayerState(struct APlayerState* PState); // Function BravoHotelGame.BravoHotelCharacter.SetSavedPlayerState // (Final|Native|Public|BlueprintCallable) // @ game+0x22b1360
	void SetReplicatedAnimMontage(struct UAnimMontage* NewAnimMontageTPP, struct UAnimMontage* NewAnimMontageFPP); // Function BravoHotelGame.BravoHotelCharacter.SetReplicatedAnimMontage // (Final|Native|Public|BlueprintCallable) // @ game+0x22b12a0
	void SetRecordingCharacterTickRate(float TickRate); // Function BravoHotelGame.BravoHotelCharacter.SetRecordingCharacterTickRate // (Event|Protected|BlueprintEvent) // @ game+0x2bad3b0
	void SetRandomValuesToCustomizableObject(); // Function BravoHotelGame.BravoHotelCharacter.SetRandomValuesToCustomizableObject // (Final|Native|Public|BlueprintCallable) // @ game+0x22b1280
	void SetRandomIdleNum(); // Function BravoHotelGame.BravoHotelCharacter.SetRandomIdleNum // (Final|Native|Public) // @ game+0x22b1260
	void SetProjectileGrenadeActor(struct ABravoHotelProjectileGrenade* Grenade); // Function BravoHotelGame.BravoHotelCharacter.SetProjectileGrenadeActor // (Final|Native|Public) // @ game+0x22b11e0
	void SetPreviewPawn(struct ABravoHotel3DViewActor* NewPreviewPawn); // Function BravoHotelGame.BravoHotelCharacter.SetPreviewPawn // (Final|Native|Public|BlueprintCallable) // @ game+0x22b1160
	void SetParkourTestComponentIndex(int32_t IndexKey); // Function BravoHotelGame.BravoHotelCharacter.SetParkourTestComponentIndex // (Final|Native|Public|BlueprintCallable) // @ game+0x22b10e0
	void SetNoOxygenMaterial(); // Function BravoHotelGame.BravoHotelCharacter.SetNoOxygenMaterial // (Final|Native|Public) // @ game+0x22b10c0
	void SetNearClipPlane(float NearClipPlane); // Function BravoHotelGame.BravoHotelCharacter.SetNearClipPlane // (Final|Native|Public|BlueprintCallable) // @ game+0x22b1040
	void SetMolotovFlameDotDamage(); // Function BravoHotelGame.BravoHotelCharacter.SetMolotovFlameDotDamage // (Final|Native|Public) // @ game+0x22b1020
	void SetMagneticDmgDissolveAnimationCurve(); // Function BravoHotelGame.BravoHotelCharacter.SetMagneticDmgDissolveAnimationCurve // (Final|Native|Public) // @ game+0x22b1000
	void SetMagneticDamagedCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.SetMagneticDamagedCharacterMaterial // (Final|Native|Public) // @ game+0x22b0fe0
	void SetLadderComponent(struct ULadderComponent* NewLadder); // Function BravoHotelGame.BravoHotelCharacter.SetLadderComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x22b0f60
	void SetIsMelee(bool bNewMelee, bool bNewMeleeJumpAttack); // Function BravoHotelGame.BravoHotelCharacter.SetIsMelee // (Final|Native|Public) // @ game+0x22b0e90
	void SetIsLanded(bool bNewLanded); // Function BravoHotelGame.BravoHotelCharacter.SetIsLanded // (Final|Native|Public) // @ game+0x22b0e00
	void SetIsInsideBlueZone(bool bIsInsideBlueZone, bool bForce); // Function BravoHotelGame.BravoHotelCharacter.SetIsInsideBlueZone // (Final|Native|Protected|BlueprintCallable) // @ game+0x22b0d30
	void SetIsFreeLook(bool bNewFreeLook); // Function BravoHotelGame.BravoHotelCharacter.SetIsFreeLook // (Final|Native|Public) // @ game+0x22b0ca0
	void SetIsFired(bool bNewFired, float AutoDeactiveDelayTime); // Function BravoHotelGame.BravoHotelCharacter.SetIsFired // (Final|Native|Public) // @ game+0x22b0bd0
	void SetInternalMagneticDamagedDissolveCharacterMaterial(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.SetInternalMagneticDamagedDissolveCharacterMaterial // (Final|Native|Public) // @ game+0x22b0b50
	void SetInternalMagneticDamagedCharacterMaterial(bool bOn); // Function BravoHotelGame.BravoHotelCharacter.SetInternalMagneticDamagedCharacterMaterial // (Final|Native|Public) // @ game+0x22b0ac0
	void SetInternalMagneticDamagedCharacterBackGroundMaterial_On(); // Function BravoHotelGame.BravoHotelCharacter.SetInternalMagneticDamagedCharacterBackGroundMaterial_On // (Final|Native|Public) // @ game+0x22b0aa0
	void SetInternalMagneticDamagedCharacterBackGroundMaterial_Off(); // Function BravoHotelGame.BravoHotelCharacter.SetInternalMagneticDamagedCharacterBackGroundMaterial_Off // (Final|Native|Public) // @ game+0x22b0a80
	void SetInternalDustDissolveCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.SetInternalDustDissolveCharacterMaterial // (Final|Native|Public) // @ game+0x22b0a60
	void SetInternalDustCharacterMaterial(bool bOn); // Function BravoHotelGame.BravoHotelCharacter.SetInternalDustCharacterMaterial // (Final|Native|Public) // @ game+0x22b09d0
	void SetInternalDamagedDissolveCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.SetInternalDamagedDissolveCharacterMaterial // (Final|Native|Public) // @ game+0x22b09b0
	void SetInternalDamagedCharacterMaterial(bool bOn); // Function BravoHotelGame.BravoHotelCharacter.SetInternalDamagedCharacterMaterial // (Final|Native|Public) // @ game+0x22b0920
	void SetInternalDamagedCharacterBackGroundMaterial_On(); // Function BravoHotelGame.BravoHotelCharacter.SetInternalDamagedCharacterBackGroundMaterial_On // (Final|Native|Public) // @ game+0x22b0900
	void SetInternalDamagedCharacterBackGroundMaterial_Off(); // Function BravoHotelGame.BravoHotelCharacter.SetInternalDamagedCharacterBackGroundMaterial_Off // (Final|Native|Public) // @ game+0x22b08e0
	void SetInteractiveNoHide(bool NoHide); // Function BravoHotelGame.BravoHotelCharacter.SetInteractiveNoHide // (Final|Native|Public|BlueprintCallable) // @ game+0x22b0850
	void SetInteractiveCustomMode(int32_t ModeNum); // Function BravoHotelGame.BravoHotelCharacter.SetInteractiveCustomMode // (Final|Native|Public|BlueprintCallable) // @ game+0x22b07d0
	void SetInteractionType(enum class EInteractionType NewType); // Function BravoHotelGame.BravoHotelCharacter.SetInteractionType // (Final|Native|Public|BlueprintCallable) // @ game+0x22b0750
	void SetInReduceSpeedExplosionRange(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.SetInReduceSpeedExplosionRange // (Final|Native|Protected) // @ game+0x22b06d0
	void SetFoundVehicleLocations(struct FCarScanUIInfo& InCarScanUIInfo); // Function BravoHotelGame.BravoHotelCharacter.SetFoundVehicleLocations // (Final|Native|Public|HasOutParms) // @ game+0x22b0600
	void SetFlashBangPlaySound(); // Function BravoHotelGame.BravoHotelCharacter.SetFlashBangPlaySound // (Final|Native|Public) // @ game+0x22b05e0
	void SetFlashBangEndSound(); // Function BravoHotelGame.BravoHotelCharacter.SetFlashBangEndSound // (Final|Native|Public) // @ game+0x22b05c0
	void SetFlashBangAngle(float Angle); // Function BravoHotelGame.BravoHotelCharacter.SetFlashBangAngle // (Final|Native|Public) // @ game+0x22b0540
	void SetFireType(enum class EFireType NewFireType); // Function BravoHotelGame.BravoHotelCharacter.SetFireType // (Final|Native|Public|BlueprintCallable) // @ game+0x22b04c0
	void SetDustDissolveAnimationCurve(); // Function BravoHotelGame.BravoHotelCharacter.SetDustDissolveAnimationCurve // (Final|Native|Public) // @ game+0x22b04a0
	void SetDustCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.SetDustCharacterMaterial // (Final|Native|Public) // @ game+0x22b0480
	void SetDissolveAnimationCurveData(); // Function BravoHotelGame.BravoHotelCharacter.SetDissolveAnimationCurveData // (Final|Native|Public) // @ game+0x22b0460
	void SetDescentVariables(float NewAirControl, float NewMaxWalkSpeed, float NewGravityScale, float NewBarkingDecelerationFalling, float NewMaxAcceleration, struct FVector NewCameraRelativeLocation, bool bForceLocation); // Function BravoHotelGame.BravoHotelCharacter.SetDescentVariables // (Final|Native|Public|HasDefaults) // @ game+0x22b0240
	void SetDefaultCameraLag(float NewDefaultCameraLag); // Function BravoHotelGame.BravoHotelCharacter.SetDefaultCameraLag // (Final|Native|Public) // @ game+0x22b01c0
	void SetDamagedFlashBang(float FlashBangValue); // Function BravoHotelGame.BravoHotelCharacter.SetDamagedFlashBang // (Final|Native|Public) // @ game+0x22b0140
	void SetDamagedCharacterMaterial(struct UBravoHotelDamageType* DamageTypeClass); // Function BravoHotelGame.BravoHotelCharacter.SetDamagedCharacterMaterial // (Final|Native|Public) // @ game+0x22b00c0
	void SetChargingGauge(bool bStart); // Function BravoHotelGame.BravoHotelCharacter.SetChargingGauge // (Final|Native|Public) // @ game+0x22b0030
	void SetCharacterMovementMode(enum class EMovementMode Mode); // Function BravoHotelGame.BravoHotelCharacter.SetCharacterMovementMode // (Final|Native|Public) // @ game+0x22affb0
	void SetCharacterIntheWater(); // Function BravoHotelGame.BravoHotelCharacter.SetCharacterIntheWater // (Native|Event|Public|BlueprintEvent) // @ game+0x22aff90
	void SetCameraLag(bool bEnable); // Function BravoHotelGame.BravoHotelCharacter.SetCameraLag // (Final|Native|Public) // @ game+0x22aff00
	void SetCameraAssistComponent(bool bSpectactor); // Function BravoHotelGame.BravoHotelCharacter.SetCameraAssistComponent // (Final|Native|Public) // @ game+0x22afe70
	void SetBackLightComponentsActive(bool bNewActive); // Function BravoHotelGame.BravoHotelCharacter.SetBackLightComponentsActive // (Final|Native|Public) // @ game+0x22afde0
	void SetArmedState(bool bDoArm, bool bPlayUnequipAnimation, bool bOrdered); // Function BravoHotelGame.BravoHotelCharacter.SetArmedState // (Final|Native|Public|BlueprintCallable) // @ game+0x22afcc0
	void SetADSReturnTimer(float ADSReturnDelayTime); // Function BravoHotelGame.BravoHotelCharacter.SetADSReturnTimer // (Final|Native|Public|BlueprintCallable) // @ game+0x22afbb0
	void SetActiveFur(bool bActive); // Function BravoHotelGame.BravoHotelCharacter.SetActiveFur // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetActiveBreathEffect(bool bNewActive); // Function BravoHotelGame.BravoHotelCharacter.SetActiveBreathEffect // (Final|Native|Public) // @ game+0x22afc30
	void ServerWindowBreaching(struct TArray<struct ABravoHotelCharacter*> TargetDamagedCharacters); // Function BravoHotelGame.BravoHotelCharacter.ServerWindowBreaching // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22afaf0
	void ServerUseBackpackItem(int32_t BackpackItemIndex); // Function BravoHotelGame.BravoHotelCharacter.ServerUseBackpackItem // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x22afa30
	void ServerUpdateRagdollVariables(struct FVector NewRagdollVelocity, struct FVector NewRagdollLocation, struct FVector NewActorLocation); // Function BravoHotelGame.BravoHotelCharacter.ServerUpdateRagdollVariables // (Net|Native|Event|Protected|NetServer|HasDefaults|NetValidate) // @ game+0x22af8a0
	void ServerUpdateNearbyVehicles(struct TArray<struct ABravoHotelVehicle*> AddedVehicles, struct TArray<struct ABravoHotelVehicle*> RemovedVehicles); // Function BravoHotelGame.BravoHotelCharacter.ServerUpdateNearbyVehicles // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22af780
	void ServerUpdateCamera(struct FRepCameraInfo InCameraInfo); // Function BravoHotelGame.BravoHotelCharacter.ServerUpdateCamera // (Net|Native|Event|Public|NetServer|NetValidate) // @ game+0x22af6c0
	void ServerTryUseLadder(struct ABravoHotelLadder* DetectedLadder); // Function BravoHotelGame.BravoHotelCharacter.ServerTryUseLadder // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22af600
	void ServerTryExitVehicle(enum class ECharacterState NextState); // Function BravoHotelGame.BravoHotelCharacter.ServerTryExitVehicle // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22af550
	void ServerTryExitLadder(); // Function BravoHotelGame.BravoHotelCharacter.ServerTryExitLadder // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22af500
	void ServerTryEnterVehicle(struct UBravoHotelVehicleSeatComponent* TargetVehicleSeat); // Function BravoHotelGame.BravoHotelCharacter.ServerTryEnterVehicle // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22af440
	void ServerTryElevatorInteraction(struct AActor* ElevatorActor, struct UPrimitiveComponent* ElevatorComponet); // Function BravoHotelGame.BravoHotelCharacter.ServerTryElevatorInteraction // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x22af340
	void ServerTryDropBoxInteraction(struct AActor* TmpDropBox); // Function BravoHotelGame.BravoHotelCharacter.ServerTryDropBoxInteraction // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22af280
	void ServerTotalAirWalkDistance(float TotalDistance); // Function BravoHotelGame.BravoHotelCharacter.ServerTotalAirWalkDistance // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22af1d0
	void ServerTestSpawnPersonalBox(float X, float Y); // Function BravoHotelGame.BravoHotelCharacter.ServerTestSpawnPersonalBox // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22af0d0
	void ServerTakeDamage_Radial(float DamageAmount, struct FBravoHotelDamageEvent_Radial DamageEvent, struct ABravoHotelCharacter* TargetCharacter); // Function BravoHotelGame.BravoHotelCharacter.ServerTakeDamage_Radial // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22aee30
	void ServerTakeDamage_Point(float DamageAmount, struct FBravoHotelDamageEvent_Point DamageEvent, struct ABravoHotelCharacter* TargetCharacter); // Function BravoHotelGame.BravoHotelCharacter.ServerTakeDamage_Point // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22aec60
	void ServerTakeDamage(float DamageAmount, struct FDamageEvent DamageEvent, struct ABravoHotelCharacter* TargetCharacter); // Function BravoHotelGame.BravoHotelCharacter.ServerTakeDamage // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22aeb10
	void ServerStopUltimate_Recon(); // Function BravoHotelGame.BravoHotelCharacter.ServerStopUltimate_Recon // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22aeac0
	void ServerStopSliding(); // Function BravoHotelGame.BravoHotelCharacter.ServerStopSliding // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22aea70
	void ServerStopRolling(); // Function BravoHotelGame.BravoHotelCharacter.ServerStopRolling // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22aea20
	void ServerStopRevive(struct AActor* RevivedActor); // Function BravoHotelGame.BravoHotelCharacter.ServerStopRevive // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ae960
	void ServerStopResuscitation(struct AActor* ResuscitatedActor); // Function BravoHotelGame.BravoHotelCharacter.ServerStopResuscitation // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ae8a0
	void ServerStopMontage(struct UAnimMontage* AnimMontage, float BlendTime); // Function BravoHotelGame.BravoHotelCharacter.ServerStopMontage // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x22ae7a0
	void ServerStartUltimate_Recon(struct FVector_NetQuantize InitialImpulse); // Function BravoHotelGame.BravoHotelCharacter.ServerStartUltimate_Recon // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ae6f0
	void ServerStartStuntman(); // Function BravoHotelGame.BravoHotelCharacter.ServerStartStuntman // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x22ae6a0
	void ServerStartSteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.ServerStartSteadyAim // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ae650
	void ServerStartSliding(); // Function BravoHotelGame.BravoHotelCharacter.ServerStartSliding // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ae600
	void ServerStartRolling(struct FVector_NetQuantize TargetRollingImpulse); // Function BravoHotelGame.BravoHotelCharacter.ServerStartRolling // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ae550
	void ServerStartRevive(struct AActor* RevivedActor); // Function BravoHotelGame.BravoHotelCharacter.ServerStartRevive // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ae490
	void ServerStartResuscitation(struct AActor* ResuscitatedActor); // Function BravoHotelGame.BravoHotelCharacter.ServerStartResuscitation // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ae3d0
	void ServerStartMeteorJump(); // Function BravoHotelGame.BravoHotelCharacter.ServerStartMeteorJump // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ae380
	void ServerStartKickDoor(struct ABravoHotelDoor* TargetDoor); // Function BravoHotelGame.BravoHotelCharacter.ServerStartKickDoor // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ae2c0
	void ServerStartDescenting(); // Function BravoHotelGame.BravoHotelCharacter.ServerStartDescenting // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ae270
	void ServerStartCastingUI(enum class ECastingUIType CastingUIType, struct FName SourceName, float MaxTime, struct ABravoHotelCharacter* Target); // Function BravoHotelGame.BravoHotelCharacter.ServerStartCastingUI // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ae0e0
	void ServerSpawnPersonalBox(struct FSpawnPerkData SpawnPersonalBoxData, struct FDebugSupplyBoxInfo DebugData); // Function BravoHotelGame.BravoHotelCharacter.ServerSpawnPersonalBox // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22adf70
	void ServerSpawnPerk(struct FSpawnPerkData SpawnPerkData); // Function BravoHotelGame.BravoHotelCharacter.ServerSpawnPerk // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ade60
	void ServerSpawnBombing(struct FVector_NetQuantize SpawnLocation); // Function BravoHotelGame.BravoHotelCharacter.ServerSpawnBombing // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22addb0
	void ServerSetState(enum class ECharacterState NewState); // Function BravoHotelGame.BravoHotelCharacter.ServerSetState // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22add00
	void ServerSetSearchInstinctLocation(struct FVector_NetQuantize InSearchInstinctLocation); // Function BravoHotelGame.BravoHotelCharacter.ServerSetSearchInstinctLocation // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x22adc50
	void ServerSetRemoteViewRotForDriver(uint16_t SendPitch, uint16_t SendYaw); // Function BravoHotelGame.BravoHotelCharacter.ServerSetRemoteViewRotForDriver // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22adb50
	void ServerSetProjectileGrenadeState(struct ABravoHotelProjectileGrenade* Grenade, enum class EProjectileGrenadeState NewState, struct AActor* NewTriggerActor); // Function BravoHotelGame.BravoHotelCharacter.ServerSetProjectileGrenadeState // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ada20
	void ServerSetParachuteTargetRotator(struct FRotator NewRotation); // Function BravoHotelGame.BravoHotelCharacter.ServerSetParachuteTargetRotator // (Net|Native|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x22ad970
	void ServerSetLeanState(enum class ELeanState NewLeanState, float InLeanDegreeMax); // Function BravoHotelGame.BravoHotelCharacter.ServerSetLeanState // (Net|Native|Event|Public|NetServer|NetValidate) // @ game+0x22ad870
	void ServerSetIsParachuteLanding(bool Flag, float Height); // Function BravoHotelGame.BravoHotelCharacter.ServerSetIsParachuteLanding // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x22ad770
	void ServerSetIsFreeLook(bool bNewFreeLook); // Function BravoHotelGame.BravoHotelCharacter.ServerSetIsFreeLook // (Net|Native|Event|Public|NetServer|NetValidate) // @ game+0x22ad6b0
	void ServerSetInSmoke(bool bNewSmoke); // Function BravoHotelGame.BravoHotelCharacter.ServerSetInSmoke // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ad5f0
	void ServerSetFireType(enum class EFireType NewFireType); // Function BravoHotelGame.BravoHotelCharacter.ServerSetFireType // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ad540
	void ServerSetCustomBuoyancySwimMode(bool Mode); // Function BravoHotelGame.BravoHotelCharacter.ServerSetCustomBuoyancySwimMode // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ad480
	void ServerSetCanHeadBanging(bool bFlag); // Function BravoHotelGame.BravoHotelCharacter.ServerSetCanHeadBanging // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ad3c0
	void ServerSetActorRotation(struct FRotator NewRotation); // Function BravoHotelGame.BravoHotelCharacter.ServerSetActorRotation // (Net|Native|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x22ad310
	void ServerSetActorLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation); // Function BravoHotelGame.BravoHotelCharacter.ServerSetActorLocationAndRotation // (Net|Native|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x22ad1e0
	void ServerSendInvalidHitInfos(struct TArray<struct FRepInvalidHitInfo> InvalidHitInofs); // Function BravoHotelGame.BravoHotelCharacter.ServerSendInvalidHitInfos // (Net|Native|Event|Public|NetServer) // @ game+0x22ad140
	void ServerSelectThrowingWeaponThrowingType(enum class EGrenadeThrowingType NewThrowingType); // Function BravoHotelGame.BravoHotelCharacter.ServerSelectThrowingWeaponThrowingType // (Net|Native|Event|Public|NetServer|NetValidate) // @ game+0x22ad090
	void ServerRewindMontage(struct UAnimMontage* AnimMontage); // Function BravoHotelGame.BravoHotelCharacter.ServerRewindMontage // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x22acfd0
	void ServerResetVehicleSearch(); // Function BravoHotelGame.BravoHotelCharacter.ServerResetVehicleSearch // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22acf80
	void ServerResetTerrainType(enum class ETerrainType TerrainType); // Function BravoHotelGame.BravoHotelCharacter.ServerResetTerrainType // (Net|Native|Event|Public|NetServer|NetValidate) // @ game+0x22acec0
	void ServerResetSearchInstinct(); // Function BravoHotelGame.BravoHotelCharacter.ServerResetSearchInstinct // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x22ace70
	void ServerResetPerkInfo(); // Function BravoHotelGame.BravoHotelCharacter.ServerResetPerkInfo // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ace20
	void ServerReselectPerkDeck(); // Function BravoHotelGame.BravoHotelCharacter.ServerReselectPerkDeck // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22acdd0
	void ServerRequestPayMaterial(int32_t ActionCode, int32_t Amount, uint32_t MaterialIndex); // Function BravoHotelGame.BravoHotelCharacter.ServerRequestPayMaterial // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22acca0
	void ServerRequestBuildingItemSpawnState(struct ABravoHotelBuilding* Building); // Function BravoHotelGame.BravoHotelCharacter.ServerRequestBuildingItemSpawnState // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22acbe0
	void ServerRequestBuildingItemSpawnList(int32_t Size, float IntervalTime, bool ToJson); // Function BravoHotelGame.BravoHotelCharacter.ServerRequestBuildingItemSpawnList // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22acaa0
	void ServerRequestBuildingCount(); // Function BravoHotelGame.BravoHotelCharacter.ServerRequestBuildingCount // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22aca50
	void ServerQuickLanding(struct FVector_NetQuantize ClientActorLocation); // Function BravoHotelGame.BravoHotelCharacter.ServerQuickLanding // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ac9a0
	void ServerPlayMontage(struct UAnimMontage* AnimMontageTPP, struct UAnimMontage* AnimMontageFPP, char AnimMelee); // Function BravoHotelGame.BravoHotelCharacter.ServerPlayMontage // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // @ game+0x22ac870
	void ServerPickUpInBox(struct ABravoHotelDropBoxActor* DropBoxActor, int8_t ItemIndex, int32_t GainQuantity, int32_t WeaponSlotIndex); // Function BravoHotelGame.BravoHotelCharacter.ServerPickUpInBox // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x22ac6f0
	void ServerPersonalBoxRePosition(struct ABHPersonalSupplyBox* TargetSupplyBox, struct FVector NewLocation, struct FString HitActorName); // Function BravoHotelGame.BravoHotelCharacter.ServerPersonalBoxRePosition // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x22ac5a0
	void ServerMoveItem(struct AActor* SourceActor, enum class ItemWidgetDragType SourceSlotType, struct FInventoryItemInfo SourceItemInfo, struct AActor* TargetActor, enum class ItemWidgetDragType TargetSlotType, int32_t TargetIndex, int32_t GainQuantity); // Function BravoHotelGame.BravoHotelCharacter.ServerMoveItem // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ac300
	void ServerMeteorStrike(); // Function BravoHotelGame.BravoHotelCharacter.ServerMeteorStrike // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ac2b0
	void ServerMaxAirWalkDistance(float MaxDistance); // Function BravoHotelGame.BravoHotelCharacter.ServerMaxAirWalkDistance // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ac200
	void ServerLaunchCharacter(struct FVector LaunchVelocity); // Function BravoHotelGame.BravoHotelCharacter.ServerLaunchCharacter // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x22ac130
	void ServerJetpackBooster(bool bNewJackpack); // Function BravoHotelGame.BravoHotelCharacter.ServerJetpackBooster // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ac070
	void ServerJetpackAim(bool bNewJetpackAim); // Function BravoHotelGame.BravoHotelCharacter.ServerJetpackAim // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22abfb0
	void ServerInputState(int8_t Forward, int8_t Right); // Function BravoHotelGame.BravoHotelCharacter.ServerInputState // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x22abec0
	void ServerInputFPSOnly(bool bFlag); // Function BravoHotelGame.BravoHotelCharacter.ServerInputFPSOnly // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22abe00
	void ServerHandleDamageToVehicleDestructibleComponent(struct UBravoHotelDestructibleComponent* DestructibleComponent, struct FHitResult HitDetails, struct FVector ImpactVelocity); // Function BravoHotelGame.BravoHotelCharacter.ServerHandleDamageToVehicleDestructibleComponent // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x22abbd0
	void ServerForceUpdateTerrainType(); // Function BravoHotelGame.BravoHotelCharacter.ServerForceUpdateTerrainType // (Net|Native|Event|Public|NetServer|NetValidate) // @ game+0x22abb80
	void ServerFireMode(); // Function BravoHotelGame.BravoHotelCharacter.ServerFireMode // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22abb30
	void ServerFailedActiveSkill(int32_t BuffIndex); // Function BravoHotelGame.BravoHotelCharacter.ServerFailedActiveSkill // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22aba70
	void ServerEscapeTheFlames(struct FMolotovFlameDotDamageInfo FlameDamageInfo); // Function BravoHotelGame.BravoHotelCharacter.ServerEscapeTheFlames // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ab930
	void ServerEquipPerk(enum class EPerkSlotFlag Slot, struct FName PerkName, int32_t Level); // Function BravoHotelGame.BravoHotelCharacter.ServerEquipPerk // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ab7e0
	void ServerEndSteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.ServerEndSteadyAim // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ab790
	void ServerEndRevive(struct AActor* RevivedActor); // Function BravoHotelGame.BravoHotelCharacter.ServerEndRevive // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ab6d0
	void ServerEndResuscitation(struct AActor* ResuscitatedActor); // Function BravoHotelGame.BravoHotelCharacter.ServerEndResuscitation // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ab610
	void ServerDoWalking(bool bNewWalking); // Function BravoHotelGame.BravoHotelCharacter.ServerDoWalking // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ab400
	void ServerDoTryRemoteControlVehicle(struct ABravoHotelVehicle* TargetVehicle); // Function BravoHotelGame.BravoHotelCharacter.ServerDoTryRemoteControlVehicle // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ab340
	void ServerDoSprinting(bool bNewSprinting); // Function BravoHotelGame.BravoHotelCharacter.ServerDoSprinting // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ab280
	void ServerDoRetreat(struct FVector NewLocation, struct FRotator NewRotation, float RandomDistanceMax); // Function BravoHotelGame.BravoHotelCharacter.ServerDoRetreat // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x22ab100
	void ServerDoProne(bool bNewProne); // Function BravoHotelGame.BravoHotelCharacter.ServerDoProne // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ab040
	void ServerDoPickUpItemOrWeapon(int32_t WeaponSlotIndex, struct ABravoHotelPickup* PickableItem, int32_t GainQuantity); // Function BravoHotelGame.BravoHotelCharacter.ServerDoPickUpItemOrWeapon // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x22aaf10
	void ServerDoorBreaching(struct ABravoHotelDoor* TargetDoor, bool bIsDamageCauserFrontOfDoor, struct TArray<struct ABravoHotelCharacter*> TargetDamagedCharacters); // Function BravoHotelGame.BravoHotelCharacter.ServerDoorBreaching // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22ab4c0
	void ServerDoNuclear(struct FVector_NetQuantize SpawnLocation); // Function BravoHotelGame.BravoHotelCharacter.ServerDoNuclear // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22aae60
	void ServerDoAirWalk(bool bNewAirWalk, float InDuration, float InGravity); // Function BravoHotelGame.BravoHotelCharacter.ServerDoAirWalk // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22aad20
	void ServerDamageInFlames(struct FMolotovFlameDotDamageInfo FlameDamageInfo); // Function BravoHotelGame.BravoHotelCharacter.ServerDamageInFlames // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22aabe0
	void ServerCompletedCombine(); // Function BravoHotelGame.BravoHotelCharacter.ServerCompletedCombine // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x22aab90
	void ServerClearCastingUI(); // Function BravoHotelGame.BravoHotelCharacter.ServerClearCastingUI // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22aab40
	void ServerChoosePerkDeck(int32_t ChooseIndex); // Function BravoHotelGame.BravoHotelCharacter.ServerChoosePerkDeck // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22aaa80
	void ServerCheckLineTrace(); // Function BravoHotelGame.BravoHotelCharacter.ServerCheckLineTrace // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22aaa30
	void ServerChangeRandomPerk(struct FName PerkName); // Function BravoHotelGame.BravoHotelCharacter.ServerChangeRandomPerk // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // @ game+0x22aa940
	void ServerChangeGender(); // Function BravoHotelGame.BravoHotelCharacter.ServerChangeGender // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22aa8f0
	void ServerChangeExpertWeapon(struct FName ExpertWeaponName); // Function BravoHotelGame.BravoHotelCharacter.ServerChangeExpertWeapon // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // @ game+0x22aa800
	void ServerCancleActiveSkill(int32_t CancleActiveSkillSlot); // Function BravoHotelGame.BravoHotelCharacter.ServerCancleActiveSkill // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22aa740
	void ServerBuildingCountCheck(); // Function BravoHotelGame.BravoHotelCharacter.ServerBuildingCountCheck // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22aa6f0
	void ServerBeginCombine(struct FName RecipeKey); // Function BravoHotelGame.BravoHotelCharacter.ServerBeginCombine // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x22aa600
	void ServerBeginCastingBackpackItem(int32_t BackpackItemIndex); // Function BravoHotelGame.BravoHotelCharacter.ServerBeginCastingBackpackItem // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x22aa540
	void ServerAttachToComponent(struct AActor* AttachingActor, struct UPrimitiveComponent* AttachedComponent, struct FVector AttachLocation, struct FVector AttachNormal); // Function BravoHotelGame.BravoHotelCharacter.ServerAttachToComponent // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x22aa390
	void ServerApplyDamage(float DamageAmount, struct FDamageEvent DamageEvent, struct AController* EventInstigator, struct AActor* DamageCauser); // Function BravoHotelGame.BravoHotelCharacter.ServerApplyDamage // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22aa200
	void ServerAddPerk(int32_t Count); // Function BravoHotelGame.BravoHotelCharacter.ServerAddPerk // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22aa140
	void ServerActiveSkill(int32_t ActiveSkillSlot); // Function BravoHotelGame.BravoHotelCharacter.ServerActiveSkill // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x22aa080
	void ServerActionDestructObject(struct ADestructibleActor* DestructibleActor, struct UDestructibleComponent* DestructibleComponent, struct FVector Location, float Damage, float EffectRange); // Function BravoHotelGame.BravoHotelCharacter.ServerActionDestructObject // (Net|Native|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x22a9eb0
	void ServerAbortCombine(); // Function BravoHotelGame.BravoHotelCharacter.ServerAbortCombine // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x22a9e60
	void ServerAbortCastingBackpackItem(int32_t BackpackItemIndex); // Function BravoHotelGame.BravoHotelCharacter.ServerAbortCastingBackpackItem // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x22a9da0
	void SelectThrowingWeaponThrowingType(); // Function BravoHotelGame.BravoHotelCharacter.SelectThrowingWeaponThrowingType // (Final|Native|Public|BlueprintCallable) // @ game+0x22a9d80
	void SelectPerkDeck(struct FName DeckName); // Function BravoHotelGame.BravoHotelCharacter.SelectPerkDeck // (Final|Native|Public|BlueprintCallable) // @ game+0x22a9ce0
	void RifleMeleeAttack(); // Function BravoHotelGame.BravoHotelCharacter.RifleMeleeAttack // (Final|Native|Protected) // @ game+0x22a9cc0
	void RevertGeneralSettingNearClipPlane(); // Function BravoHotelGame.BravoHotelCharacter.RevertGeneralSettingNearClipPlane // (Final|Native|Public|BlueprintCallable) // @ game+0x22a9ca0
	void ResetTargetHealth(); // Function BravoHotelGame.BravoHotelCharacter.ResetTargetHealth // (Final|Native|Public|BlueprintCallable) // @ game+0x22a9c80
	void ResetPerkDeckUI(); // Function BravoHotelGame.BravoHotelCharacter.ResetPerkDeckUI // (Final|Native|Public|BlueprintCallable) // @ game+0x22a9c60
	void ResetOxygen(); // Function BravoHotelGame.BravoHotelCharacter.ResetOxygen // (Final|Native|Public) // @ game+0x22a9c40
	void ResetNoOxygenMaterial(); // Function BravoHotelGame.BravoHotelCharacter.ResetNoOxygenMaterial // (Final|Native|Public) // @ game+0x22a9c20
	void ResetMagneticDamagedCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.ResetMagneticDamagedCharacterMaterial // (Final|Native|Public) // @ game+0x22a9c00
	void ResetLanding(); // Function BravoHotelGame.BravoHotelCharacter.ResetLanding // (Final|Native|Public) // @ game+0x22a9be0
	void ResetIdleNum(); // Function BravoHotelGame.BravoHotelCharacter.ResetIdleNum // (Final|Native|Public) // @ game+0x22a9bc0
	void ResetFlashBangPP(); // Function BravoHotelGame.BravoHotelCharacter.ResetFlashBangPP // (Final|Native|Public) // @ game+0x22a9ba0
	void ResetDustCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.ResetDustCharacterMaterial // (Final|Native|Public) // @ game+0x22a9b80
	void ResetDamagedCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.ResetDamagedCharacterMaterial // (Final|Native|Public) // @ game+0x22a9b60
	void ResendHUDInfo(); // Function BravoHotelGame.BravoHotelCharacter.ResendHUDInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x22a9b40
	void RequestServerBuildingCount(); // Function BravoHotelGame.BravoHotelCharacter.RequestServerBuildingCount // (Final|Native|Public|BlueprintCallable) // @ game+0x22a9b20
	void RequestProximityUpdate(); // Function BravoHotelGame.BravoHotelCharacter.RequestProximityUpdate // (Final|Native|Public) // @ game+0x22a9b00
	void RequestNearBuildingItemSpawnState(); // Function BravoHotelGame.BravoHotelCharacter.RequestNearBuildingItemSpawnState // (Final|Native|Public|BlueprintCallable) // @ game+0x22a9ae0
	void RequestAllBuildingItemSpawnInfo(int32_t RequestSize, float IntervalTime, bool ToJson); // Function BravoHotelGame.BravoHotelCharacter.RequestAllBuildingItemSpawnInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x22a99d0
	void ReplaceFreeLookImmediately(); // Function BravoHotelGame.BravoHotelCharacter.ReplaceFreeLookImmediately // (Final|Native|Public|BlueprintCallable) // @ game+0x22a99b0
	void RemoveWearableItem(enum class EWearableItemType Slot, bool bUpdateSkeletalMesh); // Function BravoHotelGame.BravoHotelCharacter.RemoveWearableItem // (Final|Native|Public|BlueprintCallable) // @ game+0x22a98e0
	void RemoveThrownMolotovCocktail(struct ABravoHotelProjectileGrenadeMolotovCocktail* MolotovCocktail); // Function BravoHotelGame.BravoHotelCharacter.RemoveThrownMolotovCocktail // (Final|Native|Public) // @ game+0x22a9860
	void RemoveThrownFlashbang(struct ABravoHotelProjectileGrenadeFlashbang* Flashbang); // Function BravoHotelGame.BravoHotelCharacter.RemoveThrownFlashbang // (Final|Native|Public) // @ game+0x22a97e0
	void RemoveTargetHealth(enum class ETargetHealthType Type); // Function BravoHotelGame.BravoHotelCharacter.RemoveTargetHealth // (Final|Native|Public|BlueprintCallable) // @ game+0x22a9760
	void RemoveShortTimeHealth(struct UObject* HealthOwner); // Function BravoHotelGame.BravoHotelCharacter.RemoveShortTimeHealth // (Final|Native|Public) // @ game+0x22a96e0
	void RemoveEquippingWearableItems(); // Function BravoHotelGame.BravoHotelCharacter.RemoveEquippingWearableItems // (Final|Native|Public) // @ game+0x22a96c0
	void RemoveDetectedStealable(struct ABravoHotelCharacter* NewCharacter); // Function BravoHotelGame.BravoHotelCharacter.RemoveDetectedStealable // (Final|Native|Public|BlueprintCallable) // @ game+0x22a9640
	void RemoveDetectedItem(struct ABravoHotelPickup* NewPickup); // Function BravoHotelGame.BravoHotelCharacter.RemoveDetectedItem // (Final|Native|Public|BlueprintCallable) // @ game+0x22a95c0
	void RemoveDetectedDropBox(struct ABravoHotelDropBoxActor* NewPickup); // Function BravoHotelGame.BravoHotelCharacter.RemoveDetectedDropBox // (Final|Native|Public|BlueprintCallable) // @ game+0x22a9540
	void RemoveCondition(enum class ECharacterConditionType ConditionType, enum class EAbilityCase Key); // Function BravoHotelGame.BravoHotelCharacter.RemoveCondition // (Final|Native|Public) // @ game+0x22a9480
	void RemoveCameraPP(struct UCameraPostProcessPreset* TargetPPPresetClass); // Function BravoHotelGame.BravoHotelCharacter.RemoveCameraPP // (Final|Native|Public) // @ game+0x22a9400
	void RemoveBackpackShield(struct FBravoHotelDamageEvent_Point& DamageEvent); // Function BravoHotelGame.BravoHotelCharacter.RemoveBackpackShield // (Final|Native|Public|HasOutParms) // @ game+0x22a92c0
	struct FName RemoveArmShield(struct ABravoHotelRangedWeapon* DamageCauserWeapon, struct FHitResult& TargetHitResult, struct FVector& ShotDirection); // Function BravoHotelGame.BravoHotelCharacter.RemoveArmShield // (Final|Native|Public|HasOutParms|HasDefaults|Const) // @ game+0x22a9120
	void RemoveAllWearableItem2(); // Function BravoHotelGame.BravoHotelCharacter.RemoveAllWearableItem2 // (Final|Native|Public|BlueprintCallable) // @ game+0x22a90e0
	void RemoveAllWearableItem(); // Function BravoHotelGame.BravoHotelCharacter.RemoveAllWearableItem // (Final|Native|Public|BlueprintCallable) // @ game+0x22a9100
	void RemoveAllFoundVehicleLocations(); // Function BravoHotelGame.BravoHotelCharacter.RemoveAllFoundVehicleLocations // (Final|Native|Public) // @ game+0x22a90c0
	void RemoveAllDetectedItems(); // Function BravoHotelGame.BravoHotelCharacter.RemoveAllDetectedItems // (Final|Native|Public|BlueprintCallable) // @ game+0x22a90a0
	void RemoveAllBackpackItem(); // Function BravoHotelGame.BravoHotelCharacter.RemoveAllBackpackItem // (Final|Native|Public|BlueprintCallable) // @ game+0x22a9080
	void RefreshAppearanceInfo(); // Function BravoHotelGame.BravoHotelCharacter.RefreshAppearanceInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x22a9060
	void ReduceCharacterSpeedInGrenadeExplosionRange(); // Function BravoHotelGame.BravoHotelCharacter.ReduceCharacterSpeedInGrenadeExplosionRange // (Final|Native|Public) // @ game+0x22a9040
	void ReconnectProcess(); // Function BravoHotelGame.BravoHotelCharacter.ReconnectProcess // (Final|Native|Public) // @ game+0x22a9020
	void ReceiverVoice(struct FName Idx); // Function BravoHotelGame.BravoHotelCharacter.ReceiverVoice // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x22a8f90
	void ReadyTeleport(); // Function BravoHotelGame.BravoHotelCharacter.ReadyTeleport // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void ReadyGivePerkEvent(); // Function BravoHotelGame.BravoHotelCharacter.ReadyGivePerkEvent // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void PunchOnGround(); // Function BravoHotelGame.BravoHotelCharacter.PunchOnGround // (Final|Native|Protected) // @ game+0x22a8f70
	void PunchOnAir(); // Function BravoHotelGame.BravoHotelCharacter.PunchOnAir // (Final|Native|Protected) // @ game+0x22a8f50
	void Prone(bool bClientSimulation); // Function BravoHotelGame.BravoHotelCharacter.Prone // (Native|Public|BlueprintCallable) // @ game+0x22a8ec0
	void PrintAllDetectedItems(); // Function BravoHotelGame.BravoHotelCharacter.PrintAllDetectedItems // (Final|Native|Public|BlueprintCallable) // @ game+0x22a8ea0
	void PrepareLanding(enum class ELandingReason InLandingReason); // Function BravoHotelGame.BravoHotelCharacter.PrepareLanding // (Final|Native|Public|BlueprintCallable) // @ game+0x22a8e20
	void PreChangeCQRKey(); // Function BravoHotelGame.BravoHotelCharacter.PreChangeCQRKey // (Final|Native|Public|BlueprintCallable) // @ game+0x22a8e00
	void PlaySoundPlosiveSoundDetection3Lv(); // Function BravoHotelGame.BravoHotelCharacter.PlaySoundPlosiveSoundDetection3Lv // (Final|Native|Public|BlueprintCallable) // @ game+0x22a8de0
	void PlayMontageTakeDamage(); // Function BravoHotelGame.BravoHotelCharacter.PlayMontageTakeDamage // (Final|Native|Public|BlueprintCallable) // @ game+0x22a8dc0
	void PlayDeathAnimation(struct FAnimSlot DeathAnimSlot, bool bIsForce, struct FVector Force, struct FRotator DeathRotation); // Function BravoHotelGame.BravoHotelCharacter.PlayDeathAnimation // (Final|Native|Private|HasDefaults) // @ game+0x22a8c40
	struct FAudioPlayingHandle PlayCharacterSound(struct UAkAudioEvent* Event, struct TArray<struct FAudioCondition>& Conditions); // Function BravoHotelGame.BravoHotelCharacter.PlayCharacterSound // (Final|BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x22a8b10
	void PlayCameraShakeDescenting(); // Function BravoHotelGame.BravoHotelCharacter.PlayCameraShakeDescenting // (Final|Native|Public) // @ game+0x22a8af0
	void PistolMeleeAttack(); // Function BravoHotelGame.BravoHotelCharacter.PistolMeleeAttack // (Final|Native|Protected) // @ game+0x22a8ad0
	void PickableItemDetected__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.PickableItemDetected__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void PhysicsImpulse_OnServer(struct ABravoHotelMutiplayerPhysicsActor* PhysicsActor, struct FVector Impulse, struct FName BoneName); // Function BravoHotelGame.BravoHotelCharacter.PhysicsImpulse_OnServer // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x22a8960
	void PhysicsImpulse_Multicast(struct ABravoHotelMutiplayerPhysicsActor* PhysicsActor, struct FVector Impulse, struct FName BoneName); // Function BravoHotelGame.BravoHotelCharacter.PhysicsImpulse_Multicast // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // @ game+0x22a8830
	void PhysicsActor_OnServer(struct ABravoHotelMutiplayerPhysicsActor* PhysicsActor, struct FTransform actorTransform); // Function BravoHotelGame.BravoHotelCharacter.PhysicsActor_OnServer // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x22a86d0
	void PhysicsActor_Multicast(struct ABravoHotelMutiplayerPhysicsActor* PhysicsActor, struct FTransform actorTransform); // Function BravoHotelGame.BravoHotelCharacter.PhysicsActor_Multicast // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // @ game+0x22a8590
	void PhasePerkLevelUpTimer(float DelayTime, int32_t UpCount); // Function BravoHotelGame.BravoHotelCharacter.PhasePerkLevelUpTimer // (Final|Native|Public) // @ game+0x22a84c0
	void PhasePerkLevelUpReady(); // Function BravoHotelGame.BravoHotelCharacter.PhasePerkLevelUpReady // (Final|Native|Public) // @ game+0x22a84a0
	void PhasePerkLevelUp(int32_t UpCount); // Function BravoHotelGame.BravoHotelCharacter.PhasePerkLevelUp // (Final|Native|Public) // @ game+0x22a8420
	void PerkSpinEvent(bool bShow, int32_t Count, enum class EPerkSlotFlag Slot); // Function BravoHotelGame.BravoHotelCharacter.PerkSpinEvent // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void OnViewCameraOutWater__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnViewCameraOutWater__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnViewCameraInWater__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnViewCameraInWater__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnUpdateStartReady(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateStartReady // (Final|Native|Public) // @ game+0x22a83a0
	void OnUpdateRemotingVehicle(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateRemotingVehicle // (Final|Native|Public) // @ game+0x22a8120
	void OnUpdatePassenger(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdatePassenger // (Final|Native|Public) // @ game+0x22a8020
	void OnUpdateParachuting(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateParachuting // (Final|Native|Public) // @ game+0x22a8320
	void OnUpdateLadder(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateLadder // (Final|Native|Public) // @ game+0x22a8120
	void OnUpdateKnockout(float fDeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateKnockout // (Final|Native|Public) // @ game+0x22a82a0
	void OnUpdateInAircraftCinematic(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateInAircraftCinematic // (Final|Native|Public) // @ game+0x22a8220
	void OnUpdateInAircraft(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateInAircraft // (Final|Native|Public) // @ game+0x22a81a0
	void OnUpdateEndReady(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateEndReady // (Final|Native|Public) // @ game+0x22a8120
	void OnUpdateDriverPossessedPawn(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateDriverPossessedPawn // (Final|Native|Public) // @ game+0x22a80a0
	void OnUpdateDriver(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateDriver // (Final|Native|Public) // @ game+0x22a8020
	void OnUpdateDescent(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateDescent // (Final|Native|Public) // @ game+0x22a7fa0
	void OnUpdateDeath(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateDeath // (Final|Native|Public) // @ game+0x22a7f20
	void OnUpdateCriticalTime(float fDeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateCriticalTime // (Final|Native|Public) // @ game+0x22a7ea0
	void OnUpdateBattle(float fDeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateBattle // (Final|Native|Public) // @ game+0x22a7e20
	void OnToggleWidget(enum class EToggleWidgetModeType& ToggleType); // Function BravoHotelGame.BravoHotelCharacter.OnToggleWidget // (Final|Native|Public|HasOutParms) // @ game+0x22a7d90
	void OnThrowingGrenadeMontageEnded(struct UAnimMontage* Montage, bool bInterrupted); // Function BravoHotelGame.BravoHotelCharacter.OnThrowingGrenadeMontageEnded // (Final|Native|Protected) // @ game+0x22a6cb0
	void OnStartCineAircraft(struct AActor* InAircraftFlight); // Function BravoHotelGame.BravoHotelCharacter.OnStartCineAircraft // (Final|Native|Protected) // @ game+0x22a7d10
	void OnSpawnBlackOutDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnSpawnBlackOutDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnSetBaseElevator(struct UPrimitiveComponent* baseComponent); // Function BravoHotelGame.BravoHotelCharacter.OnSetBaseElevator // (Final|Native|Public|BlueprintCallable) // @ game+0x22a7c90
	void OnRep_UnderWater(bool& LastFlag); // Function BravoHotelGame.BravoHotelCharacter.OnRep_UnderWater // (Final|Native|Public|HasOutParms) // @ game+0x22a7be0
	void OnRep_SteadyPoint(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_SteadyPoint // (Final|Native|Public) // @ game+0x22a7b40
	void OnRep_SteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_SteadyAim // (Final|Native|Private) // @ game+0x22a7bc0
	void OnRep_Oxygen(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_Oxygen // (Final|Native|Public) // @ game+0x22a7b40
	void OnRep_OverHealHealth(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_OverHealHealth // (Final|Native|Private) // @ game+0x22a7b20
	void OnRep_NeedFindPersonalSupplyBoxLocation(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_NeedFindPersonalSupplyBoxLocation // (Final|Native|Public) // @ game+0x22a7ae0
	void OnRep_MaxHealth(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_MaxHealth // (Final|Native|Public) // @ game+0x22a7ac0
	void OnRep_LeanState(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_LeanState // (Final|Native|Public) // @ game+0x22a7aa0
	void OnRep_IsDetectedByEnemy(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_IsDetectedByEnemy // (Final|Native|Public) // @ game+0x22a7a60
	void OnRep_Health(float& LastHealth); // Function BravoHotelGame.BravoHotelCharacter.OnRep_Health // (Final|Native|Private|HasOutParms|BlueprintCallable) // @ game+0x22a79a0
	void OnRep_FPSK_TargetMagnificationFactor(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_FPSK_TargetMagnificationFactor // (Final|Native|Public) // @ game+0x22a7960
	void OnRep_CurrentPerkInfos(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_CurrentPerkInfos // (Final|Native|Protected) // @ game+0x22a7940
	void OnRep_CurrentPerkDeck(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_CurrentPerkDeck // (Final|Native|Public) // @ game+0x22a7900
	void OnRep_BoostPercent(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_BoostPercent // (Final|Native|Public) // @ game+0x22a78c0
	void OnRep_bInSmoke(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_bInSmoke // (Final|Native|Public) // @ game+0x22a7c70
	void OnRep_BandageTargetHealth(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_BandageTargetHealth // (Final|Native|Public) // @ game+0x22a78a0
	void OnPinOffMontageEnded(struct UAnimMontage* Montage, bool bInterrupted); // Function BravoHotelGame.BravoHotelCharacter.OnPinOffMontageEnded // (Final|Native|Protected) // @ game+0x22a6cb0
	void OnParachuteSkinDataLoaded(struct TSoftObjectPtr<UMaterialInterface> TargetParachuteSkin); // Function BravoHotelGame.BravoHotelCharacter.OnParachuteSkinDataLoaded // (Final|Native|Public) // @ game+0x22a7780
	void OnOverlapEnd(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function BravoHotelGame.BravoHotelCharacter.OnOverlapEnd // (Final|Native|Protected) // @ game+0x22a7640
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function BravoHotelGame.BravoHotelCharacter.OnOverlapBegin // (Final|Native|Protected|HasOutParms) // @ game+0x22a7430
	void OnOutSmoke__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnOutSmoke__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnOriginRebasing(struct UWorld* World, struct FIntVector PreviosWorldOriginLocation, struct FIntVector OriginLocation); // Function BravoHotelGame.BravoHotelCharacter.OnOriginRebasing // (Native|Public|HasDefaults) // @ game+0x22a7300
	void OnMovementUpdated(float DeltaSeconds, struct FVector OldLocation, struct FVector OldVelocity); // Function BravoHotelGame.BravoHotelCharacter.OnMovementUpdated // (Final|Native|Protected|HasDefaults) // @ game+0x22a71e0
	void OnMovementInputPressed__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnMovementInputPressed__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnInstigatorHitCharacter(struct UBravoHotelDamageType* DamageTypeClass); // Function BravoHotelGame.BravoHotelCharacter.OnInstigatorHitCharacter // (Final|Native|Public) // @ game+0x22a7160
	void OnInSmoke__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnInSmoke__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnInputStopFreeLook(); // Function BravoHotelGame.BravoHotelCharacter.OnInputStopFreeLook // (Final|Native|Public) // @ game+0x22a7140
	void OnInputStopFire(); // Function BravoHotelGame.BravoHotelCharacter.OnInputStopFire // (Final|Native|Public) // @ game+0x22a7120
	void OnInputStopBoostItemMenu(); // Function BravoHotelGame.BravoHotelCharacter.OnInputStopBoostItemMenu // (Final|Native|Public|BlueprintCallable) // @ game+0x22a7100
	void OnInputStartSprinting(); // Function BravoHotelGame.BravoHotelCharacter.OnInputStartSprinting // (Final|Native|Public) // @ game+0x22a70e0
	void OnInputStartMovement(); // Function BravoHotelGame.BravoHotelCharacter.OnInputStartMovement // (Final|Native|Public) // @ game+0x174cbb0
	void OnInputStartMatch(); // Function BravoHotelGame.BravoHotelCharacter.OnInputStartMatch // (Final|Native|Public|BlueprintCallable) // @ game+0x22986d0
	void OnInputStartFreeLook(); // Function BravoHotelGame.BravoHotelCharacter.OnInputStartFreeLook // (Final|Native|Public) // @ game+0x22a70c0
	void OnInputSmartPingMenuWorldMap(); // Function BravoHotelGame.BravoHotelCharacter.OnInputSmartPingMenuWorldMap // (Final|Native|Public|BlueprintCallable) // @ game+0x22a70a0
	void OnInputSmartPingMenu2WorldMap(); // Function BravoHotelGame.BravoHotelCharacter.OnInputSmartPingMenu2WorldMap // (Final|Native|Public|BlueprintCallable) // @ game+0x22a7060
	void OnInputSmartPingMenu(); // Function BravoHotelGame.BravoHotelCharacter.OnInputSmartPingMenu // (Final|Native|Public|BlueprintCallable) // @ game+0x22a7080
	void OnInputReleaseCrouch(); // Function BravoHotelGame.BravoHotelCharacter.OnInputReleaseCrouch // (Final|Native|Public) // @ game+0x22a7040
	void OnInputFPSOnly(); // Function BravoHotelGame.BravoHotelCharacter.OnInputFPSOnly // (Final|Native|Public|BlueprintCallable) // @ game+0x22a7020
	void OnInputEndSteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.OnInputEndSteadyAim // (Final|Native|Public) // @ game+0x22a7000
	void OnInputCheckActors(); // Function BravoHotelGame.BravoHotelCharacter.OnInputCheckActors // (Final|Native|Public|BlueprintCallable) // @ game+0x22a6fe0
	void OnInitializedFSM(struct UStateMachineComponent* Context); // Function BravoHotelGame.BravoHotelCharacter.OnInitializedFSM // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x22a6f50
	void OnHPChangeDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnHPChangeDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnHitMeteorStrike(struct UPrimitiveComponent* HitComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, struct FVector NormalImpulse, struct FHitResult& Hit); // Function BravoHotelGame.BravoHotelCharacter.OnHitMeteorStrike // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x22a6d80
	void OnGrenadeCookMontageEnded(struct UAnimMontage* Montage, bool bInterrupted); // Function BravoHotelGame.BravoHotelCharacter.OnGrenadeCookMontageEnded // (Final|Native|Protected) // @ game+0x22a6cb0
	void OnFinishRocketJump(); // Function BravoHotelGame.BravoHotelCharacter.OnFinishRocketJump // (Final|Native|Public) // @ game+0x22a6c90
	void OnFinishMeteorJump(); // Function BravoHotelGame.BravoHotelCharacter.OnFinishMeteorJump // (Final|Native|Public) // @ game+0x22a6c70
	void OnFinishAirWalk(); // Function BravoHotelGame.BravoHotelCharacter.OnFinishAirWalk // (Final|Native|Public) // @ game+0x22a6c50
	void OnExitStartReady(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitStartReady // (Final|Native|Public) // @ game+0x22a67f0
	void OnExitRemotingVehicle(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitRemotingVehicle // (Final|Native|Public) // @ game+0x22a6b90
	void OnExitPassenger(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitPassenger // (Final|Native|Public) // @ game+0x22a6b10
	void OnExitParachuting(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitParachuting // (Final|Native|Public) // @ game+0x22a6a90
	void OnExitLadder(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitLadder // (Final|Native|Public) // @ game+0x22a6a10
	void OnExitKnockout(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitKnockout // (Final|Native|Public) // @ game+0x22a6990
	void OnExitInAircraftCinematic(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitInAircraftCinematic // (Final|Native|Public) // @ game+0x22a6910
	void OnExitInAircraft(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitInAircraft // (Final|Native|Public) // @ game+0x22a6890
	void OnExitHipShot(); // Function BravoHotelGame.BravoHotelCharacter.OnExitHipShot // (Final|Native|Public) // @ game+0x174cbb0
	void OnExitHeartBeatSensor(); // Function BravoHotelGame.BravoHotelCharacter.OnExitHeartBeatSensor // (Final|Native|Public) // @ game+0x22a6870
	void OnExitFallingState__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnExitFallingState__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnExitEndReady(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitEndReady // (Final|Native|Public) // @ game+0x22a67f0
	void OnExitedVehicle(); // Function BravoHotelGame.BravoHotelCharacter.OnExitedVehicle // (Final|Native|Protected) // @ game+0x22a6c30
	void OnExitedElevator(); // Function BravoHotelGame.BravoHotelCharacter.OnExitedElevator // (Final|Native|Public|BlueprintCallable) // @ game+0x22a6c10
	void OnExitDriverPossessedPawn(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitDriverPossessedPawn // (Final|Native|Public) // @ game+0x22a6770
	void OnExitDriver(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitDriver // (Final|Native|Public) // @ game+0x22a66f0
	void OnExitDescent(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitDescent // (Final|Native|Public) // @ game+0x22a6670
	void OnExitDeath(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitDeath // (Final|Native|Public) // @ game+0x22a65f0
	void OnExitCriticalTime(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitCriticalTime // (Final|Native|Public) // @ game+0x22a6570
	void OnExitBattle(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitBattle // (Final|Native|Public) // @ game+0x22a64f0
	void OnExitAOS(); // Function BravoHotelGame.BravoHotelCharacter.OnExitAOS // (Final|Native|Public) // @ game+0x22a64d0
	void OnExitAMP(); // Function BravoHotelGame.BravoHotelCharacter.OnExitAMP // (Final|Native|Public) // @ game+0x22a64b0
	void OnExitADS(bool bImmediately); // Function BravoHotelGame.BravoHotelCharacter.OnExitADS // (Final|Native|Public) // @ game+0x22a6420
	void OnEnterHipShot(bool bImmediately); // Function BravoHotelGame.BravoHotelCharacter.OnEnterHipShot // (Final|Native|Public) // @ game+0x22a62f0
	void OnEnterHeartBeatSensor(bool bImmediately); // Function BravoHotelGame.BravoHotelCharacter.OnEnterHeartBeatSensor // (Final|Native|Public) // @ game+0x22a6260
	void OnEnteredVehicle__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnEnteredVehicle__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnEnteredVehicle(); // Function BravoHotelGame.BravoHotelCharacter.OnEnteredVehicle // (Final|Native|Protected) // @ game+0x22a6400
	void OnEnteredElevator(struct ABravoHotelMoveElevator* OutElevatorRef); // Function BravoHotelGame.BravoHotelCharacter.OnEnteredElevator // (Final|Native|Public|BlueprintCallable) // @ game+0x22a6380
	void OnEnterAOS(bool bImmediately); // Function BravoHotelGame.BravoHotelCharacter.OnEnterAOS // (Final|Native|Public) // @ game+0x22a61d0
	void OnEnterAMP(bool bImmediately); // Function BravoHotelGame.BravoHotelCharacter.OnEnterAMP // (Final|Native|Public) // @ game+0x22a6140
	void OnEnterADS(bool bImmediately); // Function BravoHotelGame.BravoHotelCharacter.OnEnterADS // (Final|Native|Public) // @ game+0x22a60b0
	void OnEndSearchInstinct__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnEndSearchInstinct__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnEndCineAircraft(); // Function BravoHotelGame.BravoHotelCharacter.OnEndCineAircraft // (Final|Native|Protected) // @ game+0x22a6090
	void OnDeath(); // Function BravoHotelGame.BravoHotelCharacter.OnDeath // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x22a6070
	void OnDamaged(struct UBravoHotelDamageType* DamageTypeClass, float DamageAmount); // Function BravoHotelGame.BravoHotelCharacter.OnDamaged // (Final|Native|Protected) // @ game+0x22a5fa0
	void OnConditionStarted(enum class ECharacterConditionType NewCondition); // Function BravoHotelGame.BravoHotelCharacter.OnConditionStarted // (Final|Native|Public) // @ game+0x22a5f20
	void OnConditionEnded(enum class ECharacterConditionType NewCondition); // Function BravoHotelGame.BravoHotelCharacter.OnConditionEnded // (Final|Native|Public) // @ game+0x22a5ea0
	void OnCompleteActiveSkillDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnCompleteActiveSkillDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnCombinationCompleted(); // Function BravoHotelGame.BravoHotelCharacter.OnCombinationCompleted // (Final|Native|Public) // @ game+0x22a5e80
	void OnCheckSupplyCost__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnCheckSupplyCost__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnCharacterGroundStateChange__DelegateSignature(enum class ECharacterGroundState State); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnCharacterGroundStateChange__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnChangeWeaponAttachments(); // Function BravoHotelGame.BravoHotelCharacter.OnChangeWeaponAttachments // (Final|Native|Public) // @ game+0x22a5da0
	void OnChangeTeleportState(bool IsStart); // Function BravoHotelGame.BravoHotelCharacter.OnChangeTeleportState // (Final|Native|Public|BlueprintCallable) // @ game+0x22a5d10
	void OnChangeTargetHealthDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnChangeTargetHealthDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnChangeProjectilePredictPath__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnChangeProjectilePredictPath__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnChangePerkNameList__DelegateSignature(struct TArray<struct FName>& ChangedPerkNameList); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnChangePerkNameList__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x2bad3b0
	void OnChangeLungGaugeDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnChangeLungGaugeDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnChangeLeanStateDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnChangeLeanStateDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnChangeHeadBangingDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnChangeHeadBangingDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnChangeFireType__DelegateSignature(enum class EFireType PreFireType, enum class EFireType NewFireType); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnChangeFireType__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnChangeEquipWeaponStateIntheWater(bool bState); // Function BravoHotelGame.BravoHotelCharacter.OnChangeEquipWeaponStateIntheWater // (Final|Native|Public) // @ game+0x22a5c80
	void OnChangeDetectedItems__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnChangeDetectedItems__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnChangedDediSettings(enum class ESettingType SettingType, float Value); // Function BravoHotelGame.BravoHotelCharacter.OnChangedDediSettings // (Final|Native|Public) // @ game+0x22a5dc0
	void OnChangedClassLevel__DelegateSignature(int32_t Level); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnChangedClassLevel__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnChangeCurrentWeapon(); // Function BravoHotelGame.BravoHotelCharacter.OnChangeCurrentWeapon // (Final|Native|Private) // @ game+0x22a5c60
	void OnChangeArmorInfo__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnChangeArmorInfo__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnCameraViewModeChanged__DelegateSignature(bool bIsThirdPerson); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnCameraViewModeChanged__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnBoxChanged(); // Function BravoHotelGame.BravoHotelCharacter.OnBoxChanged // (Final|Native|Public) // @ game+0x2297900
	void OnBlueZoneFollowingChanged(struct AActor* Checker, bool bIsFollowing); // Function BravoHotelGame.BravoHotelCharacter.OnBlueZoneFollowingChanged // (Final|Native|Protected) // @ game+0x22a5b90
	void OnBeginStartReady(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginStartReady // (Final|Native|Public) // @ game+0x22a5b70
	void OnBeginRemotingVehicle(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginRemotingVehicle // (Final|Native|Public) // @ game+0x22a5b50
	void OnBeginPassenger(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginPassenger // (Final|Native|Public) // @ game+0x22a5b30
	void OnBeginParachuting(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginParachuting // (Final|Native|Public) // @ game+0x22a5b10
	void OnBeginLadder(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginLadder // (Final|Native|Public) // @ game+0x22a5af0
	void OnBeginKnockout(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginKnockout // (Final|Native|Public) // @ game+0x22a5ad0
	void OnBeginInAircraftCinematic(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginInAircraftCinematic // (Final|Native|Public) // @ game+0x22a5ab0
	void OnBeginInAircraft(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginInAircraft // (Final|Native|Public) // @ game+0x22a5a90
	void OnBeginEndReady(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginEndReady // (Final|Native|Public) // @ game+0x22a5a70
	void OnBeginDriverPossessedPawn(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginDriverPossessedPawn // (Final|Native|Public) // @ game+0x22a5a50
	void OnBeginDriver(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginDriver // (Final|Native|Public) // @ game+0x22a5a30
	void OnBeginDescent(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginDescent // (Final|Native|Public) // @ game+0x22a5a10
	void OnBeginDeath(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginDeath // (Final|Native|Public) // @ game+0x22a59f0
	void OnBeginCriticalTime(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginCriticalTime // (Final|Native|Public) // @ game+0x22a59d0
	void OnBeginBattle(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginBattle // (Final|Native|Public) // @ game+0x22a59b0
	void OnBattleRoyalStateChanged(enum class EBattleRoyaleState PrevState, enum class EBattleRoyaleState CurrentState); // Function BravoHotelGame.BravoHotelCharacter.OnBattleRoyalStateChanged // (Final|Native|Public) // @ game+0x22a58f0
	void OnAnyUpdateState(struct UStateMachineComponent* Context, struct FName WithStateName, char WithStateID, float WithStateTime); // Function BravoHotelGame.BravoHotelCharacter.OnAnyUpdateState // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x22a5790
	void OnAnyExitState(struct UStateMachineComponent* Context, struct FName WithStateName, char WithStateID); // Function BravoHotelGame.BravoHotelCharacter.OnAnyExitState // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x22a5670
	void OnAnyBeginState(struct UStateMachineComponent* Context, struct FName WithStateName, char WithStateID, char WithPrevious); // Function BravoHotelGame.BravoHotelCharacter.OnAnyBeginState // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x22a5510
	void OnAnimInitialized(); // Function BravoHotelGame.BravoHotelCharacter.OnAnimInitialized // (Final|Native|Protected) // @ game+0x22a54f0
	void OnAirCraftDelegate__DelegateSignature(bool State); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnAirCraftDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	void OnActivatedDoor(struct ABravoHotelDoor* InDoor); // Function BravoHotelGame.BravoHotelCharacter.OnActivatedDoor // (Final|Native|Public) // @ game+0x22a5470
	void NextParkourTestComponent(); // Function BravoHotelGame.BravoHotelCharacter.NextParkourTestComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x174cbb0
	void NextChangeCQRKey(); // Function BravoHotelGame.BravoHotelCharacter.NextChangeCQRKey // (Final|Native|Public|BlueprintCallable) // @ game+0x22a5450
	void NeedCheckCurrentBuff(); // Function BravoHotelGame.BravoHotelCharacter.NeedCheckCurrentBuff // (Final|Native|Public) // @ game+0x22a5430
	void MultiSpawnVehicle(struct ABravoHotelVehicle* TargetVehicle, struct UObject* TargetClass, struct FTransform SpawnTransform, struct FTransform PrevTransform); // Function BravoHotelGame.BravoHotelCharacter.MultiSpawnVehicle // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // @ game+0x22a3d50
	void MulticastWindowBreaching(); // Function BravoHotelGame.BravoHotelCharacter.MulticastWindowBreaching // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x22a5410
	void MulticastUpdateRagdollVariables(struct FVector NewRagdollVelocity, struct FVector NewRagdollLocation, struct FVector NewActorLocation); // Function BravoHotelGame.BravoHotelCharacter.MulticastUpdateRagdollVariables // (Net|Native|Event|NetMulticast|Protected|HasDefaults|NetValidate) // @ game+0x22a5280
	void MulticastTakePointDamage(struct FRepPointDamageInfo DamageInfo); // Function BravoHotelGame.BravoHotelCharacter.MulticastTakePointDamage // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x22a5190
	void MulticastStopMontage(struct UAnimMontage* AnimMontage, float BlendTime); // Function BravoHotelGame.BravoHotelCharacter.MulticastStopMontage // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x22a50c0
	void MulticastSimulatedTakeDamage(struct FRepSimulatedTakeDamageInfo RepSimulatedInfo); // Function BravoHotelGame.BravoHotelCharacter.MulticastSimulatedTakeDamage // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x22a4ff0
	void MulticastSimulatedHittedDamage(struct FRepSimulatedHittedDamage RepSimulatedInfo); // Function BravoHotelGame.BravoHotelCharacter.MulticastSimulatedHittedDamage // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x22a4ef0
	void MulticastSetInteractiveShpere(bool bActive); // Function BravoHotelGame.BravoHotelCharacter.MulticastSetInteractiveShpere // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x22a4e60
	void MulticastRewindMontage(struct UAnimMontage* AnimMontage); // Function BravoHotelGame.BravoHotelCharacter.MulticastRewindMontage // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x22a4dd0
	void MulticastRemoveAttachedUsableItem(); // Function BravoHotelGame.BravoHotelCharacter.MulticastRemoveAttachedUsableItem // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x22a4db0
	void MulticastPlayMontage(bool bPlayOnLocalClient, struct UAnimMontage* AnimMontageTPP, struct UAnimMontage* AnimMontageFPP); // Function BravoHotelGame.BravoHotelCharacter.MulticastPlayMontage // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x22a4ca0
	void MulticastPlayCharacterSound(enum class ECharacterAudioEventType AudioEventType, char TypeIndex); // Function BravoHotelGame.BravoHotelCharacter.MulticastPlayCharacterSound // (Net|Native|Event|NetMulticast|Public) // @ game+0x22a4be0
	void MulticastObjectDestruction(struct ADestructibleActor* DestructibleActor, struct UDestructibleComponent* DestructibleComponent, struct FVector Location, float Damage, float EffectRange); // Function BravoHotelGame.BravoHotelCharacter.MulticastObjectDestruction // (Net|Native|Event|NetMulticast|Public|HasDefaults) // @ game+0x22a4a50
	void MulticastInAircraft(struct AActor* AircraftFlight, float AttachYaw); // Function BravoHotelGame.BravoHotelCharacter.MulticastInAircraft // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x22a4980
	void MulticastHandleDamageToVehicleDestructibleComponent(struct UBravoHotelDestructibleComponent* DestructibleComponent, struct FHitResult HitDetails, struct FVector ImpactVelocity); // Function BravoHotelGame.BravoHotelCharacter.MulticastHandleDamageToVehicleDestructibleComponent // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // @ game+0x22a47d0
	void MulticastExceptOwnerStopAnimMontage(struct UAnimMontage* MontageToStopTPP, struct UAnimMontage* MontageToStopFPP); // Function BravoHotelGame.BravoHotelCharacter.MulticastExceptOwnerStopAnimMontage // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x22a4700
	void MulticastEndCombine(bool bSuccess, struct FName TargetRecipe); // Function BravoHotelGame.BravoHotelCharacter.MulticastEndCombine // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x22a4610
	void MulticastEndCastingBackpackItem(bool bSuccess, struct FName ItemKey, bool bAutoUse); // Function BravoHotelGame.BravoHotelCharacter.MulticastEndCastingBackpackItem // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x22a4500
	void MulticastDoorObjectDestruction(struct AActor* DoorActor, struct FRadialDamageEvent DamageEvent, struct AController* EventInstigator, struct AActor* DamageCauser); // Function BravoHotelGame.BravoHotelCharacter.MulticastDoorObjectDestruction // (Net|Native|Event|NetMulticast|Public) // @ game+0x22a4380
	void MulticastDoorBreaching(struct FVector_NetQuantize BreachingParticleLocation, struct FVector_NetQuantize BreachingParticleRotation); // Function BravoHotelGame.BravoHotelCharacter.MulticastDoorBreaching // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x22a42a0
	void MulticastBravoHotelHIDestructionObejct(struct UBravoHotelHIDestructibleComponent* BravoHotelDestructibleComponent, float Damage, struct FRadialDamageEvent DamageEvent, struct AController* EventInstigator, struct AActor* DamageCauser); // Function BravoHotelGame.BravoHotelCharacter.MulticastBravoHotelHIDestructionObejct // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x22a40e0
	void MulticastBravoHotelDestructionObejct(struct UBravoHotelDestructibleComponent* BravoHotelDestructibleComponent, float Damage, struct FRadialDamageEvent DamageEvent, struct AController* EventInstigator, struct AActor* DamageCauser); // Function BravoHotelGame.BravoHotelCharacter.MulticastBravoHotelDestructionObejct // (Net|Native|Event|NetMulticast|Public) // @ game+0x22a3f20
	void MoveRightOnDescent(float DeltaTime, float AxisValue); // Function BravoHotelGame.BravoHotelCharacter.MoveRightOnDescent // (Final|Native|Public) // @ game+0x22a3c90
	void MoveRight(float AxisValue); // Function BravoHotelGame.BravoHotelCharacter.MoveRight // (Final|Native|Public) // @ game+0x22a3c10
	void MoveForwardOnDescent(float DeltaTime, float AxisValue); // Function BravoHotelGame.BravoHotelCharacter.MoveForwardOnDescent // (Final|Native|Public) // @ game+0x22a3b50
	void MoveForward(float AxisValue); // Function BravoHotelGame.BravoHotelCharacter.MoveForward // (Final|Native|Public) // @ game+0x22a3ad0
	void MarkBrokenEquipmentNeedToSpawn(int32_t Equipmentlevel, struct FVector& DamageImpulseDir, enum class EWearableItemType& EquipmentType); // Function BravoHotelGame.BravoHotelCharacter.MarkBrokenEquipmentNeedToSpawn // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x22a39b0
	void ManageRotation(); // Function BravoHotelGame.BravoHotelCharacter.ManageRotation // (Final|Native|Public) // @ game+0x22a3990
	void ManageMovementMode(); // Function BravoHotelGame.BravoHotelCharacter.ManageMovementMode // (Final|Native|Public) // @ game+0x22a3970
	void ManageDebuffState(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.ManageDebuffState // (Final|Native|Protected) // @ game+0x22a38f0
	void LockMovementInput(); // Function BravoHotelGame.BravoHotelCharacter.LockMovementInput // (Final|Native|Public) // @ game+0x22a38d0
	void LoadMouseSensitivty(); // Function BravoHotelGame.BravoHotelCharacter.LoadMouseSensitivty // (Final|Native|Public|BlueprintCallable) // @ game+0x22a38b0
	void KillPerkLevelUpTimer(float DelayTime, int32_t UpCount, int32_t KillCount); // Function BravoHotelGame.BravoHotelCharacter.KillPerkLevelUpTimer // (Final|Native|Public) // @ game+0x22a37a0
	void KillPerkLevelUpReady(int32_t KillCount); // Function BravoHotelGame.BravoHotelCharacter.KillPerkLevelUpReady // (Final|Native|Public) // @ game+0x22a3720
	void KillPerkLevelUp(int32_t UpCount, int32_t KillCount); // Function BravoHotelGame.BravoHotelCharacter.KillPerkLevelUp // (Final|Native|Public) // @ game+0x22a3660
	void KillGivePerkEvent(int32_t KillCount); // Function BravoHotelGame.BravoHotelCharacter.KillGivePerkEvent // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void K2_UpdateMutable_PreviewPawn(bool bChangeGender); // Function BravoHotelGame.BravoHotelCharacter.K2_UpdateMutable_PreviewPawn // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void K2_OnStartProne(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function BravoHotelGame.BravoHotelCharacter.K2_OnStartProne // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void K2_OnGoParachute(); // Function BravoHotelGame.BravoHotelCharacter.K2_OnGoParachute // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void K2_OnEndProne(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function BravoHotelGame.BravoHotelCharacter.K2_OnEndProne // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void K2_OnCameraViewModeChanged(bool bIsThirdPerson); // Function BravoHotelGame.BravoHotelCharacter.K2_OnCameraViewModeChanged // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void K2_OnAddControllerYawInput(float Val); // Function BravoHotelGame.BravoHotelCharacter.K2_OnAddControllerYawInput // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	struct FPerkLevelUpData K2_GetPerkLevelUpData(); // Function BravoHotelGame.BravoHotelCharacter.K2_GetPerkLevelUpData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a35f0
	struct FPerkDeckData K2_GetPerkDeckData(); // Function BravoHotelGame.BravoHotelCharacter.K2_GetPerkDeckData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a3580
	struct FPerkLevelUpElement K2_GetPerkClassLevelUpElement(int32_t Level); // Function BravoHotelGame.BravoHotelCharacter.K2_GetPerkClassLevelUpElement // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a33b0
	void K2_FPSK_OnStartADS(); // Function BravoHotelGame.BravoHotelCharacter.K2_FPSK_OnStartADS // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void K2_FPSK_OnEndADS(); // Function BravoHotelGame.BravoHotelCharacter.K2_FPSK_OnEndADS // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void K2_EnterSceneOfWin(); // Function BravoHotelGame.BravoHotelCharacter.K2_EnterSceneOfWin // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void K2_Cheat_ToggleCharacterDebugCamera(); // Function BravoHotelGame.BravoHotelCharacter.K2_Cheat_ToggleCharacterDebugCamera // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	bool IsWantsToJetpackAim(); // Function BravoHotelGame.BravoHotelCharacter.IsWantsToJetpackAim // (Final|Native|Public|Const) // @ game+0x22a3380
	bool IsWantsToJetpack(); // Function BravoHotelGame.BravoHotelCharacter.IsWantsToJetpack // (Final|Native|Public|Const) // @ game+0x22a3350
	bool IsViewPointInWaterVolume(); // Function BravoHotelGame.BravoHotelCharacter.IsViewPointInWaterVolume // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a3320
	bool IsVehicleState(enum class ECharacterState State); // Function BravoHotelGame.BravoHotelCharacter.IsVehicleState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a3290
	bool IsVehiclePassenger(); // Function BravoHotelGame.BravoHotelCharacter.IsVehiclePassenger // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a3260
	bool IsVehicleDriver(); // Function BravoHotelGame.BravoHotelCharacter.IsVehicleDriver // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a3230
	bool IsThirdPerson(); // Function BravoHotelGame.BravoHotelCharacter.IsThirdPerson // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a3200
	bool IsSwimming(); // Function BravoHotelGame.BravoHotelCharacter.IsSwimming // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a31d0
	bool IsSteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.IsSteadyAim // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a31a0
	bool IsSprinting(); // Function BravoHotelGame.BravoHotelCharacter.IsSprinting // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a3170
	bool IsShowingLandingPosition(); // Function BravoHotelGame.BravoHotelCharacter.IsShowingLandingPosition // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a3140
	bool IsReviving(); // Function BravoHotelGame.BravoHotelCharacter.IsReviving // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a30c0
	bool IsResuscitating(); // Function BravoHotelGame.BravoHotelCharacter.IsResuscitating // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a3040
	bool IsRecommendedPerkDeck(struct FName& PerkName); // Function BravoHotelGame.BravoHotelCharacter.IsRecommendedPerkDeck // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2f90
	bool IsReadyToSnipe(); // Function BravoHotelGame.BravoHotelCharacter.IsReadyToSnipe // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a2f70
	bool IsProneStateTransitioning(); // Function BravoHotelGame.BravoHotelCharacter.IsProneStateTransitioning // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2f40
	bool IsProne(); // Function BravoHotelGame.BravoHotelCharacter.IsProne // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2f10
	bool IsPlayingPickupAnim(); // Function BravoHotelGame.BravoHotelCharacter.IsPlayingPickupAnim // (Final|Native|Public|Const) // @ game+0x22a2ee0
	bool IsPlayingEquipAnim(); // Function BravoHotelGame.BravoHotelCharacter.IsPlayingEquipAnim // (Final|Native|Public|Const) // @ game+0x22a2eb0
	bool IsPlayingCastingAnim(); // Function BravoHotelGame.BravoHotelCharacter.IsPlayingCastingAnim // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2e80
	bool IsPlayerReplayViewMode(); // Function BravoHotelGame.BravoHotelCharacter.IsPlayerReplayViewMode // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a2e50
	bool IsPendingKickDoor(); // Function BravoHotelGame.BravoHotelCharacter.IsPendingKickDoor // (Final|Native|Public|Const) // @ game+0x22a2e20
	bool IsOverlapWaterVolume(); // Function BravoHotelGame.BravoHotelCharacter.IsOverlapWaterVolume // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2df0
	bool IsOnLadder(); // Function BravoHotelGame.BravoHotelCharacter.IsOnLadder // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2dc0
	bool IsOnIceLand(); // Function BravoHotelGame.BravoHotelCharacter.IsOnIceLand // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2d90
	bool IsOnDescent(); // Function BravoHotelGame.BravoHotelCharacter.IsOnDescent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2d60
	bool IsMeleeJumpAttack(); // Function BravoHotelGame.BravoHotelCharacter.IsMeleeJumpAttack // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2d30
	bool IsMelee(); // Function BravoHotelGame.BravoHotelCharacter.IsMelee // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2d00
	bool IsMaxLevel(); // Function BravoHotelGame.BravoHotelCharacter.IsMaxLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a2cd0
	bool IsMale(); // Function BravoHotelGame.BravoHotelCharacter.IsMale // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2ca0
	bool IsLockedInventory(); // Function BravoHotelGame.BravoHotelCharacter.IsLockedInventory // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2c70
	bool IsLocalPlayerControlledPawn(); // Function BravoHotelGame.BravoHotelCharacter.IsLocalPlayerControlledPawn // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2bb0
	bool IsLocallyPlaying(bool bIncludeSpectedPawn); // Function BravoHotelGame.BravoHotelCharacter.IsLocallyPlaying // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2be0
	bool IsLandStop(); // Function BravoHotelGame.BravoHotelCharacter.IsLandStop // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2b80
	bool IsKicking(); // Function BravoHotelGame.BravoHotelCharacter.IsKicking // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2b50
	bool IsJumping(); // Function BravoHotelGame.BravoHotelCharacter.IsJumping // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2b20
	bool IsJumpAttacking(); // Function BravoHotelGame.BravoHotelCharacter.IsJumpAttacking // (Final|Native|Public|Const) // @ game+0x22a2af0
	bool IsInVehicle(); // Function BravoHotelGame.BravoHotelCharacter.IsInVehicle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2ac0
	bool IsInstancedFoliageActor(struct AActor* TargetActor); // Function BravoHotelGame.BravoHotelCharacter.IsInstancedFoliageActor // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	bool IsInSkydiving(); // Function BravoHotelGame.BravoHotelCharacter.IsInSkydiving // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2a90
	bool IsInParachute(); // Function BravoHotelGame.BravoHotelCharacter.IsInParachute // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2a60
	bool IsInForceField(); // Function BravoHotelGame.BravoHotelCharacter.IsInForceField // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a2a30
	bool IsInDoor(); // Function BravoHotelGame.BravoHotelCharacter.IsInDoor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2a00
	bool IsInAircraft(); // Function BravoHotelGame.BravoHotelCharacter.IsInAircraft // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a29d0
	bool IsHipShot(); // Function BravoHotelGame.BravoHotelCharacter.IsHipShot // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a29a0
	bool IsFoundVehicleSearch(); // Function BravoHotelGame.BravoHotelCharacter.IsFoundVehicleSearch // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a2970
	bool IsFoundSearchInstinct(); // Function BravoHotelGame.BravoHotelCharacter.IsFoundSearchInstinct // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a2940
	bool IsFollowReplayViewMode(); // Function BravoHotelGame.BravoHotelCharacter.IsFollowReplayViewMode // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a2910
	bool IsFirstPerson(); // Function BravoHotelGame.BravoHotelCharacter.IsFirstPerson // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a28e0
	bool IsFiring(); // Function BravoHotelGame.BravoHotelCharacter.IsFiring // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a28b0
	bool IsEnoughtSupplyGold(); // Function BravoHotelGame.BravoHotelCharacter.IsEnoughtSupplyGold // (Final|Native|Public|BlueprintCallable) // @ game+0x22a2880
	bool IsEnemyFor(struct ABravoHotelPlayerController* OtherPlayerController); // Function BravoHotelGame.BravoHotelCharacter.IsEnemyFor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a27f0
	bool IsEnemyCharacter(struct ABravoHotelCharacter* OtherCharacter); // Function BravoHotelGame.BravoHotelCharacter.IsEnemyCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2760
	bool IsEnableSpawnSupplyBox(struct AActor* TargetActor, struct FString& OutResult); // Function BravoHotelGame.BravoHotelCharacter.IsEnableSpawnSupplyBox // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	bool IsDisconnected(); // Function BravoHotelGame.BravoHotelCharacter.IsDisconnected // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2730
	bool IsCustomBuoyancySwimMode(); // Function BravoHotelGame.BravoHotelCharacter.IsCustomBuoyancySwimMode // (Final|Native|Public|Const) // @ game+0x22a2700
	bool IsCurrentThrowingWeapon(); // Function BravoHotelGame.BravoHotelCharacter.IsCurrentThrowingWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a26d0
	bool IsControllerTargetPawn(); // Function BravoHotelGame.BravoHotelCharacter.IsControllerTargetPawn // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a26a0
	bool IsCondition(enum class ECharacterConditionType ConditionType); // Function BravoHotelGame.BravoHotelCharacter.IsCondition // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2610
	bool IsClimbing(); // Function BravoHotelGame.BravoHotelCharacter.IsClimbing // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a25e0
	bool IsChargingGauge(); // Function BravoHotelGame.BravoHotelCharacter.IsChargingGauge // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a25b0
	bool IsCharacterPositionUnderWaterSurface(); // Function BravoHotelGame.BravoHotelCharacter.IsCharacterPositionUnderWaterSurface // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2580
	bool IsChangingWeapon(); // Function BravoHotelGame.BravoHotelCharacter.IsChangingWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2550
	bool IsCastingBackpackItem(); // Function BravoHotelGame.BravoHotelCharacter.IsCastingBackpackItem // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2520
	bool IsBuff(enum class ECharacterBuffType BuffType); // Function BravoHotelGame.BravoHotelCharacter.IsBuff // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2490
	bool IsBeginner(); // Function BravoHotelGame.BravoHotelCharacter.IsBeginner // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2460
	bool IsAppearanceReplicated(); // Function BravoHotelGame.BravoHotelCharacter.IsAppearanceReplicated // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2430
	bool IsAOS(); // Function BravoHotelGame.BravoHotelCharacter.IsAOS // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a21e0
	bool IsAlive(); // Function BravoHotelGame.BravoHotelCharacter.IsAlive // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2400
	bool IsAirWalking(); // Function BravoHotelGame.BravoHotelCharacter.IsAirWalking // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a23d0
	bool IsADS(); // Function BravoHotelGame.BravoHotelCharacter.IsADS // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a21b0
	bool IsActiveLeanDamageBuff(); // Function BravoHotelGame.BravoHotelCharacter.IsActiveLeanDamageBuff // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a23a0
	bool IsActiveHeartBeatSensor(); // Function BravoHotelGame.BravoHotelCharacter.IsActiveHeartBeatSensor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2370
	bool IsActiveCastingUIWithType(enum class ECastingUIType& InCastingUIType); // Function BravoHotelGame.BravoHotelCharacter.IsActiveCastingUIWithType // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x22a22d0
	bool IsActiveCastingUI(); // Function BravoHotelGame.BravoHotelCharacter.IsActiveCastingUI // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a22a0
	bool IsActiveAmplifier(); // Function BravoHotelGame.BravoHotelCharacter.IsActiveAmplifier // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2270
	bool IsActionWithWeapon(); // Function BravoHotelGame.BravoHotelCharacter.IsActionWithWeapon // (Final|Native|Public|BlueprintCallable) // @ game+0x22a2240
	bool IsABot(); // Function BravoHotelGame.BravoHotelCharacter.IsABot // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2180
	bool IsAbleUltimate(); // Function BravoHotelGame.BravoHotelCharacter.IsAbleUltimate // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a2210
	void InternalSimulatedTakeDamage(struct FRepSimulatedTakeDamageInfo& RepSimulatedInfo); // Function BravoHotelGame.BravoHotelCharacter.InternalSimulatedTakeDamage // (Final|Native|Public|HasOutParms) // @ game+0x22a20a0
	void InternalSimulatedHittedDamage(struct FRepHitDamageInfo& RepDamageInfo); // Function BravoHotelGame.BravoHotelCharacter.InternalSimulatedHittedDamage // (Final|Native|Private|HasOutParms) // @ game+0x22a1fa0
	void InternalJetpackBooster(bool bNewJackpack); // Function BravoHotelGame.BravoHotelCharacter.InternalJetpackBooster // (Final|Native|Public) // @ game+0x22a1f10
	void InternalJetpackAim(bool bNewJetpackAim); // Function BravoHotelGame.BravoHotelCharacter.InternalJetpackAim // (Final|Native|Public) // @ game+0x22a1e80
	void InternalInAircraft(struct AActor* AircraftFlight, float AttachYaw, bool bCheckCinematic); // Function BravoHotelGame.BravoHotelCharacter.InternalInAircraft // (Final|Native|Public) // @ game+0x22a1d70
	void InitTimeline(); // Function BravoHotelGame.BravoHotelCharacter.InitTimeline // (Final|Native|Public) // @ game+0x22a1d30
	void InitRecordingCharacter(bool bForce); // Function BravoHotelGame.BravoHotelCharacter.InitRecordingCharacter // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void InitializeStateAtCriticalTime(); // Function BravoHotelGame.BravoHotelCharacter.InitializeStateAtCriticalTime // (Final|Native|Public) // @ game+0x22a1d50
	void InitCustomizableObjectInstance(); // Function BravoHotelGame.BravoHotelCharacter.InitCustomizableObjectInstance // (Native|Event|Public|BlueprintEvent) // @ game+0x22a1d10
	void HideSkillMap(); // Function BravoHotelGame.BravoHotelCharacter.HideSkillMap // (Final|Native|Public) // @ game+0x22a1cf0
	void HideModeChange(); // Function BravoHotelGame.BravoHotelCharacter.HideModeChange // (Final|Native|Public|BlueprintCallable) // @ game+0x22986d0
	void HideInteractive(); // Function BravoHotelGame.BravoHotelCharacter.HideInteractive // (Final|Native|Public|BlueprintCallable) // @ game+0x22a1cd0
	void HideHUDbySequence(); // Function BravoHotelGame.BravoHotelCharacter.HideHUDbySequence // (Final|Native|Public|BlueprintCallable) // @ game+0x22a1cb0
	void HideGuideWidget(enum class EGuideWidgetType GuideType); // Function BravoHotelGame.BravoHotelCharacter.HideGuideWidget // (Final|Native|Public) // @ game+0x22a1c30
	void HealthTick(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.HealthTick // (Final|Native|Public) // @ game+0x22a1bb0
	bool HasWeaponOfType(enum class EWeaponType WeaponType); // Function BravoHotelGame.BravoHotelCharacter.HasWeaponOfType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a1b20
	void HandleDamageToVehicleDestructibleComponent(struct UBravoHotelDestructibleComponent* DestructibleComponent, struct FHitResult HitDetails, struct FVector ImpactVelocity); // Function BravoHotelGame.BravoHotelCharacter.HandleDamageToVehicleDestructibleComponent // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x22a1980
	void GoParachute(); // Function BravoHotelGame.BravoHotelCharacter.GoParachute // (Final|Native|Public) // @ game+0x22a1960
	void GoIncapacitated(bool bCriticalTime, struct FDamageInstigatorInfo& DamageInstigatorInfo); // Function BravoHotelGame.BravoHotelCharacter.GoIncapacitated // (Final|Native|Public|HasOutParms) // @ game+0x22a1810
	void GoForceParachute(); // Function BravoHotelGame.BravoHotelCharacter.GoForceParachute // (Final|Native|Public) // @ game+0x22a17f0
	void GiveEquipment(); // Function BravoHotelGame.BravoHotelCharacter.GiveEquipment // (Final|Native|Public|BlueprintCallable) // @ game+0x22a17d0
	int32_t GetZeroPointDistance(); // Function BravoHotelGame.BravoHotelCharacter.GetZeroPointDistance // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a17a0
	int32_t GetWearableRarity(enum class EWearableItemType WearableItemType); // Function BravoHotelGame.BravoHotelCharacter.GetWearableRarity // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a1710
	struct FString GetWearableItemName(enum class EWearableItemType SlotType); // Function BravoHotelGame.BravoHotelCharacter.GetWearableItemName // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a1660
	struct FName GetWeaponSocketNameBySlot(int32_t SlotIndex); // Function BravoHotelGame.BravoHotelCharacter.GetWeaponSocketNameBySlot // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a15c0
	enum class EWaterDepthType GetWaterDepthType(); // Function BravoHotelGame.BravoHotelCharacter.GetWaterDepthType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a15a0
	float GetViewPitch(); // Function BravoHotelGame.BravoHotelCharacter.GetViewPitch // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a1570
	struct ABravoHotelLadder* GetUsingLadder(); // Function BravoHotelGame.BravoHotelCharacter.GetUsingLadder // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a1540
	int32_t GetUsingBackpackItemIndex(); // Function BravoHotelGame.BravoHotelCharacter.GetUsingBackpackItemIndex // (Final|Native|Public|Const) // @ game+0x22a1520
	int32_t GetUniquePlayerId(); // Function BravoHotelGame.BravoHotelCharacter.GetUniquePlayerId // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a14f0
	enum class EGrenadeThrowingType GetThrowingType(); // Function BravoHotelGame.BravoHotelCharacter.GetThrowingType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a14c0
	struct UAnimMontage* GetThrowingGrenade(enum class EGrenadeThrowingType Type); // Function BravoHotelGame.BravoHotelCharacter.GetThrowingGrenade // (Final|Native|Public|Const) // @ game+0x22a1430
	float GetTeamPositionWidgetHeight(bool FromBottom); // Function BravoHotelGame.BravoHotelCharacter.GetTeamPositionWidgetHeight // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a1390
	struct UUserWidget* GetTeamPositionWidget(); // Function BravoHotelGame.BravoHotelCharacter.GetTeamPositionWidget // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a1360
	bool GetTargetHealthAfterHealing(float& OutTargetHealth); // Function BravoHotelGame.BravoHotelCharacter.GetTargetHealthAfterHealing // (Final|Native|Public|HasOutParms) // @ game+0x22a12b0
	float GetTargetHealth(); // Function BravoHotelGame.BravoHotelCharacter.GetTargetHealth // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a1280
	float GetSurfaceDegrees(); // Function BravoHotelGame.BravoHotelCharacter.GetSurfaceDegrees // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a1250
	float GetStateTime(); // Function BravoHotelGame.BravoHotelCharacter.GetStateTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a1220
	enum class ECharacterState GetState(); // Function BravoHotelGame.BravoHotelCharacter.GetState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a11f0
	struct UBravoHotelSmartPingSystem* GetSmartPingSystem(); // Function BravoHotelGame.BravoHotelCharacter.GetSmartPingSystem // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	struct APlayerState* GetSavedPlayerState(); // Function BravoHotelGame.BravoHotelCharacter.GetSavedPlayerState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a11c0
	struct TArray<struct ACharacter*> GetRevivers(); // Function BravoHotelGame.BravoHotelCharacter.GetRevivers // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a1190
	struct TArray<struct ACharacter*> GetResuscitaters(); // Function BravoHotelGame.BravoHotelCharacter.GetResuscitaters // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a1160
	float GetRecipeLockTime(char RecipeItemRarity); // Function BravoHotelGame.BravoHotelCharacter.GetRecipeLockTime // (Final|Native|Public|BlueprintCallable) // @ game+0x22a10d0
	float GetReadyToSnipeGauge(); // Function BravoHotelGame.BravoHotelCharacter.GetReadyToSnipeGauge // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a10b0
	enum class ECharacterState GetPreviousState(); // Function BravoHotelGame.BravoHotelCharacter.GetPreviousState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a1080
	struct ABravoHotel3DViewActor* GetPreviewPawn(); // Function BravoHotelGame.BravoHotelCharacter.GetPreviewPawn // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a1060
	struct TScriptInterface<IMaterialControllableInterface> GetPostProcessMagneticHit(); // Function BravoHotelGame.BravoHotelCharacter.GetPostProcessMagneticHit // (Final|Native|Public) // @ game+0x22a1020
	struct TScriptInterface<IMaterialControllableInterface> GetPostProcessMagneticDamage(); // Function BravoHotelGame.BravoHotelCharacter.GetPostProcessMagneticDamage // (Final|Native|Public) // @ game+0x22a0fe0
	struct TScriptInterface<IMaterialControllableInterface> GetPostProcessHit(); // Function BravoHotelGame.BravoHotelCharacter.GetPostProcessHit // (Final|Native|Public) // @ game+0x22a0fa0
	struct TScriptInterface<IMaterialControllableInterface> GetPostProcessDust(); // Function BravoHotelGame.BravoHotelCharacter.GetPostProcessDust // (Final|Native|Public) // @ game+0x22a0f60
	struct TScriptInterface<IMaterialControllableInterface> GetPostProcessBlood(); // Function BravoHotelGame.BravoHotelCharacter.GetPostProcessBlood // (Final|Native|Public) // @ game+0x22a0f20
	struct FString GetPlayerName(bool bCheckOption); // Function BravoHotelGame.BravoHotelCharacter.GetPlayerName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a0e40
	struct FAnimSlot GetPickupAnimSlot(); // Function BravoHotelGame.BravoHotelCharacter.GetPickupAnimSlot // (Final|Native|Public|Const) // @ game+0x22a0e10
	void GetPerkOnStart(); // Function BravoHotelGame.BravoHotelCharacter.GetPerkOnStart // (Final|Native|Public) // @ game+0x22a0df0
	struct FName GetPerkNameByBuffName(struct FName BuffName); // Function BravoHotelGame.BravoHotelCharacter.GetPerkNameByBuffName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a0d30
	int32_t GetPerkMaxLevelCount(char Slots); // Function BravoHotelGame.BravoHotelCharacter.GetPerkMaxLevelCount // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a0ca0
	int32_t GetPerkIDByBuffName(struct FName BuffName); // Function BravoHotelGame.BravoHotelCharacter.GetPerkIDByBuffName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a0bf0
	enum class ESuperPeopleClass_DEPRECATED GetPerkDeckClassEnum(); // Function BravoHotelGame.BravoHotelCharacter.GetPerkDeckClassEnum // (Final|Native|Public|Const) // @ game+0x22a0bc0
	int32_t GetPerkClassLevel(); // Function BravoHotelGame.BravoHotelCharacter.GetPerkClassLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a0b90
	struct ABravoHotelWeaponBase* GetPendingWeapon(); // Function BravoHotelGame.BravoHotelCharacter.GetPendingWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a0b60
	int32_t GetParkourTestIndexKey(); // Function BravoHotelGame.BravoHotelCharacter.GetParkourTestIndexKey // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17391b0
	struct ABravoHotelWaterPhysicsVolume* GetOverlapWaterVolume(); // Function BravoHotelGame.BravoHotelCharacter.GetOverlapWaterVolume // (Final|Native|Public|BlueprintCallable) // @ game+0x22a0b40
	float GetOverHeal(); // Function BravoHotelGame.BravoHotelCharacter.GetOverHeal // (Final|Native|Public|Const) // @ game+0x22a0b10
	struct UBravoHotelVehicleSeatComponent* GetOccupyingVehicleSeat(); // Function BravoHotelGame.BravoHotelCharacter.GetOccupyingVehicleSeat // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a0ae0
	struct ABravoHotelVehicle* GetOccupyingVehicle(); // Function BravoHotelGame.BravoHotelCharacter.GetOccupyingVehicle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a0ab0
	int32_t GetNextUltimateUnlockLevel(int32_t UltimateLevel); // Function BravoHotelGame.BravoHotelCharacter.GetNextUltimateUnlockLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a0a20
	struct UCustomizableObjectInstance* GetMutableObjectInstance(); // Function BravoHotelGame.BravoHotelCharacter.GetMutableObjectInstance // (Final|Native|Public|Const) // @ game+0x22a09f0
	struct UCustomizableObjectInstance* GetMutableCloneInstance(); // Function BravoHotelGame.BravoHotelCharacter.GetMutableCloneInstance // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a09c0
	float GetMeleeAttackDamage(); // Function BravoHotelGame.BravoHotelCharacter.GetMeleeAttackDamage // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a0990
	float GetMaxLeanValue(); // Function BravoHotelGame.BravoHotelCharacter.GetMaxLeanValue // (Final|Native|Public) // @ game+0x22a0960
	int32_t GetMaxHealth(bool bIncludeKnockout); // Function BravoHotelGame.BravoHotelCharacter.GetMaxHealth // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a08d0
	int32_t GetLimitRecipeCount(); // Function BravoHotelGame.BravoHotelCharacter.GetLimitRecipeCount // (Final|Native|Public|BlueprintCallable) // @ game+0x22a0870
	int32_t GetLimiteGoldAmount(); // Function BravoHotelGame.BravoHotelCharacter.GetLimiteGoldAmount // (Final|Native|Public|BlueprintCallable) // @ game+0x22a08a0
	enum class ELeanState GetLeanState(); // Function BravoHotelGame.BravoHotelCharacter.GetLeanState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a0840
	float GetLeanRotationAngle(); // Function BravoHotelGame.BravoHotelCharacter.GetLeanRotationAngle // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a0810
	float GetLeanDegreeMax(); // Function BravoHotelGame.BravoHotelCharacter.GetLeanDegreeMax // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a07e0
	float GetLandingTimeRate(float LandingDuration); // Function BravoHotelGame.BravoHotelCharacter.GetLandingTimeRate // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22a0750
	float GetLandingPositionDuration(); // Function BravoHotelGame.BravoHotelCharacter.GetLandingPositionDuration // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a0730
	struct FVector GetLandingPosition(); // Function BravoHotelGame.BravoHotelCharacter.GetLandingPosition // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x22a0700
	struct ULadderComponent* GetLadderComponent(); // Function BravoHotelGame.BravoHotelCharacter.GetLadderComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a06e0
	float GetJetpackFuel(); // Function BravoHotelGame.BravoHotelCharacter.GetJetpackFuel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a06b0
	bool GetIsFiringUI(); // Function BravoHotelGame.BravoHotelCharacter.GetIsFiringUI // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a0690
	float GetIsFiredRemaining(); // Function BravoHotelGame.BravoHotelCharacter.GetIsFiredRemaining // (Final|Native|Public|Const) // @ game+0x22a0660
	struct ABravoHotelInventoryCharacter* GetInventoryCharacter(); // Function BravoHotelGame.BravoHotelCharacter.GetInventoryCharacter // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x22a0630
	int32_t GetIconIndex(); // Function BravoHotelGame.BravoHotelCharacter.GetIconIndex // (Final|Native|Public|BlueprintCallable) // @ game+0x22a0600
	float GetHeartBeatSensorLength(); // Function BravoHotelGame.BravoHotelCharacter.GetHeartBeatSensorLength // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a05d0
	float GetGoldenTimePercent(); // Function BravoHotelGame.BravoHotelCharacter.GetGoldenTimePercent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a05a0
	struct FVector GetFloorLocation(); // Function BravoHotelGame.BravoHotelCharacter.GetFloorLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a0560
	struct FRotator GetFixedBaseAimRotation(); // Function BravoHotelGame.BravoHotelCharacter.GetFixedBaseAimRotation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a0530
	enum class EFireType GetFireType(); // Function BravoHotelGame.BravoHotelCharacter.GetFireType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a0500
	float GetFindLandingPositionRadius(); // Function BravoHotelGame.BravoHotelCharacter.GetFindLandingPositionRadius // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a04d0
	struct FVector GetEyeLocation(); // Function BravoHotelGame.BravoHotelCharacter.GetEyeLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a0490
	struct FVector GetEyeForwardVector(); // Function BravoHotelGame.BravoHotelCharacter.GetEyeForwardVector // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a0450
	struct ABravoHotelWeaponBase* GetEquippedThrowingWeapon(); // Function BravoHotelGame.BravoHotelCharacter.GetEquippedThrowingWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a0420
	struct ABravoHotelWeaponBase* GetEquippedMeleeWeapon(); // Function BravoHotelGame.BravoHotelCharacter.GetEquippedMeleeWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a03f0
	int32_t GetDefeatLevel(); // Function BravoHotelGame.BravoHotelCharacter.GetDefeatLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a03c0
	struct FBravoHotelDefaultBalanceData GetDefaultBalanceData(); // Function BravoHotelGame.BravoHotelCharacter.GetDefaultBalanceData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a02c0
	bool GetDeathAnimMontage(struct UBravoHotelDamageType* DamageTypeClass, bool bLocalHeadShot, struct FAnimSlot& OutAnimSlot, bool& bOutIsForce); // Function BravoHotelGame.BravoHotelCharacter.GetDeathAnimMontage // (Final|Native|Private|HasOutParms) // @ game+0x22a0130
	struct ABravoHotelWeaponBase* GetCurrentWeapon(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a0100
	int32_t GetCurrentUltimateLevel(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentUltimateLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a00d0
	enum class EThrowingWeaponState GetCurrentThrowingWeaponState(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentThrowingWeaponState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a00a0
	int32_t GetCurrentSelfResuscitationPrice(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentSelfResuscitationPrice // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a0070
	int32_t GetCurrentSelfResuscitationFreeTicketcount(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentSelfResuscitationFreeTicketcount // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a0040
	int32_t GetCurrentResuscitationPrice(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentResuscitationPrice // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22a0010
	int32_t GetCurrentResuscitationFreeTicketcount(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentResuscitationFreeTicketcount // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x229ffe0
	int32_t GetCurrentReadyToSnipeGrade(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentReadyToSnipeGrade // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x229ffc0
	struct ABravoHotelRangedWeapon* GetCurrentRangedWeapon(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentRangedWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x229ff90
	struct FPerkDeckSelectInfo GetCurrentPerkDeckSelectInfo(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentPerkDeckSelectInfo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x229fe70
	struct FName GetCurrentPerkDeck(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentPerkDeck // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x229fe30
	struct UParkourComponent* GetCurrentParkourComponent(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentParkourComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x229fe00
	float GetCurrentMovementModeTime(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentMovementModeTime // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x229fdd0
	struct UBravoHotelAudioRoomComponent* GetCurrentAudioRoomComponent(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentAudioRoomComponent // (Final|Native|Public) // @ game+0x229fda0
	struct ABravoHotelWeaponBase* GetCurrentAbilityWeapon(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentAbilityWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x229fd70
	struct ABravoHotelWeaponBase* GetCompareWeaponObjectRef(struct FInventoryItemInfo& ItemInfo); // Function BravoHotelGame.BravoHotelCharacter.GetCompareWeaponObjectRef // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x229fc70
	struct TArray<struct ABravoHotelCharacter*> GetCharactersInBreachingArea(struct FVector& BreachingForward, struct FVector& BreachingRight, struct FVector& BreachingUp, struct FVector& BreachingLoc); // Function BravoHotelGame.BravoHotelCharacter.GetCharactersInBreachingArea // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x229fa80
	struct TArray<struct FName> GetChangeRandomPerkList(); // Function BravoHotelGame.BravoHotelCharacter.GetChangeRandomPerkList // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x229fa00
	struct TArray<struct FName> GetChangeExpertWeaponList(); // Function BravoHotelGame.BravoHotelCharacter.GetChangeExpertWeaponList // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x229f980
	float GetCastingRemainTime(bool bForceUpdate); // Function BravoHotelGame.BravoHotelCharacter.GetCastingRemainTime // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x229f8e0
	float GetCastingPercent(bool bForceUpdate); // Function BravoHotelGame.BravoHotelCharacter.GetCastingPercent // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x229f840
	struct FInventoryItemInfo GetCastingItemInfo(); // Function BravoHotelGame.BravoHotelCharacter.GetCastingItemInfo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x229f800
	struct FCastingInfo GetCastingInfo(); // Function BravoHotelGame.BravoHotelCharacter.GetCastingInfo // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x229f7c0
	struct UCameraComponent* GetCamera3P(); // Function BravoHotelGame.BravoHotelCharacter.GetCamera3P // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x229f790
	struct ABravoHotelPlayerState* GetBravoHotelPlayerState(); // Function BravoHotelGame.BravoHotelCharacter.GetBravoHotelPlayerState // (Final|Native|Public|BlueprintCallable) // @ game+0x229f760
	struct FString GetAudioConditionState(struct FConditionGroup& Group); // Function BravoHotelGame.BravoHotelCharacter.GetAudioConditionState // (BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x229f650
	void GetAttachedUsableItems(struct USkeletalMeshComponent* TargetParent, struct TArray<struct ABravoHotelAttachedUsableItem*>& OutItems); // Function BravoHotelGame.BravoHotelCharacter.GetAttachedUsableItems // (Final|Native|Protected|HasOutParms) // @ game+0x229f560
	void GetArmsOffset(struct FVector& OutOffset); // Function BravoHotelGame.BravoHotelCharacter.GetArmsOffset // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x229f4d0
	struct FString GetAppearanceMutableKey(int32_t AppearanceID, int32_t ColorID); // Function BravoHotelGame.BravoHotelCharacter.GetAppearanceMutableKey // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x229f3f0
	struct UAnimMontage* GetAnimSlotMontage(struct FAnimSlot AnimSlot); // Function BravoHotelGame.BravoHotelCharacter.GetAnimSlotMontage // (Final|Native|Public|Const) // @ game+0x229f350
	struct FAnimSlot GetAnimSlotByProneState(struct FAnimSlot& AnimSlot_Stand, struct FAnimSlot& AnimSlot_Prone); // Function BravoHotelGame.BravoHotelCharacter.GetAnimSlotByProneState // (Final|Native|Public|HasOutParms|Const) // @ game+0x229f240
	float GetAmplifierLength(); // Function BravoHotelGame.BravoHotelCharacter.GetAmplifierLength // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x229f210
	struct TArray<enum class EWeaponType> GetAllowedWeaponType(); // Function BravoHotelGame.BravoHotelCharacter.GetAllowedWeaponType // (Final|Native|Public|Const) // @ game+0x229f190
	struct UAkComponent* GetAkComponent(); // Function BravoHotelGame.BravoHotelCharacter.GetAkComponent // (Final|Native|Public|Const) // @ game+0x229f160
	struct FVector GetAirWalkGravity(); // Function BravoHotelGame.BravoHotelCharacter.GetAirWalkGravity // (Final|Native|Public|HasDefaults) // @ game+0x229f120
	struct FRotator GetAimOffsets(); // Function BravoHotelGame.BravoHotelCharacter.GetAimOffsets // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x229f0e0
	struct FName GetActiveSkillKeyName(int32_t ActiveSkillSlot); // Function BravoHotelGame.BravoHotelCharacter.GetActiveSkillKeyName // (Final|Native|Public|BlueprintCallable) // @ game+0x229f040
	struct USkeletalMeshComponent* GetActiveMesh(); // Function BravoHotelGame.BravoHotelCharacter.GetActiveMesh // (Final|Native|Public|Const) // @ game+0x229f010
	float GetActiveCameraTargetArmLength(); // Function BravoHotelGame.BravoHotelCharacter.GetActiveCameraTargetArmLength // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x229efe0
	float GetActiveCameraSocketDistance(); // Function BravoHotelGame.BravoHotelCharacter.GetActiveCameraSocketDistance // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x229efb0
	struct UCameraComponent* GetActiveCamera(); // Function BravoHotelGame.BravoHotelCharacter.GetActiveCamera // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x229ef80
	float GetAbilityModifier(enum class ECharacterAbilityType AbilityType); // Function BravoHotelGame.BravoHotelCharacter.GetAbilityModifier // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x229eef0
	void FPSK_UpdateWeaponTransform(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.FPSK_UpdateWeaponTransform // (Final|Native|Public) // @ game+0x229eaf0
	void FPSK_UpdateSwayMove(struct FVector Value); // Function BravoHotelGame.BravoHotelCharacter.FPSK_UpdateSwayMove // (Final|Native|Public|HasDefaults) // @ game+0x229ea60
	void FPSK_UpdateSwayIdle(struct FVector Value); // Function BravoHotelGame.BravoHotelCharacter.FPSK_UpdateSwayIdle // (Final|Native|Public|HasDefaults) // @ game+0x229e9d0
	void FPSK_UpdateMaterialParams(); // Function BravoHotelGame.BravoHotelCharacter.FPSK_UpdateMaterialParams // (Final|Native|Public) // @ game+0x229e9b0
	void FPSK_UpdateADSReady(); // Function BravoHotelGame.BravoHotelCharacter.FPSK_UpdateADSReady // (Final|Native|Public) // @ game+0x229e990
	void FPSK_UpdateADSFOV(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.FPSK_UpdateADSFOV // (Final|Native|Public) // @ game+0x229e910
	void FPSK_SetWeaponShadowVisible(bool bVisible); // Function BravoHotelGame.BravoHotelCharacter.FPSK_SetWeaponShadowVisible // (Final|Native|Public) // @ game+0x229e880
	void FPSK_SetADSReady(bool bReady, bool bImmediately); // Function BravoHotelGame.BravoHotelCharacter.FPSK_SetADSReady // (Final|Native|Public) // @ game+0x229e690
	void FPSK_SetADSFOV(float TargetFOV, bool bImmediately); // Function BravoHotelGame.BravoHotelCharacter.FPSK_SetADSFOV // (Final|Native|Public|BlueprintCallable) // @ game+0x229e5c0
	void FPSK_SetActiveMutableClipping(bool bNewActive); // Function BravoHotelGame.BravoHotelCharacter.FPSK_SetActiveMutableClipping // (Final|Native|Public) // @ game+0x229e7f0
	void FPSK_SetActive(bool bNewActive); // Function BravoHotelGame.BravoHotelCharacter.FPSK_SetActive // (Final|Native|Public|BlueprintCallable) // @ game+0x229e760
	void FPSK_ServerSetTargetFovMagnifier(float CurrentMagnifier, float NewMagnifier); // Function BravoHotelGame.BravoHotelCharacter.FPSK_ServerSetTargetFovMagnifier // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x229e4c0
	void FPSK_KeepBoltActionCallbackFunc(); // Function BravoHotelGame.BravoHotelCharacter.FPSK_KeepBoltActionCallbackFunc // (Final|Native|Public) // @ game+0x229e4a0
	struct UCameraComponent* FPSK_GetCamera(); // Function BravoHotelGame.BravoHotelCharacter.FPSK_GetCamera // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x229e470
	void FPSK_DoSetTargetFovMagnifier(float NewMagnifier); // Function BravoHotelGame.BravoHotelCharacter.FPSK_DoSetTargetFovMagnifier // (Final|Native|Public) // @ game+0x229e3f0
	void FPSK_CreateWeaponshadowComponents(); // Function BravoHotelGame.BravoHotelCharacter.FPSK_CreateWeaponshadowComponents // (Final|Native|Public) // @ game+0x229e3d0
	void FPSK_CreateCharacterComponents(); // Function BravoHotelGame.BravoHotelCharacter.FPSK_CreateCharacterComponents // (Final|Native|Public) // @ game+0x229e3b0
	void FPSK_ClientSetTargetFovMagnifier(float NewMagnifier); // Function BravoHotelGame.BravoHotelCharacter.FPSK_ClientSetTargetFovMagnifier // (Net|Native|Event|Public|NetClient) // @ game+0x229e330
	bool FPSK_CheckIsCollide(struct FTransform& DefaultRelativeWeaponTransform); // Function BravoHotelGame.BravoHotelCharacter.FPSK_CheckIsCollide // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x229e250
	bool FPSK_CanWearItem(enum class EWearableItemType& Slot, struct FString UniqueKey); // Function BravoHotelGame.BravoHotelCharacter.FPSK_CanWearItem // (Final|Native|Public|HasOutParms) // @ game+0x229e150
	bool FPSK_CanSway(); // Function BravoHotelGame.BravoHotelCharacter.FPSK_CanSway // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x229e120
	void FPSK_ActiveADSEffects(bool bActive); // Function BravoHotelGame.BravoHotelCharacter.FPSK_ActiveADSEffects // (Final|Native|Public) // @ game+0x229e090
	void ForceUnProne(); // Function BravoHotelGame.BravoHotelCharacter.ForceUnProne // (Final|Native|Public) // @ game+0x229eed0
	void ForceUnCrouch(); // Function BravoHotelGame.BravoHotelCharacter.ForceUnCrouch // (Final|Native|Public) // @ game+0x229eeb0
	void ForceProne(); // Function BravoHotelGame.BravoHotelCharacter.ForceProne // (Final|Native|Public) // @ game+0x229ee90
	void ForceClearCastingUI(bool bShowActionMessage); // Function BravoHotelGame.BravoHotelCharacter.ForceClearCastingUI // (Final|Native|Public|BlueprintCallable) // @ game+0x229ee00
	void ForceAllUpdateCameraPP(); // Function BravoHotelGame.BravoHotelCharacter.ForceAllUpdateCameraPP // (Final|Native|Public) // @ game+0x229ede0
	struct USkyLightComponent* FindSkyLight(); // Function BravoHotelGame.BravoHotelCharacter.FindSkyLight // (Final|Native|Public) // @ game+0x229edb0
	struct FVector FindLocationPersonalSupplyBox(int32_t MinDistance, int32_t MaxDistance, float Degree); // Function BravoHotelGame.BravoHotelCharacter.FindLocationPersonalSupplyBox // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x229ec90
	struct FVector FindLocation(int32_t MinDistance, int32_t MaxDistance, float Degree); // Function BravoHotelGame.BravoHotelCharacter.FindLocation // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x229eb70
	struct FText ExpertWeaponName(int32_t Index); // Function BravoHotelGame.BravoHotelCharacter.ExpertWeaponName // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x229dfa0
	struct FName ExpertWeaponKey(int32_t Index); // Function BravoHotelGame.BravoHotelCharacter.ExpertWeaponKey // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x229df00
	void ExitWetFog(struct ABravoHotelAreaSkillZone* AreaSkillZone); // Function BravoHotelGame.BravoHotelCharacter.ExitWetFog // (Final|Native|Public) // @ game+0x229de80
	void ExitPowerInterruption(struct ABravoHotelAreaSkillZone* AreaSkillZone); // Function BravoHotelGame.BravoHotelCharacter.ExitPowerInterruption // (Final|Native|Public) // @ game+0x229de00
	void ExitForceField(struct ABravoHotelAreaSkillZone* AreaSkillZone); // Function BravoHotelGame.BravoHotelCharacter.ExitForceField // (Final|Native|Public) // @ game+0x229dd80
	void EnterWetFog(struct ABravoHotelAreaSkillZone* AreaSkillZone); // Function BravoHotelGame.BravoHotelCharacter.EnterWetFog // (Final|Native|Public) // @ game+0x229dd00
	void EnterPowerInterruption(struct ABravoHotelAreaSkillZone* AreaSkillZone); // Function BravoHotelGame.BravoHotelCharacter.EnterPowerInterruption // (Final|Native|Public) // @ game+0x229dc80
	void EnterForceField(struct ABravoHotelAreaSkillZone* AreaSkillZone); // Function BravoHotelGame.BravoHotelCharacter.EnterForceField // (Final|Native|Public) // @ game+0x229dc00
	void EnterCameraInterp(); // Function BravoHotelGame.BravoHotelCharacter.EnterCameraInterp // (Final|Native|Public|BlueprintCallable) // @ game+0x229dbe0
	void EndVehicleSpawn(struct ABravoHotelVehicle* TargetVehicle, struct UObject* TargetClass, struct FTransform SpawnTransform); // Function BravoHotelGame.BravoHotelCharacter.EndVehicleSpawn // (Final|Native|Public|HasDefaults) // @ game+0x229da60
	void EndSpawnSimulationBox(struct FSpawnPerkData& Data, struct FString Msg); // Function BravoHotelGame.BravoHotelCharacter.EndSpawnSimulationBox // (Final|Native|Public|HasOutParms) // @ game+0x229d900
	void EndRevived(struct AActor* ActActor); // Function BravoHotelGame.BravoHotelCharacter.EndRevived // (Final|Native|Public) // @ game+0x229d880
	void EndResuscitated(struct AActor* InActActor, struct FGoldenTimeLogData& InLogData); // Function BravoHotelGame.BravoHotelCharacter.EndResuscitated // (Final|Native|Public|HasOutParms) // @ game+0x229d790
	void EndReplaceFreeLook(); // Function BravoHotelGame.BravoHotelCharacter.EndReplaceFreeLook // (Final|Native|Public) // @ game+0x229d770
	void EndKickDoor(); // Function BravoHotelGame.BravoHotelCharacter.EndKickDoor // (Final|Native|Public) // @ game+0x229d750
	void EndItemSpawnSimulationBox(struct FSpawnPerkData& Data); // Function BravoHotelGame.BravoHotelCharacter.EndItemSpawnSimulationBox // (Final|Native|Public|HasOutParms) // @ game+0x229d650
	void DrawFoliageLayDown(struct UTextureRenderTarget2D* TextureRenderTarget, struct UMaterialInterface* RenderMaterial, float fTextureScale, float fLieDistance, float fCollisionAreaRadius, float fDrawDistance); // Function BravoHotelGame.BravoHotelCharacter.DrawFoliageLayDown // (Final|Native|Public|BlueprintCallable) // @ game+0x229d490
	void DoWindowBreaching(); // Function BravoHotelGame.BravoHotelCharacter.DoWindowBreaching // (Final|Native|Public) // @ game+0x229d470
	void DoWeaponMeleeAttack(); // Function BravoHotelGame.BravoHotelCharacter.DoWeaponMeleeAttack // (Final|Native|Public) // @ game+0x229d450
	void DoWalking(bool bNewWalking); // Function BravoHotelGame.BravoHotelCharacter.DoWalking // (Final|Native|Public|BlueprintCallable) // @ game+0x229d3c0
	void DoTryUseBackpackItem(int32_t BackpackItemIndex); // Function BravoHotelGame.BravoHotelCharacter.DoTryUseBackpackItem // (Final|Native|Public|BlueprintCallable) // @ game+0x229d340
	void DoTryExitVehicle(bool bForceExit); // Function BravoHotelGame.BravoHotelCharacter.DoTryExitVehicle // (Final|Native|Public|BlueprintCallable) // @ game+0x229d2b0
	void DoTryEnterVehicle(struct UBravoHotelVehicleSeatComponent* TargetVehicleSeat, bool bRetryToVacantSeat); // Function BravoHotelGame.BravoHotelCharacter.DoTryEnterVehicle // (Final|Native|Public|BlueprintCallable) // @ game+0x229d1e0
	void DoToggleCamera(); // Function BravoHotelGame.BravoHotelCharacter.DoToggleCamera // (Final|Native|Public|BlueprintCallable) // @ game+0x229d1c0
	void DoThrowWeaponReady(); // Function BravoHotelGame.BravoHotelCharacter.DoThrowWeaponReady // (Final|Native|Public) // @ game+0x229d1a0
	void DoTeleport(); // Function BravoHotelGame.BravoHotelCharacter.DoTeleport // (Final|Native|Public|BlueprintCallable) // @ game+0x229d180
	void DoStopSliding(); // Function BravoHotelGame.BravoHotelCharacter.DoStopSliding // (Final|Native|Public) // @ game+0x229d160
	void DoStopRevive(); // Function BravoHotelGame.BravoHotelCharacter.DoStopRevive // (Final|Native|Public) // @ game+0x229d140
	void DoStopResuscitation(); // Function BravoHotelGame.BravoHotelCharacter.DoStopResuscitation // (Final|Native|Public) // @ game+0x229d120
	void DoStopMontage(struct UAnimMontage* AnimMontage, float BlendTime); // Function BravoHotelGame.BravoHotelCharacter.DoStopMontage // (Final|Native|Public|BlueprintCallable) // @ game+0x229d050
	void DoStopInteraction(); // Function BravoHotelGame.BravoHotelCharacter.DoStopInteraction // (Final|Native|Public|BlueprintCallable) // @ game+0x229d030
	void DoStopCastingAction(); // Function BravoHotelGame.BravoHotelCharacter.DoStopCastingAction // (Final|Native|Public|BlueprintCallable) // @ game+0x229d010
	void DoStopAllActions(bool bStopAllMontages); // Function BravoHotelGame.BravoHotelCharacter.DoStopAllActions // (Final|Native|Public|BlueprintCallable) // @ game+0x229cf80
	void DoStartUltimate_Recon(float InitialImpulseStrength); // Function BravoHotelGame.BravoHotelCharacter.DoStartUltimate_Recon // (Final|Native|Public) // @ game+0x229cf00
	void DoStartStuntman(); // Function BravoHotelGame.BravoHotelCharacter.DoStartStuntman // (Final|Native|Protected) // @ game+0x229cee0
	void DoStartSliding(); // Function BravoHotelGame.BravoHotelCharacter.DoStartSliding // (Final|Native|Public) // @ game+0x229cec0
	void DoStartRolling(float InitialImpulseStrength); // Function BravoHotelGame.BravoHotelCharacter.DoStartRolling // (Final|Native|Public) // @ game+0x229ce40
	void DoStartRevive(); // Function BravoHotelGame.BravoHotelCharacter.DoStartRevive // (Final|Native|Public) // @ game+0x229ce20
	void DoStartResuscitation(); // Function BravoHotelGame.BravoHotelCharacter.DoStartResuscitation // (Final|Native|Public) // @ game+0x229ce00
	void DoStartKickDoor(bool bFromReplication); // Function BravoHotelGame.BravoHotelCharacter.DoStartKickDoor // (Final|Native|Public) // @ game+0x229cd70
	void DoStartInteraction(); // Function BravoHotelGame.BravoHotelCharacter.DoStartInteraction // (Final|Native|Public|BlueprintCallable) // @ game+0x229cd50
	void DoSprinting(bool bNewSprinting); // Function BravoHotelGame.BravoHotelCharacter.DoSprinting // (Final|Native|Public|BlueprintCallable) // @ game+0x229ccc0
	void DoSpawnBlackOut(); // Function BravoHotelGame.BravoHotelCharacter.DoSpawnBlackOut // (Final|Native|Public) // @ game+0x229cca0
	void DoSetIsParachuteLanding(float DeltaTime, bool Flag, float Height); // Function BravoHotelGame.BravoHotelCharacter.DoSetIsParachuteLanding // (Final|Native|Protected) // @ game+0x229cb90
	void DoSetActorRotation(struct FRotator& NewRotation); // Function BravoHotelGame.BravoHotelCharacter.DoSetActorRotation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x229cb00
	void DoResetPerkInfo(); // Function BravoHotelGame.BravoHotelCharacter.DoResetPerkInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x229cae0
	void DoReselectPerkDeck(); // Function BravoHotelGame.BravoHotelCharacter.DoReselectPerkDeck // (Final|Native|Public|BlueprintCallable) // @ game+0x229cac0
	void DoReloadImmediately(); // Function BravoHotelGame.BravoHotelCharacter.DoReloadImmediately // (Final|Native|Public|BlueprintCallable) // @ game+0x229caa0
	void DoReload(); // Function BravoHotelGame.BravoHotelCharacter.DoReload // (Final|Native|Public|BlueprintCallable) // @ game+0x229ca80
	void DoPunchAttack(); // Function BravoHotelGame.BravoHotelCharacter.DoPunchAttack // (Final|Native|Public) // @ game+0x229ca60
	void DoProne(bool bNewProne); // Function BravoHotelGame.BravoHotelCharacter.DoProne // (Final|Native|Public|BlueprintCallable) // @ game+0x229c9d0
	void DoPlayAnimSlot(struct FAnimSlot& AnimSlot, char AnimMelee); // Function BravoHotelGame.BravoHotelCharacter.DoPlayAnimSlot // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x229c8f0
	void DoPickUpWeapon(int32_t& WeaponSlotIndex, struct ABravoHotelPickup* PickableItem); // Function BravoHotelGame.BravoHotelCharacter.DoPickUpWeapon // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x229c820
	void DoPickUpQuantity(struct ABravoHotelPickup* PickableItem, int32_t GainQuantity); // Function BravoHotelGame.BravoHotelCharacter.DoPickUpQuantity // (Final|Native|Public|BlueprintCallable) // @ game+0x229c760
	void DoPickUpInBox(struct ABravoHotelDropBoxActor* DropBoxActor, struct FInventoryItemInfo& GainItemInfo, int32_t GainQuantity, int32_t WeaponSlotIndex); // Function BravoHotelGame.BravoHotelCharacter.DoPickUpInBox // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x229c590
	void DoPickUp(struct ABravoHotelPickup* PickableItem); // Function BravoHotelGame.BravoHotelCharacter.DoPickUp // (Final|Native|Public|BlueprintCallable) // @ game+0x229c510
	void DoNuclear(); // Function BravoHotelGame.BravoHotelCharacter.DoNuclear // (Final|Native|Public|BlueprintCallable) // @ game+0x229c4f0
	void DoMoveUp(float AxisValue); // Function BravoHotelGame.BravoHotelCharacter.DoMoveUp // (Final|Native|Public|BlueprintCallable) // @ game+0x229c470
	void DoMoveRight(float AxisValue); // Function BravoHotelGame.BravoHotelCharacter.DoMoveRight // (Final|Native|Public|BlueprintCallable) // @ game+0x229c3f0
	void DoMoveItem(struct AActor* SourceActor, enum class ItemWidgetDragType SourceSlotType, struct FInventoryItemInfo& SourceItemInfo, struct AActor* TargetActor, enum class ItemWidgetDragType TargetSlotType, int32_t TargetIndex, int32_t GainQuantity); // Function BravoHotelGame.BravoHotelCharacter.DoMoveItem // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x229c180
	void DoMoveForward(float AxisValue); // Function BravoHotelGame.BravoHotelCharacter.DoMoveForward // (Final|Native|Public|BlueprintCallable) // @ game+0x229c100
	void DoJumpEx(bool bNewJumping); // Function BravoHotelGame.BravoHotelCharacter.DoJumpEx // (Final|Native|Public|BlueprintCallable) // @ game+0x229c070
	void DoJetpackBooster(bool bNewJackpack); // Function BravoHotelGame.BravoHotelCharacter.DoJetpackBooster // (Final|Native|Public) // @ game+0x229bfe0
	void DoJetpackAim(bool bNewJetpackAim); // Function BravoHotelGame.BravoHotelCharacter.DoJetpackAim // (Final|Native|Public) // @ game+0x229bf50
	void DoInAircraft(struct AActor* AircraftFlight, float AttachYaw); // Function BravoHotelGame.BravoHotelCharacter.DoInAircraft // (Final|Native|Public) // @ game+0x229be80
	void DoFiring(bool bIsNewFire); // Function BravoHotelGame.BravoHotelCharacter.DoFiring // (Final|Native|Public|BlueprintCallable) // @ game+0x229bdf0
	void DoFireMode(); // Function BravoHotelGame.BravoHotelCharacter.DoFireMode // (Final|Native|Public|BlueprintCallable) // @ game+0x229bdd0
	void DoExitLadder(); // Function BravoHotelGame.BravoHotelCharacter.DoExitLadder // (Final|Native|Public) // @ game+0x229bdb0
	void DoEquipPerkByID(enum class EPerkSlotFlag Slot, int32_t ID, int32_t Level); // Function BravoHotelGame.BravoHotelCharacter.DoEquipPerkByID // (Final|Native|Public|BlueprintCallable) // @ game+0x229bcb0
	void DoEquipPerk(enum class EPerkSlotFlag Slot, struct FName PerkName, int32_t Level); // Function BravoHotelGame.BravoHotelCharacter.DoEquipPerk // (Final|Native|Public|BlueprintCallable) // @ game+0x229bb90
	void DoEndSteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.DoEndSteadyAim // (Final|Native|Public|BlueprintCallable) // @ game+0x229bb70
	void DoEndRevive(); // Function BravoHotelGame.BravoHotelCharacter.DoEndRevive // (Final|Native|Public) // @ game+0x229bb50
	void DoEndResuscitation(); // Function BravoHotelGame.BravoHotelCharacter.DoEndResuscitation // (Final|Native|Public) // @ game+0x229bb30
	void DoDoorBreaching(); // Function BravoHotelGame.BravoHotelCharacter.DoDoorBreaching // (Final|Native|Public) // @ game+0x229bb10
	void DoDisArm(bool bPlayUnequipAnimation, bool bSaveLastSlotIndex); // Function BravoHotelGame.BravoHotelCharacter.DoDisArm // (Final|Native|Public|BlueprintCallable) // @ game+0x229ba40
	void DoCrouch(bool bNewCrouch); // Function BravoHotelGame.BravoHotelCharacter.DoCrouch // (Final|Native|Public|BlueprintCallable) // @ game+0x229b9b0
	void DoCookThrowingWeapon(); // Function BravoHotelGame.BravoHotelCharacter.DoCookThrowingWeapon // (Final|Native|Public|BlueprintCallable) // @ game+0x229b990
	void DoChoosePerkDeck(int32_t ChooseIndex); // Function BravoHotelGame.BravoHotelCharacter.DoChoosePerkDeck // (Final|Native|Public|BlueprintCallable) // @ game+0x229b910
	void DoChangeWeaponZeroPoint(bool bNext); // Function BravoHotelGame.BravoHotelCharacter.DoChangeWeaponZeroPoint // (Final|Native|Public|BlueprintCallable) // @ game+0x229b880
	void DoChangeWeapon(int32_t NewWeaponSlotIndex, bool bPlayUnequipAnimation, bool bByArmedState); // Function BravoHotelGame.BravoHotelCharacter.DoChangeWeapon // (Final|Native|Public|BlueprintCallable) // @ game+0x229b780
	void DoChangeGender(); // Function BravoHotelGame.BravoHotelCharacter.DoChangeGender // (Final|Native|Public|BlueprintCallable) // @ game+0x229b760
	void DoCancelActiveSkill(); // Function BravoHotelGame.BravoHotelCharacter.DoCancelActiveSkill // (Final|Native|Public|BlueprintCallable) // @ game+0x229b740
	void DoBeginCombine(struct FName& RecipeKey); // Function BravoHotelGame.BravoHotelCharacter.DoBeginCombine // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x229b6a0
	void DoAnalogStickX(float AxisValue); // Function BravoHotelGame.BravoHotelCharacter.DoAnalogStickX // (Final|Native|Public|BlueprintCallable) // @ game+0x229b620
	void DoAirWalk(bool bNewAirWalk); // Function BravoHotelGame.BravoHotelCharacter.DoAirWalk // (Final|Native|Public|BlueprintCallable) // @ game+0x229b590
	void DestructModeChange(); // Function BravoHotelGame.BravoHotelCharacter.DestructModeChange // (Final|Native|Public|BlueprintCallable) // @ game+0x22986d0
	void DestroyProjectileGrenadeActor(struct ABravoHotelProjectileGrenade* Grenade); // Function BravoHotelGame.BravoHotelCharacter.DestroyProjectileGrenadeActor // (Final|Native|Public) // @ game+0x229b510
	void DeactivateADSPostProcess(); // Function BravoHotelGame.BravoHotelCharacter.DeactivateADSPostProcess // (Final|Native|Public) // @ game+0x229b4f0
	bool CollisionCheckBeforeProne(); // Function BravoHotelGame.BravoHotelCharacter.CollisionCheckBeforeProne // (Final|Native|Public) // @ game+0x229b4c0
	void ClinentRemoveNoPlayVoice(struct FName Idx); // Function BravoHotelGame.BravoHotelCharacter.ClinentRemoveNoPlayVoice // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x229b430
	void ClinentAddNoPlayVoice(struct FName Idx); // Function BravoHotelGame.BravoHotelCharacter.ClinentAddNoPlayVoice // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x229b3a0
	void ClientVehicleCollisionLog(bool InbLocalHeadShot, int32_t InHitPointIdx, float InDefenseModifier, float InDamageAmount, struct FDamageEvent InDamageEvent, struct AController* EventInstigator, struct AActor* DamageCauser, struct AActor* Victim); // Function BravoHotelGame.BravoHotelCharacter.ClientVehicleCollisionLog // (Net|NetReliableNative|Event|Public|NetClient|NetValidate) // @ game+0x229b0f0
	void ClientUpdateKillcamInfo(struct ABravoHotelCharacter* OtherCharacter, bool bUpdateTime); // Function BravoHotelGame.BravoHotelCharacter.ClientUpdateKillcamInfo // (Net|NetReliableNative|Event|Public|NetClient|NetValidate) // @ game+0x229aff0
	void ClientStopedRevive(struct AActor* RevivedActor); // Function BravoHotelGame.BravoHotelCharacter.ClientStopedRevive // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x229af60
	void ClientStopedResuscitation(struct AActor* ResuscitatedActor, bool bSuccess); // Function BravoHotelGame.BravoHotelCharacter.ClientStopedResuscitation // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x229ae90
	void ClientStartCastingUI(enum class ECastingUIType CastingUIType, struct FName SourceName, float MaxTime, struct ABravoHotelCharacter* Target); // Function BravoHotelGame.BravoHotelCharacter.ClientStartCastingUI // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x229ad40
	void ClientSpawnPerkNotiMessage(struct FCommonMessageInfo Message); // Function BravoHotelGame.BravoHotelCharacter.ClientSpawnPerkNotiMessage // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x229aca0
	void ClientSimulatedHittedDamage(struct FRepSimulatedHittedDamage RepSimulatedInfo); // Function BravoHotelGame.BravoHotelCharacter.ClientSimulatedHittedDamage // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x229aba0
	void ClientShowInventoryNotEnoughSpaceMessage(); // Function BravoHotelGame.BravoHotelCharacter.ClientShowInventoryNotEnoughSpaceMessage // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x229ab80
	void ClientShowInventoryNotEnoughGoldSpaceMessage(); // Function BravoHotelGame.BravoHotelCharacter.ClientShowInventoryNotEnoughGoldSpaceMessage // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x229ab60
	void ClientShowInvenMaterialSlotNotEnoughSpaceMessage(); // Function BravoHotelGame.BravoHotelCharacter.ClientShowInvenMaterialSlotNotEnoughSpaceMessage // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x229ab40
	void ClientShowActionMessage(int32_t TableIndex, struct FText Message); // Function BravoHotelGame.BravoHotelCharacter.ClientShowActionMessage // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x229aa30
	void ClientSetLeanState(enum class ELeanState NewLeanState); // Function BravoHotelGame.BravoHotelCharacter.ClientSetLeanState // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x229a9b0
	void ClientRewindMontage(struct UAnimMontage* AnimMontage); // Function BravoHotelGame.BravoHotelCharacter.ClientRewindMontage // (Final|Native|Public|BlueprintCallable) // @ game+0x229a930
	void ClientReselectPerkDeckLog(int32_t PerkMode, struct FName PrePerkDeck, struct FName NextPerkDeck, int32_t UseGold, int32_t RemainGold, int32_t UseTicketID, int32_t UseTicket, int32_t RemainTicket, bool bSelectMode); // Function BravoHotelGame.BravoHotelCharacter.ClientReselectPerkDeckLog // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x229a690
	void ClientRequestBuildingItemSpawnStateString(struct FString BuildingItemSpawnLog); // Function BravoHotelGame.BravoHotelCharacter.ClientRequestBuildingItemSpawnStateString // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x229a5e0
	void ClientRequestBuildingItemSpawnList(struct TArray<struct FString> List, bool bStart, bool bEnd, int32_t TotalCnt); // Function BravoHotelGame.BravoHotelCharacter.ClientRequestBuildingItemSpawnList // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x229a440
	void ClientRequestBuildingCount(struct FLogBuildCountData DivisionBuildingCount, struct FLogBuildCountData CurrentBuildingCount); // Function BravoHotelGame.BravoHotelCharacter.ClientRequestBuildingCount // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x229a370
	void ClientReconnectProcess(struct FRepClientCharacterReconnectInfo ReconnectInfo); // Function BravoHotelGame.BravoHotelCharacter.ClientReconnectProcess // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x229a2f0
	void ClientQuickLanding(); // Function BravoHotelGame.BravoHotelCharacter.ClientQuickLanding // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x229a2d0
	void ClientPrepareLanding(enum class ELandingReason InLandingReason); // Function BravoHotelGame.BravoHotelCharacter.ClientPrepareLanding // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x229a250
	void ClientPlayVoice(struct FName Idx); // Function BravoHotelGame.BravoHotelCharacter.ClientPlayVoice // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x229a1c0
	void ClientPlaySequence(struct ALevelSequenceActor* Sequnce, bool bReverse); // Function BravoHotelGame.BravoHotelCharacter.ClientPlaySequence // (Net|Native|Event|Public|NetClient|BlueprintCallable) // @ game+0x229a0f0
	void ClientPickupDefaultTime(float IntervalTime); // Function BravoHotelGame.BravoHotelCharacter.ClientPickupDefaultTime // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x229a070
	void ClientPhasePerkLevelUpReady(); // Function BravoHotelGame.BravoHotelCharacter.ClientPhasePerkLevelUpReady // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x229a050
	void ClientPerkSpinEvent(bool bShow, int32_t Count, enum class EPerkSlotFlag Slot); // Function BravoHotelGame.BravoHotelCharacter.ClientPerkSpinEvent // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x2299f40
	void ClientNotifyDamageToDamageCauser(struct ABravoHotelCharacter* HittedCharacter, float DamageAmount, struct FDamageEvent DamageEvent, struct AController* EventInstigator, struct AActor* DamageCauser); // Function BravoHotelGame.BravoHotelCharacter.ClientNotifyDamageToDamageCauser // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x2299da0
	void ClientKillPerkLevelUpReady(int32_t KillCount); // Function BravoHotelGame.BravoHotelCharacter.ClientKillPerkLevelUpReady // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x2299d10
	void ClientJetpackBooster(bool bNewJackpack); // Function BravoHotelGame.BravoHotelCharacter.ClientJetpackBooster // (Net|NetReliableNative|Event|Public|NetClient|NetValidate) // @ game+0x2299c50
	void ClientInAircraft(struct AActor* AircraftFlight, float AttachYaw); // Function BravoHotelGame.BravoHotelCharacter.ClientInAircraft // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x2299b80
	void ClientHitedPlayerLog(int32_t InHitPointIdx, float InDamageAmount, struct FDamageEvent InDamageEvent, struct AActor* InAttacker); // Function BravoHotelGame.BravoHotelCharacter.ClientHitedPlayerLog // (Net|NetReliableNative|Event|Public|NetClient|NetValidate) // @ game+0x22999f0
	void ClientFindPersonalSupplyBoxLocation(struct FSpawnBaseInfo SpawnInfo); // Function BravoHotelGame.BravoHotelCharacter.ClientFindPersonalSupplyBoxLocation // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x2299940
	void ClientFailedToExitVehicle(bool bShowMessage); // Function BravoHotelGame.BravoHotelCharacter.ClientFailedToExitVehicle // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x22998b0
	void ClientFailedToEnterVehicle(); // Function BravoHotelGame.BravoHotelCharacter.ClientFailedToEnterVehicle // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x2299890
	void ClientFailedPreActiveSkill(int32_t BuffIndex); // Function BravoHotelGame.BravoHotelCharacter.ClientFailedPreActiveSkill // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x2299800
	void ClientFailedActiveSkill(int32_t BuffIndex); // Function BravoHotelGame.BravoHotelCharacter.ClientFailedActiveSkill // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x2299770
	void ClientExitLadder(); // Function BravoHotelGame.BravoHotelCharacter.ClientExitLadder // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x2299750
	void ClientEndRevive(struct AActor* InRevivedActor, int32_t InRevivedTime); // Function BravoHotelGame.BravoHotelCharacter.ClientEndRevive // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x2299680
	void ClientEndResuscitated(struct APlayerState* InRevivedPlayerState, struct APlayerState* InSaviorPlayerState, struct FGoldenTimeLogData InLogData); // Function BravoHotelGame.BravoHotelCharacter.ClientEndResuscitated // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x2299560
	void ClientDoAbortCastingBackpackItemInVehicle(); // Function BravoHotelGame.BravoHotelCharacter.ClientDoAbortCastingBackpackItemInVehicle // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x2299540
	void ClientDebugBoxTrace(struct FVector TraceStart, struct FVector TraceEnd, struct FVector HalfSize); // Function BravoHotelGame.BravoHotelCharacter.ClientDebugBoxTrace // (Net|NetReliableNative|Event|Public|HasDefaults|NetClient) // @ game+0x2299450
	void ClientClearCastingUI(); // Function BravoHotelGame.BravoHotelCharacter.ClientClearCastingUI // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x2299430
	void ClientChoosePerkDeck(int32_t ChooseIndex, bool bSuccess); // Function BravoHotelGame.BravoHotelCharacter.ClientChoosePerkDeck // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x2299360
	void ClientApplyDamage(float DamageAmount, struct FDamageEvent DamageEvent, struct AController* EventInstigator, struct AActor* DamageCauser); // Function BravoHotelGame.BravoHotelCharacter.ClientApplyDamage // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x2299210
	void ClientApplyAutoAimAdvantage(float Radius, float Weight, uint16_t InAutoAimLevel); // Function BravoHotelGame.BravoHotelCharacter.ClientApplyAutoAimAdvantage // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x2299110
	void ClientAddWearableEffectBuffList(struct FString BuffIndex); // Function BravoHotelGame.BravoHotelCharacter.ClientAddWearableEffectBuffList // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x2299060
	void ClientAddPerkLevel(struct FPerkInfo InPerkInfo, enum class EPerkLevelUpType InLevelUpType, int32_t InBeforeLevel, int32_t InAfterLevel, int32_t InBeforeMaxHealth); // Function BravoHotelGame.BravoHotelCharacter.ClientAddPerkLevel // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x2298ec0
	void ClearInteractionUI(); // Function BravoHotelGame.BravoHotelCharacter.ClearInteractionUI // (Final|Native|Public) // @ game+0x2298ea0
	void CheckVisibleOutBlueZoneBlizzard(); // Function BravoHotelGame.BravoHotelCharacter.CheckVisibleOutBlueZoneBlizzard // (Final|Native|Public) // @ game+0x2298e80
	void CheckUseItem(struct FName& ItemKey); // Function BravoHotelGame.BravoHotelCharacter.CheckUseItem // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x2298de0
	void CheckUnderLand(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.CheckUnderLand // (Final|Native|Public) // @ game+0x2298d60
	void CheckThrowWeapon(struct FName& ItemKey); // Function BravoHotelGame.BravoHotelCharacter.CheckThrowWeapon // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x2298cc0
	void CheckStopRevive(); // Function BravoHotelGame.BravoHotelCharacter.CheckStopRevive // (Final|Native|Public) // @ game+0x2298ca0
	void CheckSteady(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.CheckSteady // (Final|Native|Public) // @ game+0x2298c20
	void CheckShakeOutMontage(); // Function BravoHotelGame.BravoHotelCharacter.CheckShakeOutMontage // (Final|Native|Public) // @ game+0x2298c00
	void CheckRequestBuildingInfo(); // Function BravoHotelGame.BravoHotelCharacter.CheckRequestBuildingInfo // (Final|Native|Public) // @ game+0x2298be0
	void CheckProneWeaponIdle(); // Function BravoHotelGame.BravoHotelCharacter.CheckProneWeaponIdle // (Final|Native|Public) // @ game+0x2298bc0
	void CheckProneCollision(); // Function BravoHotelGame.BravoHotelCharacter.CheckProneCollision // (Final|Native|Protected) // @ game+0x2298ba0
	bool CheckPlosiveSoundDetection(enum class EPlosiveSoundDetectionType DetiectionType); // Function BravoHotelGame.BravoHotelCharacter.CheckPlosiveSoundDetection // (Final|Native|Public|BlueprintCallable) // @ game+0x2298b10
	void CheckOxygen(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.CheckOxygen // (Final|Native|Public) // @ game+0x2298a90
	void CheckOverHeal(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.CheckOverHeal // (Final|Native|Public) // @ game+0x2298a10
	void CheckMeleeAnim(); // Function BravoHotelGame.BravoHotelCharacter.CheckMeleeAnim // (Final|Native|Public) // @ game+0x22989f0
	bool CheckIsCastingBackpackItem(struct FInventoryItemInfo& TargetItemInfo); // Function BravoHotelGame.BravoHotelCharacter.CheckIsCastingBackpackItem // (Final|Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x22988f0
	void CheckEquipAnim(); // Function BravoHotelGame.BravoHotelCharacter.CheckEquipAnim // (Final|Native|Public) // @ game+0x22988d0
	void CheckCurrentBuff(); // Function BravoHotelGame.BravoHotelCharacter.CheckCurrentBuff // (Final|Native|Public) // @ game+0x22988b0
	void CheckCharacterNamedArguments(); // Function BravoHotelGame.BravoHotelCharacter.CheckCharacterNamedArguments // (Final|Native|Public) // @ game+0x2298890
	void CheckBrokenEquipment(); // Function BravoHotelGame.BravoHotelCharacter.CheckBrokenEquipment // (Final|Native|Public) // @ game+0x2298870
	void CheckBombingTargeting(); // Function BravoHotelGame.BravoHotelCharacter.CheckBombingTargeting // (Final|Native|Public) // @ game+0x2298850
	void CheckArmedStateForAction(enum class EArmedStateActionType ActionType, bool bDoArm, bool bPlayUnequipAnimation, bool bOrdered); // Function BravoHotelGame.BravoHotelCharacter.CheckArmedStateForAction // (Final|Native|Public|BlueprintCallable) // @ game+0x22986f0
	void Cheat_SlomoUp(); // Function BravoHotelGame.BravoHotelCharacter.Cheat_SlomoUp // (Final|Native|Public|BlueprintCallable) // @ game+0x22986d0
	void Cheat_SlomoDown(); // Function BravoHotelGame.BravoHotelCharacter.Cheat_SlomoDown // (Final|Native|Public|BlueprintCallable) // @ game+0x22986d0
	void Cheat_GiveEquipment(); // Function BravoHotelGame.BravoHotelCharacter.Cheat_GiveEquipment // (Final|Native|Public|BlueprintCallable) // @ game+0x22986d0
	void Cheat_ChangeUltimateLevelUp(); // Function BravoHotelGame.BravoHotelCharacter.Cheat_ChangeUltimateLevelUp // (Final|Native|Public|BlueprintCallable) // @ game+0x22986d0
	void Cheat_ChangeUltimateLevelDown(); // Function BravoHotelGame.BravoHotelCharacter.Cheat_ChangeUltimateLevelDown // (Final|Native|Public|BlueprintCallable) // @ game+0x22986d0
	void ChangeSkillKey(struct TArray<struct FClassSkillKeyTypeList>& ChangedSkillKeys); // Function BravoHotelGame.BravoHotelCharacter.ChangeSkillKey // (Final|Native|Public|HasOutParms) // @ game+0x2298600
	void ChangeRandomPlayZone(); // Function BravoHotelGame.BravoHotelCharacter.ChangeRandomPlayZone // (Final|Native|Public|BlueprintCallable) // @ game+0x22985e0
	void ChangeOption(struct TArray<enum class ESettingType>& ChangeTypeList); // Function BravoHotelGame.BravoHotelCharacter.ChangeOption // (Final|Native|Public|HasOutParms) // @ game+0x2298530
	void ChangeGender(); // Function BravoHotelGame.BravoHotelCharacter.ChangeGender // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ChangeCastingMontageOnProneEvent(bool bNewProne, float TargetMontagePosition); // Function BravoHotelGame.BravoHotelCharacter.ChangeCastingMontageOnProneEvent // (Final|Native|Public) // @ game+0x2298460
	void CastingDelegate__DelegateSignature(struct FCastingInfo& CastingInfo, float CastingPercent); // DelegateFunction BravoHotelGame.BravoHotelCharacter.CastingDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x2bad3b0
	bool CanWeaponMeleeAttack(); // Function BravoHotelGame.BravoHotelCharacter.CanWeaponMeleeAttack // (Final|Native|Protected) // @ game+0x22983f0
	bool CanUseBackpackItem(int32_t BackpackItemIndex); // Function BravoHotelGame.BravoHotelCharacter.CanUseBackpackItem // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x2298360
	bool CanUpdateIdleNum(); // Function BravoHotelGame.BravoHotelCharacter.CanUpdateIdleNum // (Final|Native|Public|Const) // @ game+0x2298330
	bool CanTryUseAutoLadder(); // Function BravoHotelGame.BravoHotelCharacter.CanTryUseAutoLadder // (Final|Native|Public) // @ game+0x2298300
	bool CanSprint(); // Function BravoHotelGame.BravoHotelCharacter.CanSprint // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22982d0
	bool CanSpawnSuperBarrier(struct FTransform& OutSpawnTransform); // Function BravoHotelGame.BravoHotelCharacter.CanSpawnSuperBarrier // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x22981f0
	bool CanSliding(); // Function BravoHotelGame.BravoHotelCharacter.CanSliding // (Final|Native|Public|Const) // @ game+0x22981c0
	bool CanRolling(); // Function BravoHotelGame.BravoHotelCharacter.CanRolling // (Final|Native|Public|Const) // @ game+0x2298190
	bool CanReviveOtherPlayer(); // Function BravoHotelGame.BravoHotelCharacter.CanReviveOtherPlayer // (Final|Native|Public|Const) // @ game+0x2298160
	bool CanResuscitationOtherPlayer(struct AActor* ResuscitatedActor); // Function BravoHotelGame.BravoHotelCharacter.CanResuscitationOtherPlayer // (Final|Native|Public|Const) // @ game+0x22980d0
	void CanProneFailedDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.CanProneFailedDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2bad3b0
	bool CanPlayShakeOutMontage(); // Function BravoHotelGame.BravoHotelCharacter.CanPlayShakeOutMontage // (Final|Native|Public) // @ game+0x22980a0
	bool CanMove(); // Function BravoHotelGame.BravoHotelCharacter.CanMove // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2298070
	bool CanMeteorJump(); // Function BravoHotelGame.BravoHotelCharacter.CanMeteorJump // (Final|Native|Public) // @ game+0x2298040
	bool CanMeleeAttack(); // Function BravoHotelGame.BravoHotelCharacter.CanMeleeAttack // (Final|Native|Protected) // @ game+0x2298010
	bool CanLean(); // Function BravoHotelGame.BravoHotelCharacter.CanLean // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x2297fe0
	bool CanKickDoor(); // Function BravoHotelGame.BravoHotelCharacter.CanKickDoor // (Final|Native|Public|Const) // @ game+0x2297fb0
	bool CanJetpack(); // Function BravoHotelGame.BravoHotelCharacter.CanJetpack // (Final|Native|Public|Const) // @ game+0x2297f80
	bool CanHeartBeatSensor(); // Function BravoHotelGame.BravoHotelCharacter.CanHeartBeatSensor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2297f50
	bool CanFreeLook(); // Function BravoHotelGame.BravoHotelCharacter.CanFreeLook // (Final|Native|Public) // @ game+0x2297f20
	bool CanFPS(); // Function BravoHotelGame.BravoHotelCharacter.CanFPS // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x2297ec0
	bool CanFire(); // Function BravoHotelGame.BravoHotelCharacter.CanFire // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x2297ef0
	bool CanEnterVehicle(struct UBravoHotelVehicleSeatComponent* TargetVehicleSeat); // Function BravoHotelGame.BravoHotelCharacter.CanEnterVehicle // (Final|Native|Public|Const) // @ game+0x2297e30
	bool CanCombine(); // Function BravoHotelGame.BravoHotelCharacter.CanCombine // (Final|Native|Protected|BlueprintCallable) // @ game+0x2297e00
	bool CanChangeWeapon(); // Function BravoHotelGame.BravoHotelCharacter.CanChangeWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2297dd0
	bool CanChangeFireMode(); // Function BravoHotelGame.BravoHotelCharacter.CanChangeFireMode // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x2297da0
	void CancelMelee(); // Function BravoHotelGame.BravoHotelCharacter.CancelMelee // (Final|Native|Public) // @ game+0x2298440
	void CancelAimingInVehicle(); // Function BravoHotelGame.BravoHotelCharacter.CancelAimingInVehicle // (Final|Native|Public|BlueprintCallable) // @ game+0x2298420
	bool CanBeKnockedBack(); // Function BravoHotelGame.BravoHotelCharacter.CanBeKnockedBack // (Final|Native|Public|Const) // @ game+0x2297d70
	bool CanApplyActiveItem(int32_t BackpackItemIndex); // Function BravoHotelGame.BravoHotelCharacter.CanApplyActiveItem // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x2297ce0
	bool CanAOS(); // Function BravoHotelGame.BravoHotelCharacter.CanAOS // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x2297c80
	bool CanAMP(); // Function BravoHotelGame.BravoHotelCharacter.CanAMP // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2297c50
	bool CanAirWalk(); // Function BravoHotelGame.BravoHotelCharacter.CanAirWalk // (Final|Native|Public) // @ game+0x2297cb0
	bool CanADS(); // Function BravoHotelGame.BravoHotelCharacter.CanADS // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x2297c20
	void CallbackLanded(struct FHitResult Hit); // Function BravoHotelGame.BravoHotelCharacter.CallbackLanded // (Final|Native|Public) // @ game+0x2297b10
	bool CalculatePreShootInformations(struct FVector& Pos); // Function BravoHotelGame.BravoHotelCharacter.CalculatePreShootInformations // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x2297a70
	struct FVector CalculateActorLocationInRagdoll(); // Function BravoHotelGame.BravoHotelCharacter.CalculateActorLocationInRagdoll // (Final|Native|Protected|HasDefaults) // @ game+0x2297a30
	float CalcDamageByFallingSpeed(float InMinSpeed, float InMaxSpeed, bool bIsLandedFromVehicle); // Function BravoHotelGame.BravoHotelCharacter.CalcDamageByFallingSpeed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2297920
	void BroadcastDetectItemsDelegate(); // Function BravoHotelGame.BravoHotelCharacter.BroadcastDetectItemsDelegate // (Final|Native|Public) // @ game+0x2297900
	void BPSetReplicateMovement(bool bInReplicateMovement); // Function BravoHotelGame.BravoHotelCharacter.BPSetReplicateMovement // (Final|Native|Public|BlueprintCallable) // @ game+0x2297850
	void BeginPlay(); // Function BravoHotelGame.BravoHotelCharacter.BeginPlay // (Native|Public|BlueprintCallable) // @ game+0x22978e0
	void AttachWeaponToSlot(struct ABravoHotelEquippableActor* EquippableActor, int32_t SlotIndex); // Function BravoHotelGame.BravoHotelCharacter.AttachWeaponToSlot // (Final|Native|Public|BlueprintCallable) // @ game+0x2297790
	void ApplyDamageEx(float DamageAmount, struct FDamageEvent& DamageEvent, struct AController* EventInstigator, struct AActor* DamageCauser); // Function BravoHotelGame.BravoHotelCharacter.ApplyDamageEx // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x2297620
	float AffectedByForceField_Impl(float OutModifier, bool bNeedMultipy); // Function BravoHotelGame.BravoHotelCharacter.AffectedByForceField_Impl // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x2297550
	void ADSSettingsAfterChangeCamera(bool bUseCustomCurve); // Function BravoHotelGame.BravoHotelCharacter.ADSSettingsAfterChangeCamera // (Final|Native|Public|BlueprintCallable) // @ game+0x2296ca0
	void AddThrownMolotovCocktail(struct ABravoHotelProjectileGrenadeMolotovCocktail* MolotovCocktail); // Function BravoHotelGame.BravoHotelCharacter.AddThrownMolotovCocktail // (Final|Native|Public) // @ game+0x22974d0
	void AddThrownFlashbang(struct ABravoHotelProjectileGrenadeFlashbang* Flashbang); // Function BravoHotelGame.BravoHotelCharacter.AddThrownFlashbang // (Final|Native|Public) // @ game+0x2297450
	void AddSimulatedHittedDamage(struct UBravoHotelDamageType* DamageTypeClass, struct APawn* DamageInstigator, float Damage, int16_t HitPointIdx, uint16_t ProjectileId); // Function BravoHotelGame.BravoHotelCharacter.AddSimulatedHittedDamage // (Final|Native|Private) // @ game+0x22972c0
	void AddShortTimeHealth(struct UObject* HealthOwner, float AddHealth); // Function BravoHotelGame.BravoHotelCharacter.AddShortTimeHealth // (Final|Native|Public) // @ game+0x22971f0
	bool AddPerkLevel(enum class EPerkSlotFlag PerkSlot, int32_t Count, bool bTakeOne); // Function BravoHotelGame.BravoHotelCharacter.AddPerkLevel // (Final|Native|Public|BlueprintCallable) // @ game+0x22970f0
	void AddPerkEvent(struct FPerkInfo& PerkInfo, struct FDisplayAbility& InCurrentDisplayAbility, int32_t LastLevel, int32_t ClassLevel, enum class EPerkLevelUpType LevelUpType); // Function BravoHotelGame.BravoHotelCharacter.AddPerkEvent // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2bad3b0
	void AddOverHeal(float Amount); // Function BravoHotelGame.BravoHotelCharacter.AddOverHeal // (Final|Native|Public) // @ game+0x2297070
	void AddDetectedStealable(struct ABravoHotelCharacter* NewCharacter); // Function BravoHotelGame.BravoHotelCharacter.AddDetectedStealable // (Final|Native|Public|BlueprintCallable) // @ game+0x2296ff0
	void AddDetectedItem(struct ABravoHotelPickup* NewPickup); // Function BravoHotelGame.BravoHotelCharacter.AddDetectedItem // (Final|Native|Public|BlueprintCallable) // @ game+0x2296f70
	void AddDetectedDropBox(struct ABravoHotelDropBoxActor* NewPickup); // Function BravoHotelGame.BravoHotelCharacter.AddDetectedDropBox // (Final|Native|Public|BlueprintCallable) // @ game+0x2296ef0
	void AddCondition(enum class ECharacterConditionType ConditionType, enum class EAbilityCase Key); // Function BravoHotelGame.BravoHotelCharacter.AddCondition // (Final|Native|Public) // @ game+0x2296e30
	void AddCharacterRotation(float Val); // Function BravoHotelGame.BravoHotelCharacter.AddCharacterRotation // (Event|Protected|BlueprintEvent) // @ game+0x2bad3b0
	bool ActiveHeartBeatSensor(); // Function BravoHotelGame.BravoHotelCharacter.ActiveHeartBeatSensor // (Final|Native|Public) // @ game+0x2296e00
	bool ActiveAmplifier(); // Function BravoHotelGame.BravoHotelCharacter.ActiveAmplifier // (Final|Native|Public) // @ game+0x2296dd0
	void ActivateWeaponPP(struct UPostProcessComponent* NewWeaponPP); // Function BravoHotelGame.BravoHotelCharacter.ActivateWeaponPP // (Final|Native|Public|BlueprintCallable) // @ game+0x2296d50
	void ActivateADSPostProcess(); // Function BravoHotelGame.BravoHotelCharacter.ActivateADSPostProcess // (Final|Native|Public) // @ game+0x2296d30
};

// Class BravoHotelGame.BHPersonalSupplySystemComponent
// Size: 0x2cff6ad0 (Inherited: 0x2cff6cb8)
struct UBHPersonalSupplySystemComponent : UActorComponent {
	struct ABHPersonalSupplyBox* CurrentSupplyBox; // 0xc8(0x08)
	struct ABHPersonalSupplyBoxDummy* CurrentSupplyBoxDummy; // 0xd0(0x08)
	struct ABHPersonalSupplyBox* SupplyBoxClass; // 0xd8(0x08)
	struct ABHPersonalSupplyBoxDummy* SupplyBoxDummyClass; // 0xe0(0x08)
	struct FSupplyBoxAssignmentInfo CurrentAssignmentInfo; // 0xe8(0x30)
	int32_t CountOpenSupplyBox; // 0x118(0x04)
	int32_t SupplyBoxCost; // 0x11c(0x04)
	enum class EPersonalSupplyBoxState CurrentPSBState; // 0x120(0x01)
	enum class EAssignReason AssignReason; // 0x121(0x01)
	bool EnableShow; // 0x122(0x01)
	bool ShowPingByHUD; // 0x12a(0x01)

	void StartSpawnFromSpawnInfo(struct FSpawnPerkData& Data, bool CheckRePosition); // Function BravoHotelGame.BHPersonalSupplySystemComponent.StartSpawnFromSpawnInfo // (Final|Native|Public|HasOutParms) // @ game+0x221d540
	void StartSpawn(); // Function BravoHotelGame.BHPersonalSupplySystemComponent.StartSpawn // (Final|Native|Public) // @ game+0x221d520
	void SetPersonalSupplyBoxInfo(enum class EPersonalSupplyBoxState NewState, struct FVector NewLocation); // Function BravoHotelGame.BHPersonalSupplySystemComponent.SetPersonalSupplyBoxInfo // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x221d450
	void ServerSpawnSupplyBoxDummy(bool bIsFreeSupply); // Function BravoHotelGame.BHPersonalSupplySystemComponent.ServerSpawnSupplyBoxDummy // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x221d390
	void ServerPayMaterial(int32_t Amount); // Function BravoHotelGame.BHPersonalSupplySystemComponent.ServerPayMaterial // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x221d2d0
	void ServerPayGold(int32_t Amount); // Function BravoHotelGame.BHPersonalSupplySystemComponent.ServerPayGold // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x221d210
	void Response_PayMaterial(bool bSuccess, int32_t Amount, uint32_t MaterialIndex); // Function BravoHotelGame.BHPersonalSupplySystemComponent.Response_PayMaterial // (Final|Native|Public) // @ game+0x221d110
	void Response_PayGold(bool bSuccess, int32_t Amount); // Function BravoHotelGame.BHPersonalSupplySystemComponent.Response_PayGold // (Final|Native|Public) // @ game+0x221d050
	void OnRep_SupplyBoxCost(); // Function BravoHotelGame.BHPersonalSupplySystemComponent.OnRep_SupplyBoxCost // (Final|Native|Protected) // @ game+0x221d030
	void OnRep_CurrentAssignmentInfo(); // Function BravoHotelGame.BHPersonalSupplySystemComponent.OnRep_CurrentAssignmentInfo // (Final|Native|Protected) // @ game+0x221d010
	void OnRep_ChangePSMState(); // Function BravoHotelGame.BHPersonalSupplySystemComponent.OnRep_ChangePSMState // (Final|Native|Protected) // @ game+0x221cff0
	void MulticastNotifyAlert(int32_t player_uid); // Function BravoHotelGame.BHPersonalSupplySystemComponent.MulticastNotifyAlert // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x221cf60
	struct FPersonalSupplyBoxPingInfo GetPersonalSupplyBoxInfo(); // Function BravoHotelGame.BHPersonalSupplySystemComponent.GetPersonalSupplyBoxInfo // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x221cf20
	void ForceSpawnPersonalBox(struct FTransform SpawnTransform, struct TArray<struct FSpawnItemResult> ItemInfos); // Function BravoHotelGame.BHPersonalSupplySystemComponent.ForceSpawnPersonalBox // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x221cd90
	void ForceSpawnBox(struct FTransform SpawnTransform, struct TArray<struct FInventoryItemInfo> ItemInfos); // Function BravoHotelGame.BHPersonalSupplySystemComponent.ForceSpawnBox // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x221cbb0
	void ClientSetPersonalSupplyBox(struct FSupplyBoxAssignmentInfo AssignmentInfo); // Function BravoHotelGame.BHPersonalSupplySystemComponent.ClientSetPersonalSupplyBox // (Net|NetReliableNative|Event|Protected|NetClient) // @ game+0x221cb00
	void ClientRecallPersonalSupplyBox(); // Function BravoHotelGame.BHPersonalSupplySystemComponent.ClientRecallPersonalSupplyBox // (Net|NetReliableNative|Event|Protected|NetClient) // @ game+0x221cae0
	void ClientChangePSMState(enum class EPersonalSupplyBoxState State); // Function BravoHotelGame.BHPersonalSupplySystemComponent.ClientChangePSMState // (Net|NetReliableNative|Event|Protected|NetClient) // @ game+0x221ca60
	void ChangePersonalSupplyBoxLocationInfo(struct FVector NewLocation); // Function BravoHotelGame.BHPersonalSupplySystemComponent.ChangePersonalSupplyBoxLocationInfo // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x221c9d0
};

// Class BravoHotelGame.BravoHotelPlayFeatureState
// Size: 0x2cff6a30 (Inherited: 0x2cff6930)
struct UBravoHotelPlayFeatureState : UObject {
	char pad_2CFF6930[0x100]; // 0x2cff6930(0x100)
};

// Class BravoHotelGame.BHPFAirdropSupplyState
// Size: 0x2cff6a38 (Inherited: 0x2cff6a30)
struct UBHPFAirdropSupplyState : UBravoHotelPlayFeatureState {
	struct APawn* TransportPawnClass; // 0x30(0x08)
};

// Class BravoHotelGame.BravoHotel3DViewActor
// Size: 0x2cff6b10 (Inherited: 0x2cff6b08)
struct ABravoHotel3DViewActor : AActor {
	struct UBravoHotelSceneCaptureComponent2D* SceneCaptureComponent2D; // 0x308(0x08)

	void SetSceneCaptureComponentCanUpdateFrame(bool bInCaptureUpdateFrame); // Function BravoHotelGame.BravoHotel3DViewActor.SetSceneCaptureComponentCanUpdateFrame // (Final|Native|Public|BlueprintCallable) // @ game+0x221da50
	void SetSceneCaptureComponent2D(struct UBravoHotelSceneCaptureComponent2D* InSceneCaptureComponent2D); // Function BravoHotelGame.BravoHotel3DViewActor.SetSceneCaptureComponent2D // (Final|Native|Public|BlueprintCallable) // @ game+0x221d9d0
	struct UBravoHotelSceneCaptureComponent2D* GetSceneCaptureComponent2D(); // Function BravoHotelGame.BravoHotel3DViewActor.GetSceneCaptureComponent2D // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x221d9b0
};

// Class BravoHotelGame.BravoHotelAbilityComponent
// Size: 0x2cff6a30 (Inherited: 0x2cff6cb8)
struct UBravoHotelAbilityComponent : UActorComponent {
	struct FBravoHotelDefaultBalanceData DefaultBalanceData; // 0x3e8(0x88)
	struct TMap<enum class ECharacterBuffType, struct FName> CharacterBuffDataKeys; // 0x720(0x50)
	struct AActor* DefaultFireCell; // 0xe0(0x08)
	float SimulatedTickTime; // 0x4d8(0x04)
	struct TMap<enum class ECharacterAbilityType, struct FBravoHotelAbilityState> AbilityStates; // 0x2f0(0x50)
	struct TMap<enum class ECharacterConditionedAbilityType, struct FBravoHotelConditionedAbilityState> ConditionedAbilityStates; // 0x4e0(0x50)
	struct TMap<enum class ECharacterConditionType, struct FBravoHotelConditionState> ConditionStates; // 0x5d0(0x50)
	uint64_t ConditionFlags; // 0xd8(0x08)
	struct TMap<int32_t, struct FBravoHotelBuffUIInfo> BuffUIInfos; // 0x9e0(0x50)
	struct FBuffHandleArray CurrentBuffKeys; // 0x7d8(0x118)
	struct FBuffHandleArray ControlledInstantBuffKeys; // 0x1d8(0x118)
	struct TMap<uint16_t, struct UBravoHotelBuffBase*> CurrentBuffInfos; // 0x390(0x50)
	struct TMap<uint16_t, struct UBuffControlState*> BuffControls; // 0x580(0x50)
	struct TArray<struct UBravoHotelBuffBase*> StackBuffInfos; // 0x940(0x10)
	float Loudness; // 0xd0(0x04)
	float LoudnessCrouchRatio; // 0x4c4(0x04)
	float LoudnessProneRatio; // 0x4c0(0x04)
	float LoudnessTime; // 0x7d0(0x04)
	struct UUserWidget* DebugWidgetClass; // 0x778(0x08)
	struct TMap<struct UObject*, struct FMaterialEffectInfo> MaterialEffectInfos; // 0x470(0x50)
	struct UCurveFloat* MaterialEffectCurve; // 0x620(0x08)
	struct UCurveFloat* MaterialEffectStrCurve; // 0xc8(0x08)
	struct UUserWidget* DebugWidget; // 0x950(0x08)
	struct UBravoHotelDebugWidget* WeaponDebugTextWidget; // 0x718(0x08)
	struct TMap<enum class EBuffEventType, struct FMulticastInlineDelegate> BuffEventDelegates; // 0x958(0x50)
	struct TMap<enum class EBuffEventType, struct FMulticastInlineDelegate> BuffEndEventDelegates; // 0xe8(0x50)
	struct TMap<enum class EWeaponBuffEventType, struct FMulticastInlineDelegate> WeaponBuffEventDelegates; // 0x780(0x50)

	void WeaponBuffEventDelegate__DelegateSignature(enum class EWeaponBuffEventType& EventType, struct FConditionedWeaponInfo& WeaponInfo); // DelegateFunction BravoHotelGame.BravoHotelAbilityComponent.WeaponBuffEventDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x2bad3b0
	void ServerStopBuffControl(uint16_t BuffIndex); // Function BravoHotelGame.BravoHotelAbilityComponent.ServerStopBuffControl // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x2225fc0
	void ServerSetBuffControlTimer(uint16_t BuffIndex, float NewTimer); // Function BravoHotelGame.BravoHotelAbilityComponent.ServerSetBuffControlTimer // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x2225ec0
	void ServerResetAllBuffCoolTime(); // Function BravoHotelGame.BravoHotelAbilityComponent.ServerResetAllBuffCoolTime // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x2225e70
	void ServerRemoveCondition(enum class ECharacterConditionType ConditionType, int32_t Key); // Function BravoHotelGame.BravoHotelAbilityComponent.ServerRemoveCondition // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x2225d70
	void ServerRemoveBuffByIndex(uint16_t BuffIndex); // Function BravoHotelGame.BravoHotelAbilityComponent.ServerRemoveBuffByIndex // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x2225cb0
	void ServerForceRemoveCondition(enum class ECharacterConditionType ConditionType); // Function BravoHotelGame.BravoHotelAbilityComponent.ServerForceRemoveCondition // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x2225c00
	void ServerCheckBuffControl(uint16_t BuffIndex); // Function BravoHotelGame.BravoHotelAbilityComponent.ServerCheckBuffControl // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x2225b40
	void ServerAddStackBuffByIndex(uint16_t BuffIndex); // Function BravoHotelGame.BravoHotelAbilityComponent.ServerAddStackBuffByIndex // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x2225a80
	void ServerAddCondition(enum class ECharacterConditionType ConditionType, int32_t Key); // Function BravoHotelGame.BravoHotelAbilityComponent.ServerAddCondition // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x2225980
