// Class ChaosNiagara.NiagaraDataInterfaceChaosDestruction
// Size: 0x2cff6a38 (Inherited: 0x2cff6a38)
struct UNiagaraDataInterfaceChaosDestruction : UNiagaraDataInterface {
	struct TSet<struct AChaosSolverActor*> ChaosSolverActorSet; // 0x38(0x50)
	enum class EDataSourceTypeEnum DataSourceType; // 0x88(0x01)
	int32_t DataProcessFrequency; // 0x8c(0x04)
	int32_t MaxNumberOfDataEntriesToSpawn; // 0x90(0x04)
	bool DoSpawn; // 0x94(0x01)
	struct FVector2D SpawnMultiplierMinMax; // 0x98(0x08)
	float SpawnChance; // 0xa0(0x04)
	struct FVector2D ImpulseToSpawnMinMax; // 0xa4(0x08)
	struct FVector2D SpeedToSpawnMinMax; // 0xac(0x08)
	struct FVector2D MassToSpawnMinMax; // 0xb4(0x08)
	struct FVector2D ExtentMinToSpawnMinMax; // 0xbc(0x08)
	struct FVector2D ExtentMaxToSpawnMinMax; // 0xc4(0x08)
	struct FVector2D VolumeToSpawnMinMax; // 0xcc(0x08)
	struct FVector2D SolverTimeToSpawnMinMax; // 0xd4(0x08)
	int32_t SurfaceTypeToSpawn; // 0xdc(0x04)
	enum class ELocationFilteringModeEnum LocationFilteringMode; // 0xe0(0x01)
	enum class ELocationXToSpawnEnum LocationXToSpawn; // 0xe1(0x01)
	struct FVector2D LocationXToSpawnMinMax; // 0xe4(0x08)
	enum class ELocationYToSpawnEnum LocationYToSpawn; // 0xec(0x01)
	struct FVector2D LocationYToSpawnMinMax; // 0xf0(0x08)
	enum class ELocationZToSpawnEnum LocationZToSpawn; // 0xf8(0x01)
	struct FVector2D LocationZToSpawnMinMax; // 0xfc(0x08)
	enum class EDataSortTypeEnum DataSortingType; // 0x104(0x01)
	bool bGetExternalCollisionData; // 0x105(0x01)
	bool DoSpatialHash; // 0x106(0x01)
	struct FVector SpatialHashVolumeMin; // 0x108(0x0c)
	struct FVector SpatialHashVolumeMax; // 0x114(0x0c)
	struct FVector SpatialHashVolumeCellSize; // 0x120(0x0c)
	int32_t MaxDataPerCell; // 0x12c(0x04)
	bool bApplyMaterialsFilter; // 0x130(0x01)
	struct TSet<struct UPhysicalMaterial*> ChaosBreakingMaterialSet; // 0x138(0x50)
	bool bGetExternalBreakingData; // 0x188(0x01)
	bool bGetExternalTrailingData; // 0x189(0x01)
	struct FVector2D RandomPositionMagnitudeMinMax; // 0x18c(0x08)
	float InheritedVelocityMultiplier; // 0x194(0x04)
	enum class ERandomVelocityGenerationTypeEnum RandomVelocityGenerationType; // 0x198(0x01)
	struct FVector2D RandomVelocityMagnitudeMinMax; // 0x19c(0x08)
	float SpreadAngleMax; // 0x1a4(0x04)
	struct FVector VelocityOffsetMin; // 0x1a8(0x0c)
	struct FVector VelocityOffsetMax; // 0x1b4(0x0c)
	struct FVector2D FinalVelocityMagnitudeMinMax; // 0x1c0(0x08)
	float MaxLatency; // 0x1c8(0x04)
	enum class EDebugTypeEnum DebugType; // 0x1cc(0x01)
	int32_t LastSpawnedPointID; // 0x1d0(0x04)
	float LastSpawnTime; // 0x1d4(0x04)
	float SolverTime; // 0x1e8(0x04)
	float TimeStampOfLastProcessedData; // 0x1ec(0x04)
};

