// WidgetBlueprintGeneratedClass ClassSKillSlotWidget.ClassSKillSlotWidget_C
// Size: 0x2cff6ad4 (Inherited: 0x2cff6a88)
struct UClassSKillSlotWidget_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x288(0x08)
	struct UImage* Image; // 0x290(0x08)
	struct UImage* Image; // 0x298(0x08)
	struct UImage* Image; // 0x2a0(0x08)
	struct UImage* Image; // 0x2a8(0x08)
	struct UVerticalBox* List; // 0x2b0(0x08)
	struct USizeBox* SizeBox; // 0x2b8(0x08)
	struct UTextBlock* TextBlock; // 0x2c0(0x08)
	struct FName PerkDeckName; // 0x2c8(0x0c)

	void Construct(); // Function ClassSKillSlotWidget.ClassSKillSlotWidget_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void ExecuteUbergraph_ClassSKillSlotWidget(int32_t EntryPoint); // Function ClassSKillSlotWidget.ClassSKillSlotWidget_C.ExecuteUbergraph_ClassSKillSlotWidget // (Final|UbergraphFunction|HasDefaults) // @ game+0x2bad3b0
};

