// BlueprintGeneratedClass CustomizedChara_DataAsset.CustomizedChara_DataAsset_C
// Size: 0x2cff6c60 (Inherited: 0x2cff6a38)
struct UCustomizedChara_DataAsset_C : UPrimaryDataAsset {
	float CharacterRotationVelocity; // 0x38(0x04)
	float CameraMoveVelocity; // 0x3c(0x04)
	float CameraTop; // 0x40(0x04)
	float CameraBottom; // 0x44(0x04)
	float CameraZoomVelocity; // 0x48(0x04)
	float CameraInterpSpeed; // 0x4c(0x04)
	float CharacterRotationInterpSpeed; // 0x50(0x04)
	struct UCurveFloat* CameraMove; // 0x58(0x08)
	char pad_2CFF6A5C[0x204]; // 0x2cff6a5c(0x204)
};

