// Class LuminRuntimeSettings.LuminRuntimeSettings
// Size: 0x2cff6a50 (Inherited: 0x2cff6930)
struct ULuminRuntimeSettings : UObject {
	struct FString PackageName; // 0x30(0x10)
	struct FString ApplicationDisplayName; // 0x40(0x10)
	enum class ELuminFrameTimingHint FrameTimingHint; // 0x50(0x01)
	bool bProtectedContent; // 0x51(0x01)
	bool bManualCallToAppReady; // 0x52(0x01)
	bool bUseMobileRendering; // 0x53(0x01)
	bool bUseVulkan; // 0x54(0x01)
	struct FFilePath Certificate; // 0x58(0x10)
	struct FDirectoryPath IconModelPath; // 0x68(0x10)
	struct FDirectoryPath IconPortalPath; // 0x78(0x10)
	struct FLocalizedIconInfos LocalizedIconInfos; // 0x88(0x10)
	int32_t VersionCode; // 0x98(0x04)
	int32_t MinimumAPILevel; // 0x9c(0x04)
	struct TArray<enum class ELuminPrivilege> AppPrivileges; // 0xa0(0x10)
	struct TArray<struct FLuminComponentSubElement> ExtraComponentSubElements; // 0xb0(0x10)
	struct TArray<struct FLuminComponentElement> ExtraComponentElements; // 0xc0(0x10)
	struct FString SpatializationPlugin; // 0xd0(0x10)
	struct FString ReverbPlugin; // 0xe0(0x10)
	struct FString OcclusionPlugin; // 0xf0(0x10)
	int32_t SoundCueCookQualityIndex; // 0x100(0x04)
	bool bRemoveDebugInfo; // 0x104(0x01)
	struct FDirectoryPath VulkanValidationLayerLibs; // 0x108(0x10)
	bool bFrameVignette; // 0x118(0x01)
	struct TArray<struct FLocalizedAppName> LocalizedAppNames; // 0x120(0x10)
	char pad_2CFF6A23[0x2d]; // 0x2cff6a23(0x2d)
};

