// BlueprintGeneratedClass LV-Title_Alternative.LV-Title_Alternative_C
// Size: 0x2cff6b08 (Inherited: 0x2cff6b10)
struct ALV-Title_Alternative_C : ALevelScriptActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x310(0x08)
	struct UBP-TitleWidget_C* TitleWidgetRef; // 0x318(0x08)
	struct UBP-LobbyWidget_Web_C* LobbyWidgetRef; // 0x320(0x08)
	struct TArray<struct ACharacter*> LobbyPawns; // 0x328(0x10)
	struct TSoftClassPtr<UObject> LobbyPawnClass; // 0x338(0x30)
	struct FKey SkipKey; // 0x368(0x20)
	bool bSkip; // 0x388(0x01)
	bool bNotFirstTime; // 0x389(0x01)
	struct ACharacter* LobbyCustomizePawn; // 0x390(0x08)
	bool IsCharacterAppearance; // 0x398(0x01)
	struct ACineCameraActor* TargetWearableCamera; // 0x3a0(0x08)
	struct FString CurrentArmorySceneState; // 0x3a8(0x10)
	float SurveyUPanValue; // 0x3b8(0x04)
	float GunSurveyMovingValue; // 0x3bc(0x04)
	struct UMaterialInstanceDynamic* SurveyUPan; // 0x3c0(0x08)
	struct UMaterialInstanceDynamic* GunSurveyMoving; // 0x3c8(0x08)
	struct FTimerHandle IdentifiedTimer; // 0x3d0(0x08)
	struct FString MainTab; // 0x3d8(0x10)
	struct UMaterialInstanceDynamic* PP-OutlineGlow; // 0x3e8(0x08)
	struct FAudioPlayingHandle AudioIndex_Ambience; // 0x3f0(0x04)
	struct FAudioPlayingHandle AudioIndex_Analyze; // 0x3f4(0x04)
	bool PendingPartyInfoChange; // 0x3f8(0x01)
	struct FTimerHandle EnhanceTimerHandle; // 0x400(0x08)
	struct FTimerHandle ProceedingTimerHandle; // 0x408(0x08)
	struct UBP-CreateCharacterWidget_Web_C* CreateCharacterRef; // 0x410(0x08)
	struct UUW-IntroBackground_C* IntroBGWidget; // 0x418(0x08)
	struct UMediaSoundComponent* MediaSoundComponent; // 0x420(0x08)
	bool bPlaySoloSequencePlayer; // 0x428(0x01)
	struct FString CurrentArmoryTab; // 0x430(0x10)
	struct UUW-LoginWidget_C* LoginWidget; // 0x440(0x08)
	bool bFinished_SequencePlayer_Endgame; // 0x448(0x01)
	struct FString SubTab; // 0x450(0x10)
	int32_t LocalLeagueSequenceStartPlay; // 0x460(0x04)
	struct ALevelSequenceActor* CurrentLeagueSequence; // 0x468(0x08)
	struct FString TournamentLeagueState; // 0x470(0x10)
	bool bPlayTournamentSound; // 0x480(0x01)
	struct UAkAudioEvent* StopAudioBGMEvent; // 0x488(0x08)
	struct ASkeletalMeshActor* ANIM-Lobby01_5_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x490(0x08)
	struct ASkeletalMeshActor* ANIM-Lobby02_8_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x498(0x08)
	struct ASkeletalMeshActor* ANIM-Lobby03_2_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x4a0(0x08)
	struct ASkeletalMeshActor* ANIM-Lobby04_11_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x4a8(0x08)
	struct ASkeletalMeshActor* SK-Body_Female_5_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x4b0(0x08)
	struct ASkeletalMeshActor* SK-Body_Female_Ranking_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x4b8(0x08)
	struct ASkeletalMeshActor* ANIM-Tourna_Lobby04_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x4c0(0x08)
	struct ASkeletalMeshActor* ANIM-Tourna_Lobby03_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x4c8(0x08)
	struct ASkeletalMeshActor* ANIM-Tourna_Lobby01_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x4d0(0x08)
	struct ASkeletalMeshActor* ANIM-Tourna_Lobby02_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x4d8(0x08)
	struct ASkeletalMeshActor* ANIM-AI_Lobby04_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x4e0(0x08)
	struct ASkeletalMeshActor* ANIM-AI_Lobby03_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x4e8(0x08)
	struct ASkeletalMeshActor* ANIM-AI_Lobby02_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x4f0(0x08)
	struct ASkeletalMeshActor* ANIM-AI_Lobby01_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x4f8(0x08)
	struct ASkeletalMeshActor* ANIM-Training-Lobby01_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x500(0x08)
	struct ALevelSequenceActor* Title_TowerBridge_Squard_5_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x508(0x08)
	struct ALevelSequenceActor* Title_AI_Squard_4_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x510(0x08)
	struct ABravoHotelAmbientSound* Ak-LobbySound_1_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x518(0x08)
	struct ALevelSequenceActor* Title_TowerBridge_Endgame_2_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x520(0x08)
	struct ALevelSequenceActor* Title_TowerBridge_Readyshot_2_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x528(0x08)
	struct ALevelSequenceActor* Character_Creation_2_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x530(0x08)
	struct AExponentialHeightFog* ExponentialHeightFog3_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x538(0x08)
	struct AExponentialHeightFog* ExponentialHeightFog_1_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x540(0x08)
	struct AExponentialHeightFog* ExponentialHeightFog2_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x548(0x08)
	struct ACineCameraActor* CineCameraActor_1_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x550(0x08)
	struct ACineCameraActor* CineCamera_Supplybox_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x558(0x08)
	struct ACineCameraActor* CineCamera_All_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x560(0x08)
	struct ALevelSequenceActor* Character_Customization_Face_3_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x568(0x08)
	struct ALevelSequenceActor* Supplybox_Lobby_02_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x570(0x08)
	struct ALevelSequenceActor* Supplybox_Lobby_01_0_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x578(0x08)
	struct ACineCameraActor* CineCamera_Target_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x580(0x08)
	struct ACineCameraActor* CineCamera_Rank_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x588(0x08)
	struct ALevelSequenceActor* Title_Rank_2_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x590(0x08)
	struct AStaticMeshActor* Gun_Survey_Plane_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x598(0x08)
	struct ALevelSequenceActor* Weapon_Lobby_01_2_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x5a0(0x08)
	struct ACineCameraActor* CineCamera_Face3_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x5a8(0x08)
	struct ALevelSequenceActor* Screen_Transition_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x5b0(0x08)
	struct ALevelSequenceActor* Character_Fade_2_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x5b8(0x08)
	struct AEmitter* PS-LobbyRay1_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x5c0(0x08)
	struct AEmitter* PS-LobbyRay2_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x5c8(0x08)
	struct AEmitter* PS-LobbyRay3_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x5d0(0x08)
	struct AEmitter* PS-LobbyRay4_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x5d8(0x08)
	struct AEmitter* PS-LobbyRay5_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x5e0(0x08)
	struct AEmitter* PS-LobbyRay6_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x5e8(0x08)
	struct AEmitter* PS-LobbyRay7_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x5f0(0x08)
	struct AEmitter* PS-LobbyRay8_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x5f8(0x08)
	struct ALevelSequenceActor* Weapon_Lobby_Disassemble_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x600(0x08)
	struct ALevelSequenceActor* Weapon_Lobby_Repair_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x608(0x08)
	struct ACineCameraActor* CineCamera_Weapon_Customization_2_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x610(0x08)
	struct ALevelSequenceActor* Weapon_Lobby_Custom_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x618(0x08)
	struct ACineCameraActor* Tournament_CineCamera_01_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x620(0x08)
	struct ACineCameraActor* CineCamera_Training_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x628(0x08)
	struct ALevelSequenceActor* Title_Training_Readyshot_3_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x630(0x08)
	struct ACineCameraActor* CineCameraActor_AI_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x638(0x08)
	struct ACineCameraActor* CineCamera_Weapon_Customization03_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x640(0x08)
	struct ALevelSequenceActor* Title_Tournament_Advance_5_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x648(0x08)
	struct ALevelSequenceActor* Title_Tournament_Fail_11_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x650(0x08)
	struct ALevelSequenceActor* Title_Tournament_End_8_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x658(0x08)
	struct ALevelSequenceActor* Title_Tournament_Shot_2_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x660(0x08)
	struct ALevelSequenceActor* Title_Tournament_End_OnlyCamera_5_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x668(0x08)
	struct ACineCameraActor* CineCamera_Exploration_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x670(0x08)
	struct ACineCameraActor* CineCamera_Weapon_Customization2_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x678(0x08)
	struct ASkeletalMeshActor* SK-Body_Female_Creation_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x680(0x08)
	struct ACineCameraActor* CineCameraActor_1_EdGraph_4_RefProperty; // 0x688(0x08)
	struct AStaticMeshActor* Gun_Survey_Plane_EdGraph_11_RefProperty; // 0x690(0x08)
	struct AStaticMeshActor* Gun_Survey_Plane_EdGraph_12_RefProperty; // 0x698(0x08)
	struct AStaticMeshActor* Gun_Survey_Plane_EdGraph_13_RefProperty; // 0x6a0(0x08)
	struct APostProcessVolume* PostProcessVolume2_EdGraph_14_RefProperty; // 0x6a8(0x08)
	struct APostProcessVolume* PostProcessVolume2_EdGraph_15_RefProperty; // 0x6b0(0x08)
	struct ALevelSequenceActor* Title_Training_Readyshot_3_EdGraph_16_RefProperty; // 0x6b8(0x08)
	struct ALevelSequenceActor* Supplybox_Lobby_02_EdGraph_16_RefProperty; // 0x6c0(0x08)
	struct ALevelSequenceActor* Title_Rank_2_EdGraph_16_RefProperty; // 0x6c8(0x08)
	struct ALevelSequenceActor* Character_Customization_Face_3_EdGraph_16_RefProperty; // 0x6d0(0x08)
	struct ALevelSequenceActor* Supplybox_Lobby_01_0_EdGraph_16_RefProperty; // 0x6d8(0x08)
	struct AStaticMeshActor* Plane_3_EdGraph_27_RefProperty; // 0x6e0(0x08)
	struct AStaticMeshActor* Plane_2_EdGraph_27_RefProperty; // 0x6e8(0x08)
	struct AStaticMeshActor* Plane_4_EdGraph_27_RefProperty; // 0x6f0(0x08)
	struct ALevelSequenceActor* Title_AI_Squard_4_EdGraph_28_RefProperty; // 0x6f8(0x08)
	struct ALevelSequenceActor* Title_TowerBridge_Squard_5_EdGraph_28_RefProperty; // 0x700(0x08)

	void SetTournamentResultAnim(bool bIsWIn); // Function LV-Title_Alternative.LV-Title_Alternative_C.SetTournamentResultAnim // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void UpdateEquipWeaponAndScenePage(); // Function LV-Title_Alternative.LV-Title_Alternative_C.UpdateEquipWeaponAndScenePage // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void StopPartyCameraSequence(); // Function LV-Title_Alternative.LV-Title_Alternative_C.StopPartyCameraSequence // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetSequencePanelColor(int32_t WeaponRarity); // Function LV-Title_Alternative.LV-Title_Alternative_C.SetSequencePanelColor // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
