// UserDefinedStruct SKeyActionSave.SKeyActionSave
// Size: 0x2cff6a5a (Inherited: 0x00)
struct FSKeyActionSave {
	struct FString ActionName_27_5885F13F40BEDA6C8B8F749EAEC64BBA; // 0x00(0x10)
	struct FString Category_10_6A9C009143C58E50DF299AA2409B06BD; // 0x10(0x10)
	struct FString Name_12_284B813542040EB40314D6A629BCF640; // 0x20(0x10)
	float Scale_25_55DAC9F048835ECFBB2123B59FBB6835; // 0x30(0x04)
	bool Primary_15_7375BAE94E1228E31B871684158CC790; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
	struct FKey KeyInput_26_669892994CD4745AD57CF4BDF708E2A0; // 0x38(0x20)
	bool NegativeAxis_22_17736552415A5EA125B225BE5B8415AE; // 0x58(0x01)
	bool EmptyCombination_29_A96B2E8F49C8DDD0067652A02233A112; // 0x59(0x01)
	char pad_5A[0x2cff6a00]; // 0x5a(0x2cff6a00)
};

