// Class Slate.ButtonWidgetStyle
// Size: 0x2cff6ae0 (Inherited: 0x2cff6a38)
struct UButtonWidgetStyle : USlateWidgetStyleContainerBase {
	struct FButtonStyle ButtonStyle; // 0x38(0x2a8)
};

// Class Slate.CheckBoxWidgetStyle
// Size: 0x2cff6b18 (Inherited: 0x2cff6a38)
struct UCheckBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FCheckBoxStyle CheckBoxStyle; // 0x38(0x5e0)
};

// Class Slate.ComboBoxWidgetStyle
// Size: 0x2cff6a78 (Inherited: 0x2cff6a38)
struct UComboBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FComboBoxStyle ComboBoxStyle; // 0x38(0x440)
};

// Class Slate.ComboButtonWidgetStyle
// Size: 0x2cff6a30 (Inherited: 0x2cff6a38)
struct UComboButtonWidgetStyle : USlateWidgetStyleContainerBase {
	struct FComboButtonStyle ComboButtonStyle; // 0x38(0x3f8)
};

// Class Slate.EditableTextBoxWidgetStyle
// Size: 0x2cff6a98 (Inherited: 0x2cff6a38)
struct UEditableTextBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FEditableTextBoxStyle EditableTextBoxStyle; // 0x38(0x860)
};

// Class Slate.EditableTextWidgetStyle
// Size: 0x2cff6a70 (Inherited: 0x2cff6a38)
struct UEditableTextWidgetStyle : USlateWidgetStyleContainerBase {
	struct FEditableTextStyle EditableTextStyle; // 0x38(0x238)
};

// Class Slate.ProgressWidgetStyle
// Size: 0x2cff6af0 (Inherited: 0x2cff6a38)
struct UProgressWidgetStyle : USlateWidgetStyleContainerBase {
	struct FProgressBarStyle ProgressBarStyle; // 0x38(0x1b8)
};

// Class Slate.ScrollBarWidgetStyle
// Size: 0x2cff6a50 (Inherited: 0x2cff6a38)
struct UScrollBarWidgetStyle : USlateWidgetStyleContainerBase {
	struct FScrollBarStyle ScrollBarStyle; // 0x38(0x518)
};

// Class Slate.ScrollBoxWidgetStyle
// Size: 0x2cff6a80 (Inherited: 0x2cff6a38)
struct UScrollBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FScrollBoxStyle ScrollBoxStyle; // 0x38(0x248)
};

// Class Slate.SlateSettings
// Size: 0x2cff6a38 (Inherited: 0x2cff6930)
struct USlateSettings : UObject {
	bool bExplicitCanvasChildZOrder; // 0x30(0x01)
	char pad_2CFF6931[0x107]; // 0x2cff6931(0x107)
};

// Class Slate.SpinBoxWidgetStyle
// Size: 0x2cff6a48 (Inherited: 0x2cff6a38)
struct USpinBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FSpinBoxStyle SpinBoxStyle; // 0x38(0x310)
};

// Class Slate.TextBlockWidgetStyle
// Size: 0x2cff6ac0 (Inherited: 0x2cff6a38)
struct UTextBlockWidgetStyle : USlateWidgetStyleContainerBase {
	struct FTextBlockStyle TextBlockStyle; // 0x38(0x288)
};

// Class Slate.ToolMenuBase
// Size: 0x2cff6a30 (Inherited: 0x2cff6930)
struct UToolMenuBase : UObject {
	char pad_2CFF6930[0x100]; // 0x2cff6930(0x100)
};

