// WidgetBlueprintGeneratedClass UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C
// Size: 0x2cff6ad0 (Inherited: 0x2cff6aaa)
struct UUW-Inventory_WeaponSlot_C : UUW-Inventory_SlotBase_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x14b0(0x08)
	struct UWidgetAnimation* Anim_LoopHintMainWeapon; // 0x14b8(0x08)
	struct UWidgetAnimation* Anim_Material_Get; // 0x14c0(0x08)
	struct UWidgetAnimation* Anim_Material_Hover; // 0x14c8(0x08)
	struct UWidgetAnimation* Anim_Upgrade; // 0x14d0(0x08)
	struct UWidgetAnimation* Anim_Progress; // 0x14d8(0x08)
	struct UWidgetAnimation* WeaponPerk_fadeIn; // 0x14e0(0x08)
	struct UWidgetAnimation* Anim_LoopNotifySubWeapon; // 0x14e8(0x08)
	struct UWidgetAnimation* Anim_StartNotifySubWeapon; // 0x14f0(0x08)
	struct UWidgetAnimation* Anim_LoopNotifyMainWeapon; // 0x14f8(0x08)
	struct UWidgetAnimation* Anim_StartNotifyMainWeapon; // 0x1500(0x08)
	struct UTextBlock* Ammo01; // 0x1508(0x08)
	struct UTextBlock* Ammo02; // 0x1510(0x08)
	struct UTextBlock* Ammo_Training; // 0x1518(0x08)
	struct UTextBlock* AmmoInfo01; // 0x1520(0x08)
	struct UTextBlock* AmmoInfo02; // 0x1528(0x08)
	struct UUW-Inventory_WeaponAttachmentSlot_C* Barrel01; // 0x1530(0x08)
	struct UImage* BG01; // 0x1538(0x08)
	struct UImage* BG02; // 0x1540(0x08)
	struct UImage* BorderImage02; // 0x1548(0x08)
	struct UButton* btn_RecipeTree; // 0x1550(0x08)
	struct UUW-Inventory_WeaponAttachmentSlot_C* ButtStockSlot01; // 0x1558(0x08)
	struct UUW-Inventory_WeaponAttachmentSlot_C* ButtStockSlot02; // 0x1560(0x08)
	struct UCanvasPanel* Canvas_AnimMain; // 0x1568(0x08)
	struct UCanvasPanel* Canvas_AnimMain_Progress; // 0x1570(0x08)
	struct UCanvasPanel* Canvas_AnimMain_Upgrade; // 0x1578(0x08)
	struct UCanvasPanel* Canvas_AnimSub; // 0x1580(0x08)
	struct UImage* Choice_BG01; // 0x1588(0x08)
	struct UImage* Choice_BG02; // 0x1590(0x08)
	struct UUW-Inventory_WeaponAttachmentSlot_C* GripSlot01; // 0x1598(0x08)
	struct UHorizontalBox* HorizontalBox_Perk; // 0x15a0(0x08)
	struct UHorizontalBox* HorizontalBox_Rarity1; // 0x15a8(0x08)
	struct UHorizontalBox* HorizontalBox_Rarity2; // 0x15b0(0x08)
	struct UImage* Image; // 0x15b8(0x08)
	struct UImage* Image; // 0x15c0(0x08)
	struct UImage* Image; // 0x15c8(0x08)
	struct UImage* Image; // 0x15d0(0x08)
	struct UImage* Image; // 0x15d8(0x08)
	struct UImage* Image; // 0x15e0(0x08)
	struct UImage* Image; // 0x15e8(0x08)
	struct UImage* Image; // 0x15f0(0x08)
	struct UImage* Image; // 0x15f8(0x08)
	struct UImage* Image; // 0x1600(0x08)
	struct UImage* Image; // 0x1608(0x08)
	struct UImage* Image; // 0x1610(0x08)
	struct UImage* Image; // 0x1618(0x08)
	struct UImage* Image; // 0x1620(0x08)
	struct UImage* Image; // 0x1628(0x08)
	struct UImage* Image; // 0x1630(0x08)
	struct UImage* Image; // 0x1638(0x08)
	struct UImage* Image; // 0x1640(0x08)
	struct UImage* Image; // 0x1648(0x08)
	struct UImage* Image; // 0x1650(0x08)
	struct UImage* Image; // 0x1658(0x08)
	struct UImage* Image; // 0x1660(0x08)
	struct UImage* Image; // 0x1668(0x08)
	struct UImage* Image; // 0x1670(0x08)
	struct UImage* Image_Bindable; // 0x1678(0x08)
	struct UImage* Image_Supply; // 0x1680(0x08)
	struct UImage* ImageAmmo01; // 0x1688(0x08)
	struct UImage* ImageAmmo02; // 0x1690(0x08)
	struct USizeBox* Info01; // 0x1698(0x08)
	struct USizeBox* Info02; // 0x16a0(0x08)
	struct UImage* Line01; // 0x16a8(0x08)
	struct UImage* Line02; // 0x16b0(0x08)
	struct UUW-Inventory_WeaponAttachmentSlot_C* MagazineSlot01; // 0x16b8(0x08)
	struct UUW-Inventory_WeaponAttachmentSlot_C* MagazineSlot02; // 0x16c0(0x08)
	struct USizeBox* MainWeaponSlot; // 0x16c8(0x08)
	struct UUW-Inventory_WeaponAttachmentSlot_C* MuzzleDeviceSlot01; // 0x16d0(0x08)
	struct UUW-Inventory_WeaponAttachmentSlot_C* MuzzleDeviceSlot02; // 0x16d8(0x08)
	struct UOverlay* Overlay_RecipeTree; // 0x16e0(0x08)
	struct UUW-Inventory_WeaponAttachmentSlot_C* Perk01; // 0x16e8(0x08)
	struct UUW-Inventory_WeaponAttachmentSlot_C* Perk01_Sub; // 0x16f0(0x08)
	struct UUW-Inventory_WeaponAttachmentSlot_C* Perk02; // 0x16f8(0x08)
	struct UUW-Inventory_WeaponAttachmentSlot_C* Perk02_Sub; // 0x1700(0x08)
	struct UUW-Inventory_WeaponAttachmentSlot_C* Perk03; // 0x1708(0x08)
	struct UUW-Inventory_WeaponAttachmentSlot_C* Perk03_Sub; // 0x1710(0x08)
	struct UUW-Inventory_WeaponAttachmentSlot_C* Perk04; // 0x1718(0x08)
	struct UUW-Inventory_WeaponAttachmentSlot_C* Perk04_Sub; // 0x1720(0x08)
	struct UUW-Inventory_WeaponAttachmentSlot_C* SightSlot01; // 0x1728(0x08)
	struct UUW-Inventory_WeaponAttachmentSlot_C* SightSlot02; // 0x1730(0x08)
	struct USizeBox* SubWeaponSlot; // 0x1738(0x08)
	struct UTextBlock* TextBlock; // 0x1740(0x08)
	struct UTextBlock* TextBlock_Range01; // 0x1748(0x08)
	struct UImage* TopNameBG01; // 0x1750(0x08)
	struct UImage* TopNameBG02; // 0x1758(0x08)
	struct UUW-Inventory_MaterialIconSlot_C* UW-Inventory_MaterialIconSlot; // 0x1760(0x08)
	struct UUW-Inventory_WeaponPerkSlot_C* UW-Inventory_WeaponPerkSlot; // 0x1768(0x08)
	struct UUW-Inventory_WeaponPerkSlot_C* UW-Inventory_WeaponPerkSlot_C; // 0x1770(0x08)
	struct UUW-Inventory_WeaponPerkSlot_C* UW-Inventory_WeaponPerkSlot_C; // 0x1778(0x08)
	struct UUW-StatupWidget_C* UW-StatupWidget; // 0x1780(0x08)
	struct UImage* WeaponImage01; // 0x1788(0x08)
	struct UImage* WeaponImage02; // 0x1790(0x08)
	struct UTextBlock* WeaponIndex01; // 0x1798(0x08)
	struct UTextBlock* WeaponIndex02; // 0x17a0(0x08)
	struct UTextBlock* WeaponName01; // 0x17a8(0x08)
	struct UTextBlock* WeaponName01_Perk; // 0x17b0(0x08)
	struct UTextBlock* WeaponName02; // 0x17b8(0x08)
	struct UTextBlock* WeaponName02_Perk; // 0x17c0(0x08)
	struct UOverlay* WeaponTitle01; // 0x17c8(0x08)
	struct UOverlay* WeaponTitle02; // 0x17d0(0x08)
	struct UWidgetSwitcher* WidgetSwitcher; // 0x17d8(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_Ammo; // 0x17e0(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_Rarity; // 0x17e8(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_SpecialWeapon; // 0x17f0(0x08)
	enum class EWeaponType WeaponType; // 0x17f8(0x01)
	int32_t SlotIndex; // 0x17fc(0x04)
	struct ABravoHotelWeaponBase* WeaponBase; // 0x1800(0x08)
	bool bCanEquip; // 0x1808(0x01)
	struct TMap<enum class EWeaponAttachmentType, struct UUW-Inventory_WeaponAttachmentSlot_C*> WeaponAttachmentSlots01; // 0x1810(0x50)
	struct TMap<enum class EWeaponAttachmentType, struct UUW-Inventory_WeaponAttachmentSlot_C*> WeaponAttachmentSlots02; // 0x1860(0x50)
	float WeaponIconHeight; // 0x18b0(0x04)
	bool bHover; // 0x18b4(0x01)
	struct UUW-Inventory_ItemSlotHover_C* HoverWidget; // 0x18b8(0x08)
	int32_t NotifyAnimLoopNum; // 0x18c0(0x04)
	struct UPlayerInventoryComponent* LocalInventoryComponent; // 0x18c8(0x08)

	void ResetItemOptions(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.ResetItemOptions // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetItemOptions(struct FInventoryItemInfo ItemInfo); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.SetItemOptions // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetWeaponName(bool IsMainWeapon, struct FText InText); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.SetWeaponName // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void InitAmmoVisibility(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.InitAmmoVisibility // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	bool OnDropProximitySlot(struct UUW-Inventory_ProximitySlot_C* ProximitySlot); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.OnDropProximitySlot // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void IsEquipped(bool& Return); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.IsEquipped // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // @ game+0x2bad3b0
	void CheckNeedEmptyPerkWeaponTooltip(bool& NewParam); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.CheckNeedEmptyPerkWeaponTooltip // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x2bad3b0
	void ShowStatupAnim(struct FStatupAnimParameters& StatParams); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.ShowStatupAnim // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetMaterialIcon(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.SetMaterialIcon // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void CheckSpecialWeapon(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.CheckSpecialWeapon // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetRarityInfo(struct FInventoryItemInfo ItemInfo); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.SetRarityInfo // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetHoverWidgetRef(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.SetHoverWidgetRef // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void DisibleEquiped(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.DisibleEquiped // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void InitWeaponSlot(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.InitWeaponSlot // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void DragStart_Imp(struct UDragDropOperation*& DragDropOp); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.DragStart_Imp // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void HoverSelectReset(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.HoverSelectReset // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void IsDropableOnCarried(bool& out_Result); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.IsDropableOnCarried // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void UnEquip(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.UnEquip // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void HoverEquipAttachment(enum class EWeaponAttachmentType WeaponAttachmentType); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.HoverEquipAttachment // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void DragSelectSlot(enum class EWeaponType WeaponType, bool& bReault); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.DragSelectSlot // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void IsDraging(bool& bResult); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.IsDraging // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void ResetHoverAllSlot(bool& bResult); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.ResetHoverAllSlot // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ResetHoverWeaponSlotList(bool& bResult); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.ResetHoverWeaponSlotList // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	bool OnDrop(struct FGeometry MyGeometry, struct FPointerEvent PointerEvent, struct UDragDropOperation* Operation); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.OnDrop // (BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnDragDetected(struct FGeometry MyGeometry, struct FPointerEvent& PointerEvent, struct UDragDropOperation*& Operation); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.OnDragDetected // (BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void DragFindAttachItemSlot(struct FInventoryItemInfo InventoryItemInfo, bool& bResult); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.DragFindAttachItemSlot // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void DragFindEquipAttachment(enum class EWeaponAttachmentType WeaponAttachmentType); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.DragFindEquipAttachment // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void HoverResetAttachItemSlot(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.HoverResetAttachItemSlot // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void HoverSelectEquipAttachment(enum class EWeaponAttachmentType WeaponAttachmentType); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.HoverSelectEquipAttachment // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void HoverSelectAttachItemSlot(struct FInventoryItemInfo InventoryItemInfo, bool& bResult); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.HoverSelectAttachItemSlot // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void IsMainWeapon(bool& bResult); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.IsMainWeapon // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnRButtonClick(bool& bResult); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.OnRButtonClick // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetHoverInfo(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.SetHoverInfo // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetSubWeaponAttachment(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.SetSubWeaponAttachment // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void InitSubWeaponAttachment(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.InitSubWeaponAttachment // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetMainWeaponAttachment(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.SetMainWeaponAttachment // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void InitMainWeaponAttachment(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.InitMainWeaponAttachment // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void GetAvailableWeaponAttachment(enum class EWeaponAttachmentType AttachmentType, bool& bResult); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.GetAvailableWeaponAttachment // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Reset(int32_t SlotIndex); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.Reset // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Drop(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.Drop // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetInfo(struct UUW-InventoryWidget_C* InventoryWidget, struct ABravoHotelWeaponBase* WeaponBaseObject, struct FInventoryItemInfo InventoryItemInfo); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.SetInfo // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnLoaded_12B755EE4F233763D6BD21B48D6176F0(struct UObject* Loaded); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.OnLoaded_12B755EE4F233763D6BD21B48D6176F0 // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnLoaded_D1195FCF4E38C6E811F1FCBC38F521B6(struct UObject* Loaded); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.OnLoaded_D1195FCF4E38C6E811F1FCBC38F521B6 // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnMouseEnter(struct FGeometry MyGeometry, struct FPointerEvent& MouseEvent); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.OnMouseEnter // (BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2bad3b0
	void OnMouseLeave(struct FPointerEvent& MouseEvent); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.OnMouseLeave // (BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2bad3b0
	void Init(int32_t SlotIndex); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.Init // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void CanEquip(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.CanEquip // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Construct(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void Hover(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.Hover // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnDragEnter(struct FGeometry MyGeometry, struct FPointerEvent PointerEvent, struct UDragDropOperation* Operation); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.OnDragEnter // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void OnDragLeave(struct FPointerEvent PointerEvent, struct UDragDropOperation* Operation); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.OnDragLeave // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void SelectEquip(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.SelectEquip // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ResetHover(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.ResetHover // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ResetCanEquip(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.ResetCanEquip // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ResetSelectEquip(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.ResetSelectEquip // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void AsyncLoadWeaponIcon(struct TSoftObjectPtr<UObject> IconTexture); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.AsyncLoadWeaponIcon // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void AsyncLoadAmmoIcon(struct TSoftObjectPtr<UPaperSprite> IconTexture); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.AsyncLoadAmmoIcon // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Event_WeaponInfo(int32_t Idx, int32_t Ammo, int32_t MaxAmmo); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.Event_WeaponInfo // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void NotifyMainWeapon(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.NotifyMainWeapon // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void NotifySubWeapon(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.NotifySubWeapon // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnAnimationFinished(struct UWidgetAnimation* Animation); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.OnAnimationFinished // (BlueprintCosmetic|Event|Protected|BlueprintEvent) // @ game+0x2bad3b0
	void CheckInventoryRef(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.CheckInventoryRef // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void StopNotify(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.StopNotify // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__btn_RecipeTree_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.BndEvt__btn_RecipeTree_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void CompleteCombine(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.CompleteCombine // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void CompleteCombineOnRecipeTree(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.CompleteCombineOnRecipeTree // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void HoverRecipeTree(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.HoverRecipeTree // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void HideProgressAnimPanel(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.HideProgressAnimPanel // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnUpdateCastingDelegateEvent(struct FCastingInfo& CastingInfo, float CastingPercent); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.OnUpdateCastingDelegateEvent // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ExecuteUbergraph_UW-Inventory_WeaponSlot(int32_t EntryPoint); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.ExecuteUbergraph_UW-Inventory_WeaponSlot // (Final|UbergraphFunction|HasDefaults) // @ game+0x2bad3b0
};

