// WidgetBlueprintGeneratedClass UW-ItemRecipeTree.UW-ItemRecipeTree_C
// Size: 0x2cff6ac9 (Inherited: 0x2cff6a98)
struct UUW-ItemRecipeTree_C : UBravoHotelItemRecipeTreeWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x298(0x08)
	struct UHorizontalBox* HorizontalBox; // 0x2a0(0x08)
	struct UHorizontalBox* HorizontalBox; // 0x2a8(0x08)
	struct UHorizontalBox* HorizontalBox; // 0x2b0(0x08)
	struct UHorizontalBox* HorizontalBox; // 0x2b8(0x08)
	struct UHorizontalBox* HorizontalBox; // 0x2c0(0x08)
	struct UHorizontalBox* HorizontalBox; // 0x2c8(0x08)
	struct UHorizontalBox* HorizontalBox_00; // 0x2d0(0x08)
	struct UHorizontalBox* HorizontalBox_02; // 0x2d8(0x08)
	struct UHorizontalBox* HorizontalBox_03; // 0x2e0(0x08)
	struct UHorizontalBox* HorizontalBox_04; // 0x2e8(0x08)
	struct UHorizontalBox* HorizontalBox_05; // 0x2f0(0x08)
	struct UHorizontalBox* HorizontalBox_06; // 0x2f8(0x08)
	struct UHorizontalBox* HorizontalBox_07; // 0x300(0x08)
	struct UHorizontalBox* HorizontalBox_08; // 0x308(0x08)
	struct UHorizontalBox* HorizontalBox_09; // 0x310(0x08)
	struct UVerticalBox* Line00; // 0x318(0x08)
	struct UHorizontalBox* Line01; // 0x320(0x08)
	struct UVerticalBox* Line02; // 0x328(0x08)
	struct UVerticalBox* Line03; // 0x330(0x08)
	struct UVerticalBox* Line04; // 0x338(0x08)
	struct UVerticalBox* Line05; // 0x340(0x08)
	struct UVerticalBox* Line06; // 0x348(0x08)
	struct UVerticalBox* Line07; // 0x350(0x08)
	struct UVerticalBox* Line08; // 0x358(0x08)
	struct UVerticalBox* Line09; // 0x360(0x08)
	struct UVerticalBox* Line10; // 0x368(0x08)
	struct UVerticalBox* Line11; // 0x370(0x08)
	struct UVerticalBox* Line12; // 0x378(0x08)
	struct UVerticalBox* Line13; // 0x380(0x08)
	struct UVerticalBox* Line14; // 0x388(0x08)
	struct UVerticalBox* Line15; // 0x390(0x08)
	struct UOverlay* Overlay_Main; // 0x398(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot00; // 0x3a0(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot01; // 0x3a8(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot02; // 0x3b0(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot03; // 0x3b8(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot04; // 0x3c0(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot05; // 0x3c8(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot06; // 0x3d0(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot07; // 0x3d8(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot08; // 0x3e0(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot09; // 0x3e8(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot10; // 0x3f0(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot11; // 0x3f8(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot12; // 0x400(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot13; // 0x408(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot14; // 0x410(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot15; // 0x418(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot16; // 0x420(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot17; // 0x428(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot18; // 0x430(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot19; // 0x438(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot20; // 0x440(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot21; // 0x448(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot22; // 0x450(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot23; // 0x458(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot24; // 0x460(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot25; // 0x468(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot26; // 0x470(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot27; // 0x478(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot28; // 0x480(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot29; // 0x488(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot30; // 0x490(0x08)
	struct UUW-ItemRecipeTreeSlot_C* Slot31; // 0x498(0x08)
	struct UVerticalBox* VerticalBox; // 0x4a0(0x08)
	struct UUW-Inventory_ItemSlotHover_C* HoverWidget; // 0x4a8(0x08)
	struct FName HaveItemKey; // 0x4b0(0x0c)
	struct FName TargetItemKey; // 0x4bc(0x0c)
	bool IsSearchExpertWeapon; // 0x4c8(0x01)

	void ShowTreeNode(struct FRecipeTreeWidgetInfo WidgetInfo, bool bShow, bool bCombinable); // Function UW-ItemRecipeTree.UW-ItemRecipeTree_C.ShowTreeNode // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetTreeNodeByInfo(struct FItemRecipeTreeData TreeData, struct FRecipeTreeWidgetInfo WidgetInfo, bool Complete); // Function UW-ItemRecipeTree.UW-ItemRecipeTree_C.SetTreeNodeByInfo // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Construct(); // Function UW-ItemRecipeTree.UW-ItemRecipeTree_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void SetItemKey(struct FName ItemKey, struct FName HaveItemKey); // Function UW-ItemRecipeTree.UW-ItemRecipeTree_C.SetItemKey // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Destruct(); // Function UW-ItemRecipeTree.UW-ItemRecipeTree_C.Destruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void ExecuteUbergraph_UW-ItemRecipeTree(int32_t EntryPoint); // Function UW-ItemRecipeTree.UW-ItemRecipeTree_C.ExecuteUbergraph_UW-ItemRecipeTree // (Final|UbergraphFunction|HasDefaults) // @ game+0x2bad3b0
};

