// WidgetBlueprintGeneratedClass UW-InventoryWidget.UW-InventoryWidget_C
// Size: 0x2cff6a99 (Inherited: 0x2cff6ac8)
struct UUW-InventoryWidget_C : UBravoHotelInventoryWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c8(0x08)
	struct UWidgetAnimation* CompleteRecipeLock; // 0x2d0(0x08)
	struct UWidgetAnimation* FadeIn; // 0x2d8(0x08)
	struct UBackgroundBlur* BackgroundBlur; // 0x2e0(0x08)
	struct UCanvasPanel* BackPackBound_begin; // 0x2e8(0x08)
	struct UCanvasPanel* BackPackBound_end; // 0x2f0(0x08)
	struct UImage* Bg; // 0x2f8(0x08)
	struct UOverlay* BlackMarketOverlay; // 0x300(0x08)
	struct UButton* BTN-BlackMarket; // 0x308(0x08)
	struct UButton* Button; // 0x310(0x08)
	struct UButton* Button; // 0x318(0x08)
	struct UButton* Button_SortByTime; // 0x320(0x08)
	struct UButton* Button_SortByType; // 0x328(0x08)
	struct UCanvasPanel* CanvasPanel; // 0x330(0x08)
	struct UCanvasPanel* CanvasPanel; // 0x338(0x08)
	struct UCanvasPanel* CanvasPanel; // 0x340(0x08)
	struct UCanvasPanel* CanvasPanel; // 0x348(0x08)
	struct UImage* Carried_Area; // 0x350(0x08)
	struct UCanvasPanel* CarriedBound_begin; // 0x358(0x08)
	struct UCanvasPanel* CarriedBound_end; // 0x360(0x08)
	struct UUW-Inventory_Carried_C* CarriedList; // 0x368(0x08)
	struct UUW-Inventory_Carried_C* CarriedList_StrongBox; // 0x370(0x08)
	struct UUW-Inventory_Carried_C* CarriedList_StrongBox; // 0x378(0x08)
	struct UUW-Inventory_Carried_C* CarriedList_StrongBox; // 0x380(0x08)
	struct UCheckBox* CheckBox; // 0x388(0x08)
	struct UCheckBox* CheckBox; // 0x390(0x08)
	struct UCheckBox* CheckBox_PlayAssist; // 0x398(0x08)
	struct UCheckBox* CheckBox_ShowCharacter; // 0x3a0(0x08)
	struct UCanvasPanel* CombineRecipe; // 0x3a8(0x08)
	struct UUW-Inventory_Equipped_C* EquippedList; // 0x3b0(0x08)
	struct UHorizontalBox* HorizontalBox; // 0x3b8(0x08)
	struct UHorizontalBox* HorizontalBox; // 0x3c0(0x08)
	struct UHorizontalBox* HorizontalBox_ShowCharacter; // 0x3c8(0x08)
	struct UHorizontalBox* HorizontalBox_ShowCharacter; // 0x3d0(0x08)
	struct UHorizontalBox* HorizontalBox_WeightMax; // 0x3d8(0x08)
	struct UImage* Image; // 0x3e0(0x08)
	struct UImage* Image; // 0x3e8(0x08)
	struct UImage* Image; // 0x3f0(0x08)
	struct UImage* Image; // 0x3f8(0x08)
	struct UImage* Image; // 0x400(0x08)
	struct UImage* Image; // 0x408(0x08)
	struct UImage* Image; // 0x410(0x08)
	struct UImage* Image; // 0x418(0x08)
	struct UImage* Image; // 0x420(0x08)
	struct UImage* Image; // 0x428(0x08)
	struct UImage* Image; // 0x430(0x08)
	struct UImage* Image; // 0x438(0x08)
	struct UImage* Image; // 0x440(0x08)
	struct UImage* Image; // 0x448(0x08)
	struct UImage* Image; // 0x450(0x08)
	struct UImage* Image; // 0x458(0x08)
	struct UImage* Image; // 0x460(0x08)
	struct UImage* Image; // 0x468(0x08)
	struct UImage* Image; // 0x470(0x08)
	struct UImage* Image_Guess; // 0x478(0x08)
	struct UImage* Image_ItemInfo; // 0x480(0x08)
	struct UImage* Image_ItemInfo; // 0x488(0x08)
	struct UImage* IMG-BG; // 0x490(0x08)
	struct UImage* IMG-BlackMarketBorder; // 0x498(0x08)
	struct UImage* InputMaskImage; // 0x4a0(0x08)
	struct UImage* Material_Area; // 0x4a8(0x08)
	struct UCanvasPanel* MaterialBound_begin; // 0x4b0(0x08)
	struct UCanvasPanel* MaterialBound_end; // 0x4b8(0x08)
	struct UProgressBar* ProgressBar; // 0x4c0(0x08)
	struct UProgressBar* ProgressBar_MaxWeight; // 0x4c8(0x08)
	struct UProgressBar* ProgressBar_Weight; // 0x4d0(0x08)
	struct UProgressBar* ProgressBar_WeightBag; // 0x4d8(0x08)
	struct UCanvasPanel* ProximityBound; // 0x4e0(0x08)
	struct UUW-Inventory_Proximity_C* ProximityList; // 0x4e8(0x08)
	struct UImage* StrongBox_Area; // 0x4f0(0x08)
	struct UImage* StrongBox_Area; // 0x4f8(0x08)
	struct UImage* StrongBox_Area; // 0x500(0x08)
	struct UOverlay* SupplyWeapon; // 0x508(0x08)
	struct USizeBox* SupplyWeaponSizeBox; // 0x510(0x08)
	struct UTextBlock* T_AdditionalMaxWeight; // 0x518(0x08)
	struct UTextBlock* T_AdditionalMaxWeightSymbol; // 0x520(0x08)
	struct UTextBlock* T_AdditionalWeight; // 0x528(0x08)
	struct UTextBlock* T_AdditionalWeightSymbol; // 0x530(0x08)
	struct UTextBlock* T_MaxWeight; // 0x538(0x08)
	struct UTextBlock* T_StrongboxCount; // 0x540(0x08)
	struct UTextBlock* T_StrongboxCount; // 0x548(0x08)
	struct UTextBlock* T_StrongboxCount; // 0x550(0x08)
	struct UTextBlock* T_Weight; // 0x558(0x08)
	struct UTextBlock* T_WeightSlash; // 0x560(0x08)
	struct UTextBlock* Text; // 0x568(0x08)
	struct UTextBlock* TextBlock; // 0x570(0x08)
	struct UTextBlock* TextBlock; // 0x578(0x08)
	struct UTextBlock* TextBlock; // 0x580(0x08)
	struct UTextBlock* TextBlock; // 0x588(0x08)
	struct UTextBlock* TextBlock_SortByTime; // 0x590(0x08)
	struct UTextBlock* TextBlock_SortByType; // 0x598(0x08)
	struct UUW-ButtonCancle_C* UW-ButtonCancle; // 0x5a0(0x08)
	struct UUW-ButtonOk_C* UW-ButtonOk; // 0x5a8(0x08)
	struct UUW-Inventory_FreeSupplyToolTip_C* UW-Inventory_FreeSupplyToolTip; // 0x5b0(0x08)
	struct UUW-Inventory_ItemInfoTooltip_C* UW-Inventory_ItemInfoTooltip; // 0x5b8(0x08)
	struct UUW-Inventory_ItemInfoTooltip_C* UW-Inventory_ItemInfoTooltip; // 0x5c0(0x08)
	struct UUW-Inventory_Keeped_C* UW-Inventory_Keeped; // 0x5c8(0x08)
	struct UUW-Inventory_Material_C* UW-Inventory_Material; // 0x5d0(0x08)
	struct UUW-Inventory_Recipe_C* UW-Inventory_Recipe; // 0x5d8(0x08)
	struct UUW-PersonalSupplyBoxWeaponInfoWidget_C* UW-PersonalSupplyBoxWeaponInfoWidget; // 0x5e0(0x08)
	struct UUW-SearchingMaterial_C* UW-SearchingMaterial; // 0x5e8(0x08)
	struct UCanvasPanel* WeaponBound; // 0x5f0(0x08)
	struct UUW-Inventory_Weapon_C* WeaponList; // 0x5f8(0x08)
	struct UTextBlock* WeightPerCent; // 0x600(0x08)
	struct ABP-BravoHotel-PlayerController_C* PlayerController; // 0x608(0x08)
	bool bItemDrag; // 0x610(0x01)
	struct UUW-ItemDropPopup_C* DropPopup; // 0x618(0x08)
	float MaximumWeight; // 0x620(0x04)
	int32_t OldProximityItemCount; // 0x624(0x04)
	struct UUW-Inventory_ProximityBoxSlot_C* ProximityGround; // 0x628(0x08)
	struct ABravoHotelCharacter* CharacterRef; // 0x630(0x08)
	struct TArray<struct UUW-Inventory_ProximitySlot_C*> ProximityGroundPool; // 0x638(0x10)
	struct ABravoHotelCharacter* OldCharacterRef; // 0x648(0x08)
	struct FTimerHandle CharacterTimerHandle; // 0x650(0x08)
	struct TArray<struct FDropBoxInfo> DropBoxWidgetList; // 0x658(0x10)
	struct UObject* DropBoxParentWidget; // 0x668(0x08)
	struct UBP-SavedInventorySettings_C* SavedInventorySettings; // 0x670(0x08)
	struct ABravoHotelWeaponBase* EquipedWeapon; // 0x678(0x08)
	struct TArray<struct ABravoHotelWeaponBase*> OldWeaponList; // 0x680(0x10)
	bool ChangeAttachments; // 0x690(0x01)
	struct UUW-Inventory_ItemSlotHover_C* ItemHoverWidget; // 0x698(0x08)
	struct UBravoHotelMainWidget* MainWidget; // 0x6a0(0x08)
	struct FMulticastInlineDelegate EventDispatcher_OnCloseInventory; // 0x6a8(0x10)
	struct TArray<struct UUW-Inventory_ProximityBoxSlot_C*> StealableWidgetList; // 0x6b8(0x10)
	bool bItemInfoHovered; // 0x6c8(0x01)
	bool bFirstTimeNotifyItemInfo; // 0x6c9(0x01)
	struct FTimerHandle Timer_ItemInfoTooltip; // 0x6d0(0x08)
	bool IsShowingItemInfoTooltip; // 0x6d8(0x01)
	int32_t FirstTimeCapsuleItem; // 0x6dc(0x04)
	int32_t FirstTimeCraft; // 0x6e0(0x04)
	bool bGoldWarning; // 0x6e4(0x01)
	struct FSlateColor DefaultWeightColor; // 0x6e8(0x28)
	struct FSlateColor MinusWeightColor; // 0x710(0x28)
	struct FSlateColor PlusWeightColor; // 0x738(0x28)
	struct TArray<struct UUW-Inventory_MaterialIconSlot_C*> IconSlotList; // 0x760(0x10)
	struct UDragDropOperation* SaveOperation; // 0x770(0x08)
	struct UUW-Inventory_Carried_C* SaveCarridWidget; // 0x778(0x08)
	struct UUW-Inventory_WeaponSlot_C* SaveWeaponSlot; // 0x780(0x08)
	bool bSupplyWeaponFromWeaponSlot; // 0x788(0x01)
	bool DoingSupplyWeaponEquip; // 0x789(0x01)
	struct UUW-Inventory_ProximitySlot_C* SaveProximityslot; // 0x790(0x08)
	bool bSupplyWeaponFromRightClick; // 0x798(0x01)

	void UpdateCarriedList(struct TArray<struct FInventoryItemInfo>& List, bool bIsStrong); // Function UW-InventoryWidget.UW-InventoryWidget_C.UpdateCarriedList // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Check Supply Weapon(struct UDragDropOperation* Operation, bool& IsSupplyWeapon); // Function UW-InventoryWidget.UW-InventoryWidget_C.Check Supply Weapon // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void CheckInventoryLock(); // Function UW-InventoryWidget.UW-InventoryWidget_C.CheckInventoryLock // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void CheckFreeSupplyBox(struct ABravoHotelDropBoxActor* DropBoxActor); // Function UW-InventoryWidget.UW-InventoryWidget_C.CheckFreeSupplyBox // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
