// WidgetBlueprintGeneratedClass UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C
// Size: 0x2cff6aa0 (Inherited: 0x2cff6ac0)
struct UUW-Inventory_ItemSlotHover_C : UBravoHotelInventoryHoverWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct UWidgetAnimation* UPArrow; // 0x2c8(0x08)
	struct UWidgetAnimation* FadeIn; // 0x2d0(0x08)
	struct UImage* Ammo_Compare; // 0x2d8(0x08)
	struct UTextBlock* Ammo_Value; // 0x2e0(0x08)
	struct UImage* AmmoIcon; // 0x2e8(0x08)
	struct UTextBlock* AmmoInfo; // 0x2f0(0x08)
	struct UImage* Arrow_01; // 0x2f8(0x08)
	struct UImage* Arrow_02; // 0x300(0x08)
	struct UWrapBox* BuffList; // 0x308(0x08)
	struct UWrapBox* BuffList; // 0x310(0x08)
	struct UImage* EffectiveRange_Compare; // 0x318(0x08)
	struct UTextBlock* EffectiveRange_Value; // 0x320(0x08)
	struct UImage* FiringRate_Compare; // 0x328(0x08)
	struct UTextBlock* FiringRate_Value; // 0x330(0x08)
	struct UHorizontalBox* HorizontalBox_ItemRarity; // 0x338(0x08)
	struct UHorizontalBox* HorizontalBox_MaterialRarity; // 0x340(0x08)
	struct UHorizontalBox* HorizontalBox_WeaponRarity; // 0x348(0x08)
	struct UImage* Image; // 0x350(0x08)
	struct UImage* Image; // 0x358(0x08)
	struct UImage* Image; // 0x360(0x08)
	struct UImage* Image; // 0x368(0x08)
	struct UImage* Image; // 0x370(0x08)
	struct UImage* Image; // 0x378(0x08)
	struct UImage* Image; // 0x380(0x08)
	struct UImage* Image; // 0x388(0x08)
	struct UImage* Image; // 0x390(0x08)
	struct UImage* Image; // 0x398(0x08)
	struct UImage* Image; // 0x3a0(0x08)
	struct UImage* Image; // 0x3a8(0x08)
	struct UImage* Image; // 0x3b0(0x08)
	struct UImage* Image; // 0x3b8(0x08)
	struct UImage* Image; // 0x3c0(0x08)
	struct UImage* Image; // 0x3c8(0x08)
	struct UImage* Image; // 0x3d0(0x08)
	struct UImage* Image; // 0x3d8(0x08)
	struct UImage* Image; // 0x3e0(0x08)
	struct UImage* Image; // 0x3e8(0x08)
	struct UImage* Image; // 0x3f0(0x08)
	struct UImage* Image; // 0x3f8(0x08)
	struct UImage* Image; // 0x400(0x08)
	struct UImage* Image; // 0x408(0x08)
	struct UImage* Image; // 0x410(0x08)
	struct UImage* Image; // 0x418(0x08)
	struct UImage* Image_WeaponLock; // 0x420(0x08)
	struct UImage* Img_MaterialBG; // 0x428(0x08)
	struct UImage* IMG_MaterialIcon; // 0x430(0x08)
	struct UImage* IMG_Stat; // 0x438(0x08)
	struct UImage* ItemBg; // 0x440(0x08)
	struct UImage* ItemBg_01; // 0x448(0x08)
	struct UImage* ItemBg_02; // 0x450(0x08)
	struct UImage* ItemSlot-BG; // 0x458(0x08)
	struct UTextBlock* ItemSlot-Capacity; // 0x460(0x08)
	struct UTextBlock* ItemSlot-Capacity; // 0x468(0x08)
	struct UTextBlock* ItemSlot-Description; // 0x470(0x08)
	struct UTextBlock* ItemSlot-Description; // 0x478(0x08)
	struct UImage* ItemSlot-ItemImage; // 0x480(0x08)
	struct UTextBlock* ItemSlot-ItemName; // 0x488(0x08)
	struct UTextBlock* ItemSlot-ItemType; // 0x490(0x08)
	struct UImage* ItemSlot-ItemTypeMark; // 0x498(0x08)
	struct UCanvasPanel* ItemSlotHover; // 0x4a0(0x08)
	struct UImage* PerkBG; // 0x4a8(0x08)
	struct UImage* PerkImage; // 0x4b0(0x08)
	struct UTextBlock* PerkLevelText; // 0x4b8(0x08)
	struct UTextBlock* PerkName; // 0x4c0(0x08)
	struct UCanvasPanel* PerkSlotHover; // 0x4c8(0x08)
	struct UImage* PopupHover-BG; // 0x4d0(0x08)
	struct UImage* Power_Compare; // 0x4d8(0x08)
	struct UTextBlock* Power_Value; // 0x4e0(0x08)
	struct USizeBox* SizeBox; // 0x4e8(0x08)
	struct USizeBox* SizeBox; // 0x4f0(0x08)
	struct USizeBox* SizeBox_ComparingText; // 0x4f8(0x08)
	struct USizeBox* SizeBox_ItemDivide; // 0x500(0x08)
	struct UImage* Stability_Compare; // 0x508(0x08)
	struct UTextBlock* Stability_Value; // 0x510(0x08)
	struct UCanvasPanel* StatSlotHover; // 0x518(0x08)
	struct UTextBlock* T_BindPlayerName; // 0x520(0x08)
	struct UTextBlock* T_Material; // 0x528(0x08)
	struct UTextBlock* T_MaterialDesc; // 0x530(0x08)
	struct UTextBlock* T_PerkDescLv1; // 0x538(0x08)
	struct UTextBlock* T_PerkDescLv2; // 0x540(0x08)
	struct UTextBlock* T_PerkDescLv3; // 0x548(0x08)
	struct UTextBlock* T_Stat; // 0x550(0x08)
	struct UTextBlock* T_StatDesc; // 0x558(0x08)
	struct URichTextBlock* T_TooltipDesc; // 0x560(0x08)
	struct UTextBlock* T_UnlockUltimateLevel; // 0x568(0x08)
	struct UTextBlock* Text_CombineTarget; // 0x570(0x08)
	struct UTextBlock* TextBlock; // 0x578(0x08)
	struct UTextBlock* TextBlock; // 0x580(0x08)
	struct UTextBlock* TextBlock; // 0x588(0x08)
	struct UTextBlock* TextBlock; // 0x590(0x08)
	struct UCanvasPanel* UpArrowAni; // 0x598(0x08)
	struct UUW-ImageText_C* UW-ImageText; // 0x5a0(0x08)
	struct UUW-ImageText_C* UW-ImageText; // 0x5a8(0x08)
	struct UUW-ImageText_C* UW-ImageText; // 0x5b0(0x08)
	struct UUW-ImageText_C* UW-ImageText_Ultimate; // 0x5b8(0x08)
	struct UUW-Inventory_ItemSlotHover_WeaponSlot_C* UW-Inventory_ItemSlotHover_WeaponSlot; // 0x5c0(0x08)
	struct UUW-Inventory_ItemSlotHover_WeaponSlot_C* UW-Inventory_ItemSlotHover_WeaponSlot; // 0x5c8(0x08)
	struct UUW-Inventory_ItemSlotHover_WeaponSlot_C* UW-Inventory_ItemSlotHover_WeaponSlot_C; // 0x5d0(0x08)
	struct UUW-Inventory_ItemSlotHover_WeaponSlot_C* UW-Inventory_ItemSlotHover_WeaponSlot_C; // 0x5d8(0x08)
	struct UUW-Inventory_ItemSlotHover_WeaponSlot_C* UW-Inventory_ItemSlotHover_WeaponSlot_C; // 0x5e0(0x08)
	struct UUW-Inventory_ItemSlotHover_WeaponSlot_C* UW-Inventory_ItemSlotHover_WeaponSlot_C; // 0x5e8(0x08)
	struct UUW-Inventory_SetItemInfo_C* UW-Inventory_SetItemInfo; // 0x5f0(0x08)
	struct UVerticalBox* VerticalBox; // 0x5f8(0x08)
	struct UVerticalBox* VerticalBox_BuffList; // 0x600(0x08)
	struct UVerticalBox* VerticalBox_BuffList; // 0x608(0x08)
	struct UVerticalBox* VerticalBox_CombineTarget; // 0x610(0x08)
	struct UVerticalBox* VerticalBox_Divide; // 0x618(0x08)
	struct UVerticalBox* VerticalBox_ItemDivide; // 0x620(0x08)
	struct UVerticalBox* VerticalBox_WeaponBindedInfo; // 0x628(0x08)
	struct UTextBlock* WeaponItemCapacity; // 0x630(0x08)
	struct UTextBlock* WeaponItemComparingName; // 0x638(0x08)
	struct UTextBlock* WeaponItemDescription; // 0x640(0x08)
	struct UImage* WeaponItemImage; // 0x648(0x08)
	struct UImage* WeaponItemSlot-BG; // 0x650(0x08)
	struct UCanvasPanel* WeaponItemSlotHover; // 0x658(0x08)
	struct UTextBlock* WeaponItemType; // 0x660(0x08)
	struct UImage* WeaponLockImage; // 0x668(0x08)
	struct UTextBlock* WeaponName; // 0x670(0x08)
	struct UTextBlock* WeaponName_Perk; // 0x678(0x08)
	struct UWidgetSwitcher* WidgetSwitcher; // 0x680(0x08)
	struct UWidgetSwitcher* WidgetSwitcher; // 0x688(0x08)
	struct UWidgetSwitcher* WidgetSwitcher; // 0x690(0x08)
	struct UWidgetSwitcher* WidgetSwitcher; // 0x698(0x08)
	struct UWidgetSwitcher* WidgetSwitcher; // 0x6a0(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_Main; // 0x6a8(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_PerkUltimate; // 0x6b0(0x08)
	struct FInventoryItemInfo ItemInfo; // 0x6b8(0xb0)
	struct FBravoHotelWeaponInfo WeaponInfo; // 0x768(0xb80)
	bool bCompare; // 0x12e8(0x01)
	struct FSlateColor NormalSlateColor; // 0x12f0(0x28)
	struct FSlateColor UpSlateColor; // 0x1318(0x28)
	struct FSlateColor DownSlateColor; // 0x1340(0x28)
	struct FLinearColor UpLinearColor; // 0x1368(0x10)
	struct FLinearColor DownLinearColor; // 0x1378(0x10)
	struct ABravoHotelWeaponBase* WeaponObjectRef; // 0x1388(0x08)
	struct FInventoryItemDetailInfo ItemDetailInfo; // 0x1390(0x530)
	struct FPerkUIInfo PerkInfo; // 0x18c0(0x40)
	struct FPerkData PerkData; // 0x1900(0xf0)
	struct FName Ammo; // 0x19f0(0x0c)
	enum class ItemWidgetDragType DragType; // 0x19fc(0x01)
	struct UWidget* HoveredWidget; // 0x1a00(0x08)
	struct UUserWidget* CurrentShowingWidgetRef; // 0x1a08(0x08)
	bool IsUltimatePerk; // 0x1a10(0x01)
	struct FText UltimateName; // 0x1a18(0x18)
	struct FLinearColor UltimateLinearColor; // 0x1a30(0x10)
	struct TSoftObjectPtr<UObject> UltimateImage; // 0x1a40(0x30)
	struct FTimerHandle HoverTimerHandle; // 0x1a70(0x08)
	bool NeedCheckVisibility; // 0x1a78(0x01)
	bool IsVisualMode; // 0x1a79(0x01)
	bool IsRandomPerk; // 0x1a7a(0x01)
	struct TArray<struct UImage*> ItemRarityImages; // 0x1a80(0x10)
	struct TArray<struct UImage*> WeaponRarityImages; // 0x1a90(0x10)

	float GetDisplayAccuracy(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetDisplayAccuracy // (Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x2bad3b0
	float GetDisplayDamage(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetDisplayDamage // (Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x2bad3b0
	int32_t GetDisplayEffectiveRange(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetDisplayEffectiveRange // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x2bad3b0
	int32_t GetDisplayLevel(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetDisplayLevel // (Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x2bad3b0
	int32_t GetDisplayMagSize(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetDisplayMagSize // (Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x2bad3b0
	int32_t GetDisplayRateofFire(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetDisplayRateofFire // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x2bad3b0
	void SetPerkEnableMode(bool Enable, struct UUW-ImageText_C* ImageTextWidgetRef); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.SetPerkEnableMode // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void GetCurrentClassSpecialWeaponPerkData(bool& Find, struct FPerkData& OutPerkData); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetCurrentClassSpecialWeaponPerkData // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void SetCurrentPerkWeaponInfoSlot(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.SetCurrentPerkWeaponInfoSlot // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetTooltipSlot(enum class ItemWidgetDragType DragType, struct FText BuffInfo); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.SetTooltipSlot // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetVisualMode(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.SetVisualMode // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetBuffSlot(enum class ItemWidgetDragType DragType, struct FBravoHotelBuffUIInfo BuffInfo); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.SetBuffSlot // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetOptionSlot(enum class ItemWidgetDragType DragType, struct FItemOption ItemOptionInfo); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.SetOptionSlot // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetMaterialSlot(enum class ItemWidgetDragType DragType, struct FItemMaterialData MaterialInfo); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.SetMaterialSlot // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Hide(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Hide // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Show(struct UBravoHotelInventoryHoverWidget* HoverWidget, bool ShowItemDivideInfo, bool IsRandomPerk, bool& SUCCESS); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Show // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	enum class ESlateVisibility Get Vertical Box Buff List 2 Visibility(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Vertical Box Buff List 2 Visibility // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	enum class ESlateVisibility Get Buff List 1 Visibility(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Buff List 1 Visibility // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	enum class ESlateVisibility Get Size Box Comparing Text Visibility(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Size Box Comparing Text Visibility // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	enum class ESlateVisibility Get Vertical Box Combine Target Visibility(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Vertical Box Combine Target Visibility // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	enum class ESlateVisibility Get Item Slot- Description 1 Visibility(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Item Slot- Description 1 Visibility // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	enum class ESlateVisibility Get Visibility Item Divide(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Visibility Item Divide // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void GetItemWeaponData(struct FItemWeapon& ItemWeaponData); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetItemWeaponData // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x2bad3b0
	void SetBuffList(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.SetBuffList // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	enum class ESlateVisibility Get Horizontal Box Weapon Binded Info Visibility(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Horizontal Box Weapon Binded Info Visibility // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	struct FLinearColor Get Image Weapon Lock Color And Opacity(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Image Weapon Lock Color And Opacity // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	enum class ESlateVisibility Get Image Weapon Lock Visibility(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Image Weapon Lock Visibility // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void SetStatSlot(enum class EStatusType StatusType, int32_t Value, enum class ItemWidgetDragType DragType); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.SetStatSlot // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	struct FLinearColor Get_ItemBg_ColorAndOpacity(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get_ItemBg_ColorAndOpacity // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	struct FLinearColor Get Perk BG Color And Opacity(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Perk BG Color And Opacity // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	struct FLinearColor Get_ItemBg_01_ColorAndOpacity(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get_ItemBg_01_ColorAndOpacity // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void SetUltimatePerkDesc(int32_t ClasIndex); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.SetUltimatePerkDesc // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	struct FLinearColor GetSlotColor(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetSlotColor // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	struct FSlateColor Get Perk Name Color And Opacity(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Perk Name Color And Opacity // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	enum class ESlateVisibility Get Unlock Ultimate Level Visibility(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Unlock Ultimate Level Visibility // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void SetPerkDesc(int32_t Level, struct UUW-ImageText_C* ImageTextWidgetRef, int32_t ClassIndex); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.SetPerkDesc // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetPerksDesc(int32_t ClassIndex); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.SetPerksDesc // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void HideHover(enum class ItemWidgetDragType DragType, bool Force); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.HideHover // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	struct FSlateBrush Get Perk Image Brush(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Perk Image Brush // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	struct FText Get Perk Name Text(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Perk Name Text // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void SetPerkSlot(struct FPerkUIInfo NewPerkInfo, enum class ItemWidgetDragType DragType, bool IsUltimatePerk, int32_t ClassIndex); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.SetPerkSlot // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	struct FText Get_WeaponItemCapacity_Text(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get_WeaponItemCapacity_Text // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	struct FText Get_ItemSlot-Capacity_Text(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get_ItemSlot-Capacity_Text // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void GetItemType(struct FText& ItemTypeText, struct UTexture2D*& ItemTypeTexture); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetItemType // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	struct FText Get Item Slot- Item Type Text(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Item Slot- Item Type Text // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	struct FText Get Weapon Item Type Text(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Weapon Item Type Text // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void GetWeaponType(enum class EWeaponType& WeaponType, struct FText& WeaponTypeText, struct UTexture2D*& WeaponTypeTexture); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetWeaponType // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void GetEquippedWeaponInfoByWeaponType(enum class EWeaponType WeaponType, bool& bResult, struct FBravoHotelWeaponInfo& WeaponInfo); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetEquippedWeaponInfoByWeaponType // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	struct FText Get Weapon Item Comparing Name Text(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Weapon Item Comparing Name Text // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	struct FText Get Ammo Info Text(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Ammo Info Text // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	struct FSlateBrush Get Ammo Icon Brush(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Ammo Icon Brush // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void GetCompareAmmo(struct FSlateColor& SlateColor, struct FText& valueText); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetCompareAmmo // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void GetCompareFiringRate(struct FSlateColor& SlateColor, struct FText& valueText); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetCompareFiringRate // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void GetCompareStabillity(struct FSlateColor& SlateColor, struct FText& valueText); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetCompareStabillity // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void GetCompareEffectiveRange(struct FSlateColor& SlateColor, struct FText& valueText); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetCompareEffectiveRange // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void GetComparePower(struct FSlateColor& SlateColor, struct FText& valueText); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetComparePower // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	struct FText Get Ammo Value Text(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Ammo Value Text // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	struct FText Get Firing Rate Value Text(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Firing Rate Value Text // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	struct FText Get Stability Value Text(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Stability Value Text // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	struct FText Get Effective Range Value Text(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Effective Range Value Text // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	struct FText Get Power Value Text(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Power Value Text // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void IsWeaponTooltip(bool& bResult); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.IsWeaponTooltip // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void IsItemTooltip(bool& bResult); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.IsItemTooltip // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void GetHoverCanvas(struct UCanvasPanel*& CanvasPanel, bool& bResult); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetHoverCanvas // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void SetWeaponItemSlot(struct FBravoHotelWeaponInfo WeaponItemInfo, struct FInventoryItemInfo InventoryItemInfo, enum class ItemWidgetDragType DragType, struct FName Ammo); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.SetWeaponItemSlot // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	struct FText Get Weapon Item Slot- Description Text(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Weapon Item Slot- Description Text // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	struct FSlateBrush Get Weapon Item Slot- Item Image Brush(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Weapon Item Slot- Item Image Brush // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	struct FText Get Weapon Item Slot- Item Name Text(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Get Weapon Item Slot- Item Name Text // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void SetItemSlotInfo(struct FInventoryItemInfo InventoryItem, enum class ItemWidgetDragType DragType); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.SetItemSlotInfo // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Show Hover(struct UWidget* HoveredWidget, struct UUserWidget* ShowingWidgetRef, bool& SUCCESS); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Show Hover // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	struct FText GetWeight(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetWeight // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	struct FText GetDescription(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetDescription // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	struct FSlateBrush GetItemImage(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetItemImage // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	struct FText GetName(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetName // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void OnLoaded_5CB0A85D41BD4B88F0EAB29CA9DBDD0F(struct UObject* Loaded); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.OnLoaded_5CB0A85D41BD4B88F0EAB29CA9DBDD0F // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnLoaded_A317A42643FCC3E3348F00AF47100D7C(struct UObject* Loaded); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.OnLoaded_A317A42643FCC3E3348F00AF47100D7C // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnLoaded_BF365972409319D445BAF88D964EE916(struct UObject* Loaded); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.OnLoaded_BF365972409319D445BAF88D964EE916 // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnLoaded_90972E92490A36CFBC0DC4AD6ACA1B48(struct UObject* Loaded); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.OnLoaded_90972E92490A36CFBC0DC4AD6ACA1B48 // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void AsyncLoadIconTexture(struct TSoftObjectPtr<UPaperSprite> IconTexture); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.AsyncLoadIconTexture // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void DelayDestroy(float Delay); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.DelayDestroy // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void AsyncLoadIconObject(struct TSoftObjectPtr<UObject> IconObject); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.AsyncLoadIconObject // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void AsyncLoadStatIcon(struct TSoftObjectPtr<UObject> IconObject); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.AsyncLoadStatIcon // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Construct(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void HideHoverBP(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.HideHoverBP // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void CheckHoverVisibility(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.CheckHoverVisibility // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void AsyncLoadMaterialIcon(struct TSoftObjectPtr<UObject> IconObject); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.AsyncLoadMaterialIcon // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ExecuteUbergraph_UW-Inventory_ItemSlotHover(int32_t EntryPoint); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.ExecuteUbergraph_UW-Inventory_ItemSlotHover // (Final|UbergraphFunction|HasDefaults) // @ game+0x2bad3b0
};

