// WidgetBlueprintGeneratedClass UW-Inventory_Perk.UW-Inventory_Perk_C
// Size: 0x2cff6a79 (Inherited: 0x2cff6ac0)
struct UUW-Inventory_Perk_C : UBravoHotelInventoryPerkWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3c0(0x08)
	struct UWidgetAnimation* HideFreeChangeDeck; // 0x3c8(0x08)
	struct UWidgetAnimation* ShowFreeChangeDeck; // 0x3d0(0x08)
	struct UWidgetAnimation* ShowRecipeLockNoti; // 0x3d8(0x08)
	struct UWidgetAnimation* Anim_Glow; // 0x3e0(0x08)
	struct UWidgetAnimation* HideFreeSupply; // 0x3e8(0x08)
	struct UWidgetAnimation* ShowFreeSupply; // 0x3f0(0x08)
	struct UWidgetAnimation* LevelUp; // 0x3f8(0x08)
	struct UWidgetAnimation* Ability_Defense; // 0x400(0x08)
	struct UWidgetAnimation* Ability_Speed; // 0x408(0x08)
	struct UWidgetAnimation* Ability_Power; // 0x410(0x08)
	struct UWidgetAnimation* Survive_FadeInOut; // 0x418(0x08)
	struct UWidgetAnimation* Anim_LevelUpDefense; // 0x420(0x08)
	struct UWidgetAnimation* Anim_LevelUpSpeed; // 0x428(0x08)
	struct UWidgetAnimation* Anim_LevelUpPower; // 0x430(0x08)
	struct UVerticalBox* BluePerk_VerticalBox; // 0x438(0x08)
	struct UButton* Btn_CoolTimeReset; // 0x440(0x08)
	struct UButton* btn_ItemTree; // 0x448(0x08)
	struct UButton* btn_PerkDeckDisabled; // 0x450(0x08)
	struct UButton* btn_PerkDeckDisabled; // 0x458(0x08)
	struct UButton* btn_PerkDeckEnabled; // 0x460(0x08)
	struct UButton* btn_PerkDeckEnabled; // 0x468(0x08)
	struct UButton* Btn_SkillReset; // 0x470(0x08)
	struct UCanvasPanel* Canvas_BG; // 0x478(0x08)
	struct UCanvasPanel* Canvas_ChangeClass; // 0x480(0x08)
	struct UCanvasPanel* Canvas_ChangeDisable; // 0x488(0x08)
	struct UCanvasPanel* Canvas_ChangeDisable; // 0x490(0x08)
	struct UCanvasPanel* Canvas_ChangeEnable; // 0x498(0x08)
	struct UCanvasPanel* Canvas_ChangeEnable; // 0x4a0(0x08)
	struct UCanvasPanel* Canvas_ChangeSupply; // 0x4a8(0x08)
	struct UCanvasPanel* Canvas_ClassButton; // 0x4b0(0x08)
	struct UCanvasPanel* Canvas_CoolTImeReset; // 0x4b8(0x08)
	struct UCanvasPanel* Canvas_LevelupEffect; // 0x4c0(0x08)
	struct UCanvasPanel* Canvas_Main; // 0x4c8(0x08)
	struct UCanvasPanel* Canvas_Perk; // 0x4d0(0x08)
	struct UCanvasPanel* Canvas_SkillReset; // 0x4d8(0x08)
	struct UCanvasPanel* Canvas_SupplyButton; // 0x4e0(0x08)
	struct UCanvasPanel* Canvas_UltimateEffect; // 0x4e8(0x08)
	struct UCanvasPanel* Canvas_UltimateLightEffect; // 0x4f0(0x08)
	struct UVerticalBox* GreenPerk_VerticalBox; // 0x4f8(0x08)
	struct UHorizontalBox* HorizontalBox; // 0x500(0x08)
	struct UHorizontalBox* HorizontalBox; // 0x508(0x08)
	struct UHorizontalBox* HorizontalBox_Stat; // 0x510(0x08)
	struct UHorizontalBox* HorizontalBox_UnlockLevel; // 0x518(0x08)
	struct UImage* Image; // 0x520(0x08)
	struct UImage* Image; // 0x528(0x08)
	struct UImage* Image; // 0x530(0x08)
	struct UImage* Image; // 0x538(0x08)
	struct UImage* Image; // 0x540(0x08)
	struct UImage* Image; // 0x548(0x08)
	struct UImage* Image; // 0x550(0x08)
	struct UImage* Image; // 0x558(0x08)
	struct UImage* Image; // 0x560(0x08)
	struct UImage* Image; // 0x568(0x08)
	struct UImage* Image; // 0x570(0x08)
	struct UImage* Image; // 0x578(0x08)
	struct UImage* Image; // 0x580(0x08)
	struct UImage* Image; // 0x588(0x08)
	struct UImage* Image; // 0x590(0x08)
	struct UImage* Image; // 0x598(0x08)
	struct UImage* Image; // 0x5a0(0x08)
	struct UImage* Image; // 0x5a8(0x08)
	struct UImage* Image; // 0x5b0(0x08)
	struct UImage* Image; // 0x5b8(0x08)
	struct UImage* Image; // 0x5c0(0x08)
	struct UImage* Image; // 0x5c8(0x08)
	struct UImage* Image_Cycle; // 0x5d0(0x08)
	struct UImage* Image_Cycle; // 0x5d8(0x08)
	struct UImage* IMG_ClassIcon; // 0x5e0(0x08)
	struct UImage* IMG_PerkDeckIcon; // 0x5e8(0x08)
	struct UImage* IMG_Supply; // 0x5f0(0x08)
	struct UImage* IMG_UltimatedSkill; // 0x5f8(0x08)
	struct UKeyImageWidget_C* KeyImageWidget; // 0x600(0x08)
	struct UCanvasPanel* NotEnoughGold; // 0x608(0x08)
	struct UOverlay* Over_Ultimate; // 0x610(0x08)
	struct UOverlay* Overlay_Blue; // 0x618(0x08)
	struct UOverlay* Overlay_Green; // 0x620(0x08)
	struct UOverlay* Overlay_Red; // 0x628(0x08)
	struct UOverlay* Overlay_UltimateKey; // 0x630(0x08)
	struct UVerticalBox* RedPerk_VerticalBox; // 0x638(0x08)
	struct URichTextBlock* RichTextBlock; // 0x640(0x08)
	struct UScrollBox* ScrollBox_BluePerk; // 0x648(0x08)
	struct UScrollBox* ScrollBox_GreenPerk; // 0x650(0x08)
	struct UScrollBox* ScrollBox_RedPerk; // 0x658(0x08)
	struct USpacer* Spacer; // 0x660(0x08)
	struct USpacer* Spacer_Y2; // 0x668(0x08)
	struct UTextBlock* T_ClassName; // 0x670(0x08)
	struct UTextBlock* T_Defense; // 0x678(0x08)
	struct UTextBlock* T_DefenseAnim; // 0x680(0x08)
	struct UTextBlock* T_Power; // 0x688(0x08)
	struct UTextBlock* T_PowerAnim; // 0x690(0x08)
	struct UTextBlock* T_Speed; // 0x698(0x08)
	struct UTextBlock* T_SpeedAnim; // 0x6a0(0x08)
	struct UTextBlock* T_UltimateName; // 0x6a8(0x08)
	struct UTextBlock* T_UnlockLevel; // 0x6b0(0x08)
	struct UTextBlock* T_UnlockLevel2; // 0x6b8(0x08)
	struct UTextBlock* T_WeaponName; // 0x6c0(0x08)
	struct UTextBlock* TextBlock; // 0x6c8(0x08)
	struct UTextBlock* TextBlock; // 0x6d0(0x08)
	struct UTextBlock* TextBlock; // 0x6d8(0x08)
	struct UTextBlock* TextBlock; // 0x6e0(0x08)
	struct UTextBlock* TextBlock_ClassLevel; // 0x6e8(0x08)
	struct UTextBlock* TextBlock_Count_Blue; // 0x6f0(0x08)
	struct UTextBlock* TextBlock_Count_Green; // 0x6f8(0x08)
	struct UTextBlock* TextBlock_Count_Red; // 0x700(0x08)
	struct UTextBlock* TextBlock_Defense; // 0x708(0x08)
	struct UTextBlock* TextBlock_Power; // 0x710(0x08)
	struct UTextBlock* TextBlock_Price; // 0x718(0x08)
	struct UTextBlock* TextBlock_Price; // 0x720(0x08)
	struct UTextBlock* TextBlock_Select; // 0x728(0x08)
	struct UTextBlock* TextBlock_Select; // 0x730(0x08)
	struct UTextBlock* TextBlock_Speed; // 0x738(0x08)
	struct UTextBlock* TextBlock_SurviveMessage01; // 0x740(0x08)
	struct UTextBlock* TextBlock_SurviveMessage02; // 0x748(0x08)
	struct UTextBlock* TextBlock_UltimateDesc; // 0x750(0x08)
	struct UEditableTextBox* TextBox_CoolTimeReset; // 0x758(0x08)
	struct UEditableTextBox* TextBox_SkillReset; // 0x760(0x08)
	struct UCanvasPanel* TrainingSkillGuide; // 0x768(0x08)
	struct UImage* UltiLight_001; // 0x770(0x08)
	struct UImage* UltiLight_002; // 0x778(0x08)
	struct UImage* UltiLight_003; // 0x780(0x08)
	struct UUniformGridPanel* UniformGridPanel_Blue; // 0x788(0x08)
	struct UUniformGridPanel* UniformGridPanel_Green; // 0x790(0x08)
	struct UUniformGridPanel* UniformGridPanel_Red; // 0x798(0x08)
	struct UUW-FreeTicket_C* UW-FreeTicket_ChangeDeck; // 0x7a0(0x08)
	struct UUW-FreeTicket_C* UW-FreeTicket_Supply; // 0x7a8(0x08)
	struct UUW-Inventory_CarriedSlot_C* UW-Inventory_CarriedSlot; // 0x7b0(0x08)
	struct UUW-Inventory_PerkSlot_C* UW-Inventory_PerkSlot; // 0x7b8(0x08)
	struct UUW-Inventory_PerkSlot_C* UW-Inventory_PerkSlot; // 0x7c0(0x08)
	struct UUW-Inventory_PerkSlot_C* UW-Inventory_PerkSlot; // 0x7c8(0x08)
	struct UUW-Inventory_PerkSlot_C* UW-Inventory_PerkSlot; // 0x7d0(0x08)
	struct UUW-Inventory_PerkSlot_C* UW-Inventory_PerkSlot; // 0x7d8(0x08)
	struct UUW-Inventory_PerkSlot_C* UW-Inventory_PerkSlot; // 0x7e0(0x08)
	struct UUW-Inventory_PerkSlot_C* UW-Inventory_PerkSlot; // 0x7e8(0x08)
	struct UUW-Inventory_PerkSlot_C* UW-Inventory_PerkSlot; // 0x7f0(0x08)
	struct UUW-Inventory_PerkSlot_C* UW-Inventory_PerkSlot; // 0x7f8(0x08)
	struct UUW-TournamentInfo_C* UW-TournamentInfo; // 0x800(0x08)
	struct UVerticalBox* VB_Health; // 0x808(0x08)
	struct UVerticalBox* VB_Power; // 0x810(0x08)
	struct UVerticalBox* VB_Speed; // 0x818(0x08)
	struct UVerticalBox* VerticalBox_Blue; // 0x820(0x08)
	struct UVerticalBox* VerticalBox_Green; // 0x828(0x08)
	struct UVerticalBox* VerticalBox_Red; // 0x830(0x08)
	struct UVerticalBox* VerticalBox_Title; // 0x838(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_ChangeClass; // 0x840(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_ChangeSupply; // 0x848(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_TreeAndClass; // 0x850(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_Ultimate; // 0x858(0x08)
	struct FName CurrentPerkDeckName; // 0x860(0x0c)
	struct TArray<struct UUW-Inventory_PerkSlot_C*> CurrentPerkInfos; // 0x870(0x10)
	struct FName ExpertWeaponKey; // 0x880(0x0c)
	int32_t PerkMode; // 0x88c(0x04)
	struct UUW-Inventory_ItemSlotHover_C* HoverWidget; // 0x890(0x08)
	int32_t PowerValue; // 0x898(0x04)
	struct FTimerHandle TimerHandle_Power; // 0x8a0(0x08)
	int32_t SpeedValue; // 0x8a8(0x04)
	struct FTimerHandle TimerHandle_Speed; // 0x8b0(0x08)
	int32_t DefenseValue; // 0x8b8(0x04)
	struct FTimerHandle TimerHandle_Defense; // 0x8c0(0x08)
	bool bPlayAbilityCountSoundStart; // 0x8c8(0x01)
	bool bPlayAbilityCountSoundEnd; // 0x8c9(0x01)
	struct UAkAudioEvent* LevelUpSound; // 0x8d0(0x08)
	bool EnableSupplyBtn; // 0x8d8(0x01)
	struct FTimerHandle FreeSupplyTimer; // 0x8e0(0x08)
	struct FTimerHandle NotEnoughtGoldTimer; // 0x8e8(0x08)
	struct TArray<struct UUW-ListWidget_GainPerk_C*> GainPerkPopups; // 0x8f0(0x10)
	bool IsPlayingUltimateSound; // 0x900(0x01)
	int32_t LastLevel; // 0x904(0x04)
	struct FPerkDeckClassInfo PerkDeckClassInfo; // 0x908(0x30)
	struct TArray<float> CurrentPerkRandList; // 0x938(0x10)
	struct FMulticastInlineDelegate ActivatePerkSlotChange; // 0x948(0x10)
	int32_t CoolTimeBuffIndex; // 0x958(0x04)
	bool bIsNoCoolTime; // 0x95c(0x01)
	struct FTimerHandle CompleteRecipeLock; // 0x960(0x08)
	bool EnableCompleteRecipeLockAnimation; // 0x968(0x01)
	bool bIsInPerkDeck; // 0x969(0x01)
	struct FTimerHandle FreeChangeDeckTimer; // 0x970(0x08)
	bool IsShowTournamentTime; // 0x978(0x01)

	void SequenceEvent__ENTRYPOINTUW-Inventory_Perk(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.SequenceEvent__ENTRYPOINTUW-Inventory_Perk // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SequenceEvent__ENTRYPOINTUW-Inventory_Perk(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.SequenceEvent__ENTRYPOINTUW-Inventory_Perk // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetPerkSlotNotTouchable(struct FName CurrentClickedPerkName, struct UUW-Inventory_PerkSlot_C* CurrentPerkSlot, struct FName NewPerkSlotName); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.SetPerkSlotNotTouchable // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void InitCanvasPanel_Training(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.InitCanvasPanel_Training // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Reset Perk Skill Scroll Box(struct UUW-Inventory_PerkSlot_C* CurrentPerkSlot); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.Reset Perk Skill Scroll Box // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Get Changable Perk Skill List(struct TArray<struct FName>& NewParam); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.Get Changable Perk Skill List // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Create Random Perk Skill List(struct FName CurrentPerkName); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.Create Random Perk Skill List // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Set Perk Slot in Perk Deck(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.Set Perk Slot in Perk Deck // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void RemoveAllPerkSlotFxWidgets(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.RemoveAllPerkSlotFxWidgets // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void InitPerkSlotFxWidgets(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.InitPerkSlotFxWidgets // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetEnabledInvalidationbox(bool Enabled); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.SetEnabledInvalidationbox // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ResetUltimateSound(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.ResetUltimateSound // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnChangedToggleType(enum class EToggleWidgetModeType ToggleType); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.OnChangedToggleType // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnBattleRoyaleStateChanged(enum class EBattleRoyaleState PreviousState, enum class EBattleRoyaleState CurrentState); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.OnBattleRoyaleStateChanged // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void UpdateStatsInfo(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.UpdateStatsInfo // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	struct FEventReply OnMouseButtonDown(struct FGeometry MyGeometry, struct FPointerEvent& MouseEvent); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.OnMouseButtonDown // (BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetUltimateSkillKeyIcon(struct TArray<enum class EKeySettingType>& Type); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.SetUltimateSkillKeyIcon // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void PlayAbilityCountSoundEnd(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.PlayAbilityCountSoundEnd // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void PlayAbilityCountSoundStart(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.PlayAbilityCountSoundStart // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ShowStatusHovered(struct UWidget* InHoveredWidget); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.ShowStatusHovered // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetAbilityAnimation(struct FTimerHandle& Handle, int32_t Value, struct UWidgetAnimation* Animation, struct FString FunctionName, int32_t Index); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.SetAbilityAnimation // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void InitAnimation(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.InitAnimation // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void DefenseCountAnimation(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.DefenseCountAnimation // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SpeedCountAnimation(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.SpeedCountAnimation // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void PowerCountAnimation(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.PowerCountAnimation // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void PlaySoundBonusLevelUp(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.PlaySoundBonusLevelUp // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void PlaySoundTimeBonus(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.PlaySoundTimeBonus // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void GetPositionTargetPerk(enum class EPerkSlotFlag PerkSlot, int32_t PerkIndex, bool& Result, struct FVector2D& Position); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.GetPositionTargetPerk // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void GetSlotAndIndexTargetPerk(struct FName TargetPerkName, bool& HasPerk, enum class EPerkSlotFlag& PerkSlot, int32_t& PerkIndex); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.GetSlotAndIndexTargetPerk // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void AddUltimateSkillUnlockEffect(int32_t CurrentLevel); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.AddUltimateSkillUnlockEffect // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ResetPerkCells(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.ResetPerkCells // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetClassLevelText(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.SetClassLevelText // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void PerkLevelUpEffect(struct FPerkUIInfo PerkInfo, int32_t CurrentLevel); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.PerkLevelUpEffect // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetPerkdeckWidget(bool State); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.SetPerkdeckWidget // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ShowUltimatePerk(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.ShowUltimatePerk // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void PlayStatsLevelUpAnim(struct FDisplayAbility IncreasedAbility); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.PlayStatsLevelUpAnim // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void PlayLevelTextAnim(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.PlayLevelTextAnim // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void CheckUltimateOpen(int32_t CurrentLevel); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.CheckUltimateOpen // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void PerkLevelUp(struct FPerkUIInfo PerkInfo, int32_t CurrentLevel, int32_t LastLevel, bool& UltimateSound); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.PerkLevelUp // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetUltimateSkillInfo(bool UseLocalPlayerInfo, bool IsMaxLevel); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.SetUltimateSkillInfo // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetPriceFontColor(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.SetPriceFontColor // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	struct FText Get_TextBlock_Price_Text(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.Get_TextBlock_Price_Text // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void CreatePerkDeck(bool UseLocalPlayerInfo, bool IsMaxLevel); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.CreatePerkDeck // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Set Perks(struct UUW-Inventory_ItemSlotHover_C* HoverWidget, bool bUseLocalPlayerInfo, bool bMaxLevel, bool bPerkDeckMode, struct FPerkDeckClassInfo PerkDeckClassInfo); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.Set Perks // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnLoaded_99DDE97542548A0CC17B5FBAD209C3DD(struct UObject* Loaded); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.OnLoaded_99DDE97542548A0CC17B5FBAD209C3DD // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnLoaded_4F86CE894B71E485811BFEA8F94AD46E(struct UObject* Loaded); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.OnLoaded_4F86CE894B71E485811BFEA8F94AD46E // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnLoaded_9E0A9EF44F73119D77D7119DEA0EF67A(struct UObject* Loaded); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.OnLoaded_9E0A9EF44F73119D77D7119DEA0EF67A // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__btn_PerkDeck_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.BndEvt__btn_PerkDeck_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__btn_PerkDeck_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.BndEvt__btn_PerkDeck_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__btn_PerkDeck_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.BndEvt__btn_PerkDeck_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void Destruct(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.Destruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void Construct(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void AsyncLoadIcon(struct TSoftObjectPtr<UObject> Image); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.AsyncLoadIcon // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void AsyncCohIcon(struct TSoftObjectPtr<UObject> Image); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.AsyncCohIcon // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void PlayReadyGivePerk(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.PlayReadyGivePerk // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void StopReadyGivePerk(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.StopReadyGivePerk // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void AsyncClassIcon(struct TSoftObjectPtr<UObject> Image); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.AsyncClassIcon // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void AbilityPowerAnimationFinished(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.AbilityPowerAnimationFinished // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void AbilitySpeedAnimationFinished(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.AbilitySpeedAnimationFinished // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void LevelUpAnimationFinished(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.LevelUpAnimationFinished // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void PlayKillGivePerk(int32_t KillCount); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.PlayKillGivePerk // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnHoveredWidget(struct UWidget* HoveredWidget); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.OnHoveredWidget // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void AbilityDefenseAnimationFinished(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.AbilityDefenseAnimationFinished // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__btn_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.BndEvt__btn_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__btn_PerkDeckDisabled_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.BndEvt__btn_PerkDeckDisabled_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__btn_PerkDeckEnabled_1_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.BndEvt__btn_PerkDeckEnabled_1_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void  »¤ìŠ¤(enum class EBattleRoyaleState PrevState, enum class EBattleRoyaleState CurrentState); // Function UW-Inventory_Perk.UW-Inventory_Perk_C. »¤ìŠ¤ // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void CheckFree(bool IsInventoryOpen); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.CheckFree // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void  »¤ìŠ¤(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C. »¤ìŠ¤ // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void StartUltimateAnim(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.StartUltimateAnim // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void UpdateUnlockLevel(int32_t NewLevel); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.UpdateUnlockLevel // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void  »¤ìŠ¤(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C. »¤ìŠ¤ // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetEnoughGold(bool IsEnough); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.SetEnoughGold // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Btn_SkillReset_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.BndEvt__Btn_SkillReset_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Btn_CoolTimeReset_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.BndEvt__Btn_CoolTimeReset_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void PlayerLevelChanged(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.PlayerLevelChanged // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void CheckCompleteRecipeLock(int32_t InventoryIndex); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.CheckCompleteRecipeLock // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void InitCompleteRecipeLock(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.InitCompleteRecipeLock // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void  »¤ìŠ¤(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C. »¤ìŠ¤ // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void CustomEvent(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.CustomEvent // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void CheckTournamentNoti(bool Result, struct FTournamentNotiInfo TournamentNotiInfo); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.CheckTournamentNoti // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ExecuteUbergraph_UW-Inventory_Perk(int32_t EntryPoint); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.ExecuteUbergraph_UW-Inventory_Perk // (Final|UbergraphFunction|HasDefaults) // @ game+0x2bad3b0
	void ActivatePerkSlotChange__DelegateSignature(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.ActivatePerkSlotChange__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
};

