// WidgetBlueprintGeneratedClass UW-Lobby_WeaponInfo_Stat.UW-Lobby_WeaponInfo_Stat_C
// Size: 0x2cff6b00 (Inherited: 0x2cff6a88)
struct UUW-Lobby_WeaponInfo_Stat_C : UUserWidget {
	struct UImage* Image; // 0x288(0x08)
	struct UImage* Image; // 0x290(0x08)
	struct UImage* Image; // 0x298(0x08)
	struct UImage* Image; // 0x2a0(0x08)
	struct UImage* Image; // 0x2a8(0x08)
	struct UImage* Image; // 0x2b0(0x08)
	struct UImage* Image; // 0x2b8(0x08)
	struct UImage* Image; // 0x2c0(0x08)
	struct UImage* Image; // 0x2c8(0x08)
	struct UImage* Image; // 0x2d0(0x08)
	struct UTextBlock* T_Accuracy; // 0x2d8(0x08)
	struct UTextBlock* T_EffectiveRange; // 0x2e0(0x08)
	struct UTextBlock* T_FireRate; // 0x2e8(0x08)
	struct UTextBlock* T_MagSize; // 0x2f0(0x08)
	struct UTextBlock* T_Power; // 0x2f8(0x08)

	void SetWeaponStat(struct FBravoHotelWeaponInfo& WeaponInfo); // Function UW-Lobby_WeaponInfo_Stat.UW-Lobby_WeaponInfo_Stat_C.SetWeaponStat // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
};

