// WidgetBlueprintGeneratedClass UW-Lobby_WeaponInfo_RandomOption.UW-Lobby_WeaponInfo_RandomOption_C
// Size: 0x2cff6ae8 (Inherited: 0x2cff6a88)
struct UUW-Lobby_WeaponInfo_RandomOption_C : UUserWidget {
	struct UTextBlock* T_Desc; // 0x288(0x08)
	struct UUW-Lobby_WeaponInfo_Option_Slot_Icon_C* UW-Lobby_WeaponInfo_Buff; // 0x290(0x08)
	struct UUW-Lobby_WeaponInfo_Option_Slot_Icon_C* UW-Lobby_WeaponInfo_Buff; // 0x298(0x08)
	struct UUW-Lobby_WeaponInfo_Option_Slot_Icon_C* UW-Lobby_WeaponInfo_Buff; // 0x2a0(0x08)
	struct UUW-Lobby_WeaponInfo_Option_Slot_Icon_C* UW-Lobby_WeaponInfo_Buff; // 0x2a8(0x08)
	struct UUW-Lobby_WeaponInfo_Option_Slot_Icon_C* UW-Lobby_WeaponInfo_Buff; // 0x2b0(0x08)
	struct UUW-Lobby_WeaponInfo_Option_Slot_Icon_C* UW-Lobby_WeaponInfo_Buff; // 0x2b8(0x08)
	struct UUW-Lobby_WeaponInfo_Option_Slot_Icon_C* UW-Lobby_WeaponInfo_Buff; // 0x2c0(0x08)
	struct UUW-Lobby_WeaponInfo_Option_Slot_Icon_C* UW-Lobby_WeaponInfo_Buff; // 0x2c8(0x08)
	struct UUW-Lobby_WeaponInfo_Option_Slot_Icon_C* UW-Lobby_WeaponInfo_Buff; // 0x2d0(0x08)
	struct UUW-Lobby_WeaponInfo_Option_Slot_Icon_C* UW-Lobby_WeaponInfo_Buff; // 0x2d8(0x08)
	struct UWrapBox* WrapBox_Options; // 0x2e0(0x08)

	void SetRandomOptionDesc(struct FText Desc); // Function UW-Lobby_WeaponInfo_RandomOption.UW-Lobby_WeaponInfo_RandomOption_C.SetRandomOptionDesc // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetOptions(struct TArray<int32_t>& OptionIDList); // Function UW-Lobby_WeaponInfo_RandomOption.UW-Lobby_WeaponInfo_RandomOption_C.SetOptions // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
};

