// WidgetBlueprintGeneratedClass UW-MatchEnd_Animation.UW-MatchEnd_Animation_C
// Size: 0x2cff6a99 (Inherited: 0x2cff6a88)
struct UUW-MatchEnd_Animation_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x288(0x08)
	struct UWidgetAnimation* Infos_ani; // 0x290(0x08)
	struct UWidgetAnimation* SimpleResult_Events; // 0x298(0x08)
	struct UWidgetAnimation* Lose_ani; // 0x2a0(0x08)
	struct UWidgetAnimation* Win_ani; // 0x2a8(0x08)
	struct UWidgetAnimation* Lose_Events; // 0x2b0(0x08)
	struct UWidgetAnimation* Win_Events; // 0x2b8(0x08)
	struct UTextBlock* ClassName; // 0x2c0(0x08)
	struct UTextBlock* ClassWeaponName; // 0x2c8(0x08)
	struct UTextBlock* HeadShot; // 0x2d0(0x08)
	struct UHorizontalBox* HorizontalBox_KillerWeaponInfo; // 0x2d8(0x08)
	struct UHorizontalBox* HorizontalBox_Rarity; // 0x2e0(0x08)
	struct UImage* Icon_KillerClass; // 0x2e8(0x08)
	struct UImage* Image; // 0x2f0(0x08)
	struct UImage* Image; // 0x2f8(0x08)
	struct UTextBlock* Level; // 0x300(0x08)
	struct UTextBlock* LoseMessage; // 0x308(0x08)
	struct UOverlay* Overlay_DropItems; // 0x310(0x08)
	struct UOverlay* Overlay_KillerInfo; // 0x318(0x08)
	struct UOverlay* Overlay_WeaponLevel; // 0x320(0x08)
	struct UTextBlock* T_DamageType; // 0x328(0x08)
	struct UTextBlock* T_WeaponLevel; // 0x330(0x08)
	struct UTextBlock* TextBlock_ItemCount; // 0x338(0x08)
	struct UUniformGridPanel* Uniform_ItemList; // 0x340(0x08)
	struct UTextBlock* UserName; // 0x348(0x08)
	struct UUW-MatchEnd_RewardSlot_C* UW-MatchEnd_RewardSlot_C; // 0x350(0x08)
	struct UUW-MatchEnd_ButtonBase_C* UW-SkipButton; // 0x358(0x08)
	struct UTextBlock* WeaponName; // 0x360(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_DamageCauser; // 0x368(0x08)
	struct FMatchEndAnimation AnimationData; // 0x370(0x03)
	struct UUW-MatchEndWidget_C* MatchEndWidgetRef; // 0x378(0x08)
	struct FMatchEndSimpleResult SimpleResult; // 0x380(0x218)
	bool MatchEnd; // 0x598(0x01)

	void SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetDropedItem(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.SetDropedItem // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void UpdateInputMode(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.UpdateInputMode // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void RemoveOverlapedWidgets(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.RemoveOverlapedWidgets // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void HideHUDMessageWidget(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.HideHUDMessageWidget // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetSimpleResult(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.SetSimpleResult // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetMatchEnd(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.SetMatchEnd // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetKillerInfo(struct FMatchEndSimpleResult& Result); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.SetKillerInfo // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ReleaseSlomo(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.ReleaseSlomo // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ApplySlomo(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.ApplySlomo // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void PlayWidgetLoseAni(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.PlayWidgetLoseAni // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void PlayWidgetWinAni(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.PlayWidgetWinAni // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SkipMatchEndAnimation(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.SkipMatchEndAnimation // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void PlayCharacterWinAnimation(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.PlayCharacterWinAnimation // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void PlayDefeatBGM(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.PlayDefeatBGM // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void PlayWinBGM(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.PlayWinBGM // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnLoaded_75D3BA16496147EA282F81A6BD982AD6(struct UObject* Loaded); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.OnLoaded_75D3BA16496147EA282F81A6BD982AD6 // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Construct(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void Destruct(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.Destruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void AsyncIcon(struct TSoftObjectPtr<UObject> Image); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.AsyncIcon // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnClicked_SkipButton(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.OnClicked_SkipButton // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void DelegateOnWhoKilledMe_Event(struct FMatchEndSimpleResult& SimpleResult); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.DelegateOnWhoKilledMe_Event // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Tick(struct FGeometry MyGeometry, float InDeltaTime); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.Tick // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void  »¤ìŠ¤(); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C. »¤ìŠ¤ // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ExecuteUbergraph_UW-MatchEnd_Animation(int32_t EntryPoint); // Function UW-MatchEnd_Animation.UW-MatchEnd_Animation_C.ExecuteUbergraph_UW-MatchEnd_Animation // (Final|UbergraphFunction|HasDefaults) // @ game+0x2bad3b0
};

