// WidgetBlueprintGeneratedClass UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C
// Size: 0x2cff6a28 (Inherited: 0x2cff6a88)
struct UUW-MatchEnd_Animation_02_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x288(0x08)
	struct UWidgetAnimation* Anim_Defeat_Tournament; // 0x290(0x08)
	struct UWidgetAnimation* Anim_Second_Tournament; // 0x298(0x08)
	struct UWidgetAnimation* Anim_TournamentVictory; // 0x2a0(0x08)
	struct UWidgetAnimation* Anim_DamageList; // 0x2a8(0x08)
	struct UWidgetAnimation* Event2; // 0x2b0(0x08)
	struct UWidgetAnimation* Event; // 0x2b8(0x08)
	struct UWidgetAnimation* Anim_Second; // 0x2c0(0x08)
	struct UWidgetAnimation* Hide; // 0x2c8(0x08)
	struct UWidgetAnimation* Infos_ani; // 0x2d0(0x08)
	struct UWidgetAnimation* Anim_Defeat; // 0x2d8(0x08)
	struct UWidgetAnimation* Anim_Victory; // 0x2e0(0x08)
	struct UImage* Arrow; // 0x2e8(0x08)
	struct UImage* Arrow; // 0x2f0(0x08)
	struct UImage* Arrow; // 0x2f8(0x08)
	struct UImage* ArrowLine; // 0x300(0x08)
	struct UImage* ArrowLine; // 0x308(0x08)
	struct UImage* ArrowLine; // 0x310(0x08)
	struct UBackgroundBlur* BackgroundBlur; // 0x318(0x08)
	struct UBackgroundBlur* BackgroundBlur; // 0x320(0x08)
	struct UBackgroundBlur* BackgroundBlur; // 0x328(0x08)
	struct UImage* BlackBG01; // 0x330(0x08)
	struct UImage* BlackBG01; // 0x338(0x08)
	struct UImage* BlackBG02; // 0x340(0x08)
	struct UImage* BottomLine; // 0x348(0x08)
	struct UImage* BottomLine; // 0x350(0x08)
	struct UImage* BottomLine; // 0x358(0x08)
	struct UButton* Button; // 0x360(0x08)
	struct UButton* Button; // 0x368(0x08)
	struct UButton* Button_MatchEnd; // 0x370(0x08)
	struct UButton* Button_Skip; // 0x378(0x08)
	struct UCanvasPanel* CanvasPanel; // 0x380(0x08)
	struct UCanvasPanel* CanvasPanel; // 0x388(0x08)
	struct UCanvasPanel* CanvasPanel_DropItem; // 0x390(0x08)
	struct UCanvasPanel* CanvasPanel_DropItem2; // 0x398(0x08)
	struct UCanvasPanel* CanvasPanel_Enemy; // 0x3a0(0x08)
	struct UCanvasPanel* CanvasPanel_KillerInfo_Renew; // 0x3a8(0x08)
	struct UCanvasPanel* CanvasPanel_Me; // 0x3b0(0x08)
	struct UCanvasPanel* CanvasPanel_Skip; // 0x3b8(0x08)
	struct UScaleBox* Defeat; // 0x3c0(0x08)
	struct UImage* Glow1; // 0x3c8(0x08)
	struct UImage* Glow1; // 0x3d0(0x08)
	struct UImage* Glow1; // 0x3d8(0x08)
	struct UImage* Glow2; // 0x3e0(0x08)
	struct UImage* Glow2; // 0x3e8(0x08)
	struct UImage* Glow3; // 0x3f0(0x08)
	struct UImage* Glow3; // 0x3f8(0x08)
	struct UImage* Glow3; // 0x400(0x08)
	struct UImage* GlowLine; // 0x408(0x08)
	struct UImage* GlowLine; // 0x410(0x08)
	struct UTextBlock* HeadShot; // 0x418(0x08)
	struct UHorizontalBox* HorizontalBox_KillerWeaponInfo; // 0x420(0x08)
	struct UHorizontalBox* HorizontalBox_Rarity; // 0x428(0x08)
	struct UImage* Image; // 0x430(0x08)
	struct UImage* Image; // 0x438(0x08)
	struct UImage* Image; // 0x440(0x08)
	struct UImage* Image; // 0x448(0x08)
	struct UImage* Image; // 0x450(0x08)
	struct UImage* Image; // 0x458(0x08)
	struct UImage* Image; // 0x460(0x08)
	struct UImage* Image; // 0x468(0x08)
	struct UImage* Image; // 0x470(0x08)
	struct UImage* Image; // 0x478(0x08)
	struct UImage* Image; // 0x480(0x08)
	struct UImage* Image; // 0x488(0x08)
	struct UImage* Image; // 0x490(0x08)
	struct UImage* Image; // 0x498(0x08)
	struct UImage* Image; // 0x4a0(0x08)
	struct UImage* Image; // 0x4a8(0x08)
	struct UImage* Image; // 0x4b0(0x08)
	struct UImage* Image; // 0x4b8(0x08)
	struct UImage* Image; // 0x4c0(0x08)
	struct UImage* Image; // 0x4c8(0x08)
	struct UImage* Image; // 0x4d0(0x08)
	struct UImage* Image; // 0x4d8(0x08)
	struct UImage* Image; // 0x4e0(0x08)
	struct UImage* Image; // 0x4e8(0x08)
	struct UImage* Image; // 0x4f0(0x08)
	struct UImage* Image; // 0x4f8(0x08)
	struct UImage* Image; // 0x500(0x08)
	struct UImage* Image; // 0x508(0x08)
	struct UImage* Image; // 0x510(0x08)
	struct UImage* Image; // 0x518(0x08)
	struct UImage* Image; // 0x520(0x08)
	struct UImage* Image; // 0x528(0x08)
	struct UImage* Image; // 0x530(0x08)
	struct UImage* Image; // 0x538(0x08)
	struct UImage* Image; // 0x540(0x08)
	struct UImage* Image; // 0x548(0x08)
	struct UImage* Image; // 0x550(0x08)
	struct UImage* Image; // 0x558(0x08)
	struct UImage* Image; // 0x560(0x08)
	struct UImage* Image; // 0x568(0x08)
	struct UImage* Image_KillerClassIcon; // 0x570(0x08)
	struct UImage* Image_MyClassIcon; // 0x578(0x08)
	struct UImage* L_Wing01; // 0x580(0x08)
	struct UImage* L_Wing01; // 0x588(0x08)
	struct UImage* L_Wing01; // 0x590(0x08)
	struct UImage* L_Wing01; // 0x598(0x08)
	struct UImage* L_Wing01; // 0x5a0(0x08)
	struct UImage* L_Wing01; // 0x5a8(0x08)
	struct UImage* L_Wing02; // 0x5b0(0x08)
	struct UImage* L_Wing02; // 0x5b8(0x08)
	struct UImage* L_Wing02; // 0x5c0(0x08)
	struct UImage* L_Wing02; // 0x5c8(0x08)
	struct UImage* L_Wing02; // 0x5d0(0x08)
	struct UImage* L_Wing02; // 0x5d8(0x08)
	struct UImage* L_Wing03; // 0x5e0(0x08)
	struct UImage* L_Wing03; // 0x5e8(0x08)
	struct UImage* L_Wing03; // 0x5f0(0x08)
	struct UImage* L_Wing03; // 0x5f8(0x08)
	struct UImage* L_Wing03; // 0x600(0x08)
	struct UImage* L_Wing03; // 0x608(0x08)
	struct UImage* L_WingLine; // 0x610(0x08)
	struct UImage* L_WingLine; // 0x618(0x08)
	struct UImage* L_WingLine; // 0x620(0x08)
	struct UImage* Logo; // 0x628(0x08)
	struct UImage* Logo; // 0x630(0x08)
	struct UImage* Logo; // 0x638(0x08)
	struct UImage* Logo; // 0x640(0x08)
	struct UOverlay* Overlay; // 0x648(0x08)
	struct UOverlay* Overlay_WeaponLevel; // 0x650(0x08)
	struct UEditableText* PosX; // 0x658(0x08)
	struct UEditableText* PosY; // 0x660(0x08)
	struct UEditableText* PosZ; // 0x668(0x08)
	struct UImage* R_Wing01; // 0x670(0x08)
	struct UImage* R_Wing01; // 0x678(0x08)
	struct UImage* R_Wing01; // 0x680(0x08)
	struct UImage* R_Wing01; // 0x688(0x08)
	struct UImage* R_Wing01; // 0x690(0x08)
	struct UImage* R_Wing01; // 0x698(0x08)
	struct UImage* R_Wing02; // 0x6a0(0x08)
	struct UImage* R_Wing02; // 0x6a8(0x08)
	struct UImage* R_Wing02; // 0x6b0(0x08)
	struct UImage* R_Wing02; // 0x6b8(0x08)
	struct UImage* R_Wing02; // 0x6c0(0x08)
	struct UImage* R_Wing02; // 0x6c8(0x08)
	struct UImage* R_Wing03; // 0x6d0(0x08)
	struct UImage* R_Wing03; // 0x6d8(0x08)
	struct UImage* R_Wing03; // 0x6e0(0x08)
	struct UImage* R_Wing03; // 0x6e8(0x08)
	struct UImage* R_Wing03; // 0x6f0(0x08)
	struct UImage* R_Wing03; // 0x6f8(0x08)
	struct UImage* R_WingLine; // 0x700(0x08)
	struct UImage* R_WingLine; // 0x708(0x08)
	struct UImage* R_WingLine; // 0x710(0x08)
	struct UImage* Ribbon; // 0x718(0x08)
	struct UImage* Ribbon; // 0x720(0x08)
	struct UImage* Ribbon; // 0x728(0x08)
	struct UImage* Ribbon; // 0x730(0x08)
	struct UImage* Ring; // 0x738(0x08)
	struct UImage* Ring; // 0x740(0x08)
	struct UScrollBox* ScrollBox_DropItem; // 0x748(0x08)
	struct UScrollBox* ScrollBox_DropItem2; // 0x750(0x08)
	struct UTextBlock* T_DamageType; // 0x758(0x08)
	struct UTextBlock* T_DropCount; // 0x760(0x08)
	struct UTextBlock* T_DropCount2; // 0x768(0x08)
	struct UTextBlock* T_WeaponLevel; // 0x770(0x08)
	struct UTextBlock* TextBlock; // 0x778(0x08)
	struct UTextBlock* TextBlock; // 0x780(0x08)
	struct UTextBlock* TextBlock; // 0x788(0x08)
	struct UTextBlock* TextBlock; // 0x790(0x08)
	struct UTextBlock* TextBlock; // 0x798(0x08)
	struct UTextBlock* TextBlock; // 0x7a0(0x08)
	struct UTextBlock* TextBlock; // 0x7a8(0x08)
	struct UTextBlock* TextBlock; // 0x7b0(0x08)
	struct UImage* TitleSymbol; // 0x7b8(0x08)
	struct UImage* TitleSymbol; // 0x7c0(0x08)
	struct UImage* TitleSymbol; // 0x7c8(0x08)
	struct UImage* TopLine; // 0x7d0(0x08)
	struct UImage* TopLine; // 0x7d8(0x08)
	struct UImage* TopLine; // 0x7e0(0x08)
	struct UUW-MatchEnd_Animation_02_DamagePlayerInfo_C* UW-MatchEnd_Animation_02_DamagePlayerInfo; // 0x7e8(0x08)
	struct UUW-MatchEnd_Animation_02_DamagePlayerInfo_C* UW-MatchEnd_Animation_02_DamagePlayerInfo; // 0x7f0(0x08)
	struct UUW-Matchend_DamageListBox_C* UW-Matchend_DamageListBox; // 0x7f8(0x08)
	struct UUW-MatchEnd_RewardSlot_02_C* UW-MatchEnd_RewardSlot; // 0x800(0x08)
	struct UUW-MatchEnd_RewardSlot_02_C* UW-MatchEnd_RewardSlot; // 0x808(0x08)
	struct UUW-MatchEnd_RewardSlot_02_C* UW-MatchEnd_RewardSlot; // 0x810(0x08)
	struct UUW-MatchEnd_RewardSlot_02_C* UW-MatchEnd_RewardSlot_02; // 0x818(0x08)
	struct UTextBlock* WeaponName; // 0x820(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_DamageCauser; // 0x828(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_KillerInfo; // 0x830(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_SkipButton; // 0x838(0x08)
	struct UTextBlock* WinText1; // 0x840(0x08)
	struct UTextBlock* WinText1; // 0x848(0x08)
	struct UTextBlock* WinText1; // 0x850(0x08)
	struct UTextBlock* WinText1; // 0x858(0x08)
	struct UTextBlock* WinText1; // 0x860(0x08)
	struct UTextBlock* WinText2; // 0x868(0x08)
	struct UTextBlock* WinText2; // 0x870(0x08)
	struct UTextBlock* WinText3; // 0x878(0x08)
	struct UTextBlock* WinText3; // 0x880(0x08)
	bool MatchEnd; // 0x888(0x01)
	struct FMatchEndAnimation AnimationData; // 0x889(0x03)
	struct UUW-MatchEndWidget_C* MatchEndWidgetRef; // 0x890(0x08)
	struct FMatchEndSimpleResult SimpleResult; // 0x898(0x218)
	struct TArray<struct FTimerHandle> SimpleTimer; // 0xab0(0x10)
	struct FMulticastInlineDelegate EventDispatcher_HideComplete; // 0xac0(0x10)
	bool bSuccessWinEventCall; // 0xad0(0x01)
	struct TArray<struct FAudioPlayingHandle> PlayingAudio; // 0xad8(0x10)
	bool bTestMode; // 0xae8(0x01)
	bool bTestIsWin; // 0xae9(0x01)
	float MatchFinalResultShowTime; // 0xaec(0x04)
	struct FMulticastInlineDelegate EventDispatcher_MoveToMatchEnd; // 0xaf0(0x10)
	bool IsTournamentGame; // 0xb00(0x01)
	struct TArray<struct FName> CurEffectKeys; // 0xb08(0x10)
	bool UpdateEffect; // 0xb18(0x01)
	struct AActor* TestActor; // 0xb20(0x08)

	void SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02 // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02 // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02 // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02 // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ResetDamageListAnim(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.ResetDamageListAnim // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void HasDamageList(bool& bHas); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.HasDamageList // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void HideKillerInfo(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.HideKillerInfo // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void CheckSkipBtn(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.CheckSkipBtn // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void PlayCharacterResultAnimation(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.PlayCharacterResultAnimation // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void UpdateInputMode(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.UpdateInputMode // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void RemoveOverlapedWidgets(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.RemoveOverlapedWidgets // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetKillerInfo(struct FMatchEndSimpleResult SimpleResult); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.SetKillerInfo // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetDropedItem(struct UScrollBox* TargetScrollBox); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.SetDropedItem // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnLoaded_A6B182CC4A5B63990D944287209B4F00(struct UObject* Loaded); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.OnLoaded_A6B182CC4A5B63990D944287209B4F00 // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnLoaded_D50E1EC94DE93B2112115E8FF0D82044(struct UObject* Loaded); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.OnLoaded_D50E1EC94DE93B2112115E8FF0D82044 // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void  »¤ìŠ¤(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C. »¤ìŠ¤ // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void HideAnimation(bool InitEffect); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.HideAnimation // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void  »¤ìŠ¤(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C. »¤ìŠ¤ // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ShowMatchEndAnimation(struct FMatchEndAnimation AnimationData, struct FMatchEndSimpleResult Result, bool IsTestMode, bool IsRetire); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.ShowMatchEndAnimation // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void  »¤ìŠ¤(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C. »¤ìŠ¤ // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void  »¤ìŠ¤(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C. »¤ìŠ¤ // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ShowLoseAnimation(struct FMatchEndSimpleResult Data); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.ShowLoseAnimation // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Tick(struct FGeometry MyGeometry, float InDeltaTime); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.Tick // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void Construct(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void Init(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.Init // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_103_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.BndEvt__Button_103_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_1_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.BndEvt__Button_1_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void AsyncLoadingClass(struct TSoftObjectPtr<UObject> Texture); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.AsyncLoadingClass // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void AsyncLoadingKillerClass(struct TSoftObjectPtr<UObject> Texture); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.AsyncLoadingKillerClass // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void PlayAnimDefeat(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.PlayAnimDefeat // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void MoveToDamageInfo(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.MoveToDamageInfo // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_MatchEnd_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.BndEvt__Button_MatchEnd_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void PlayDamageListHealthAnim(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.PlayDamageListHealthAnim // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void PlayDamageListAnim(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.PlayDamageListAnim // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void DelegateOnWhoKilledMe_Event(struct FMatchEndSimpleResult& SimpleResult); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.DelegateOnWhoKilledMe_Event // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetCameraEffect(struct FName Key); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.SetCameraEffect // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetEffect(bool bIsTournament, int32_t Type); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.SetEffect // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SkipSimpleResult(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.SkipSimpleResult // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ExecuteUbergraph_UW-MatchEnd_Animation_02(int32_t EntryPoint); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.ExecuteUbergraph_UW-MatchEnd_Animation_02 // (Final|UbergraphFunction|HasDefaults) // @ game+0x2bad3b0
	void EventDispatcher_MoveToMatchEnd__DelegateSignature(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.EventDispatcher_MoveToMatchEnd__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void EventDispatcher_HideComplete__DelegateSignature(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.EventDispatcher_HideComplete__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
};

