// WidgetBlueprintGeneratedClass UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C
// Size: 0x2cff6ac1 (Inherited: 0x2cff6a88)
struct UUW-MatchEnd_Ranking2_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x288(0x08)
	struct UWidgetAnimation* Anim_Point; // 0x290(0x08)
	struct UWidgetAnimation* Hide; // 0x298(0x08)
	struct UWidgetAnimation* RankDown; // 0x2a0(0x08)
	struct UWidgetAnimation* RankUp; // 0x2a8(0x08)
	struct UWidgetAnimation* Anim_Reward; // 0x2b0(0x08)
	struct UImage* Arrow; // 0x2b8(0x08)
	struct UImage* ArrowLine; // 0x2c0(0x08)
	struct UTextBlock* BonusPoint; // 0x2c8(0x08)
	struct UImage* BottomLine; // 0x2d0(0x08)
	struct UImage* BrightSpot_01; // 0x2d8(0x08)
	struct UImage* BrightSpot_02; // 0x2e0(0x08)
	struct UImage* BrightSpot_03; // 0x2e8(0x08)
	struct UImage* BrightSpot_04; // 0x2f0(0x08)
	struct UImage* BrightSpot_05; // 0x2f8(0x08)
	struct UButton* Button_DamageInfo; // 0x300(0x08)
	struct UButton* Button_DeathCam; // 0x308(0x08)
	struct UButton* Button_Exit; // 0x310(0x08)
	struct UButton* Button_KillCam; // 0x318(0x08)
	struct UButton* Button_Report; // 0x320(0x08)
	struct UButton* Button_Spectate; // 0x328(0x08)
	struct UCanvasPanel* CanvasPanel; // 0x330(0x08)
	struct UCanvasPanel* CanvasPanel; // 0x338(0x08)
	struct UCanvasPanel* CanvasPanel; // 0x340(0x08)
	struct UCanvasPanel* CanvasPanel; // 0x348(0x08)
	struct USizeBox* Final; // 0x350(0x08)
	struct UTextBlock* FirstWin; // 0x358(0x08)
	struct UImage* Glow1; // 0x360(0x08)
	struct UImage* Glow2; // 0x368(0x08)
	struct UImage* Glow3; // 0x370(0x08)
	struct UImage* Glow_01; // 0x378(0x08)
	struct UImage* GlowLine; // 0x380(0x08)
	struct UImage* Gold; // 0x388(0x08)
	struct UHorizontalBox* HorizontalBox; // 0x390(0x08)
	struct UImage* Image; // 0x398(0x08)
	struct UImage* Image; // 0x3a0(0x08)
	struct UImage* Image; // 0x3a8(0x08)
	struct UImage* Image; // 0x3b0(0x08)
	struct UImage* Image; // 0x3b8(0x08)
	struct UImage* Image; // 0x3c0(0x08)
	struct UImage* Image; // 0x3c8(0x08)
	struct UImage* Image; // 0x3d0(0x08)
	struct UImage* Image; // 0x3d8(0x08)
	struct UImage* Image; // 0x3e0(0x08)
	struct UImage* Image; // 0x3e8(0x08)
	struct UImage* Image; // 0x3f0(0x08)
	struct UImage* Image_CurrentRANK; // 0x3f8(0x08)
	struct UImage* Image_DownRANK; // 0x400(0x08)
	struct UImage* Image_UpRANK; // 0x408(0x08)
	struct UTextBlock* KillPoint; // 0x410(0x08)
	struct UImage* L_Wing01; // 0x418(0x08)
	struct UImage* L_Wing01; // 0x420(0x08)
	struct UImage* L_Wing01; // 0x428(0x08)
	struct UImage* L_Wing02; // 0x430(0x08)
	struct UImage* L_Wing02; // 0x438(0x08)
	struct UImage* L_Wing02; // 0x440(0x08)
	struct UImage* L_Wing03; // 0x448(0x08)
	struct UImage* L_Wing03; // 0x450(0x08)
	struct UImage* L_Wing03; // 0x458(0x08)
	struct UImage* L_WingLine; // 0x460(0x08)
	struct UImage* L_WingLine; // 0x468(0x08)
	struct UTextBlock* LifePoint; // 0x470(0x08)
	struct UImage* Light; // 0x478(0x08)
	struct UImage* Light_01; // 0x480(0x08)
	struct UImage* Light_02; // 0x488(0x08)
	struct UImage* Light_03; // 0x490(0x08)
	struct UImage* Light_04; // 0x498(0x08)
	struct UImage* Light_05; // 0x4a0(0x08)
	struct UImage* Light_06; // 0x4a8(0x08)
	struct UOverlay* Overlay; // 0x4b0(0x08)
	struct UOverlay* Overlay_DamageInfo; // 0x4b8(0x08)
	struct UOverlay* Overlay_KillCam; // 0x4c0(0x08)
	struct UOverlay* Overlay_KillCamReplay; // 0x4c8(0x08)
	struct UOverlay* Overlay_Report; // 0x4d0(0x08)
	struct UOverlay* Overlay_Spectate; // 0x4d8(0x08)
	struct UCanvasPanel* Preliminary; // 0x4e0(0x08)
	struct UImage* R_Wing01; // 0x4e8(0x08)
	struct UImage* R_Wing01; // 0x4f0(0x08)
	struct UImage* R_Wing01; // 0x4f8(0x08)
	struct UImage* R_Wing01; // 0x500(0x08)
	struct UImage* R_Wing02; // 0x508(0x08)
	struct UImage* R_Wing02; // 0x510(0x08)
	struct UImage* R_Wing02; // 0x518(0x08)
	struct UImage* R_Wing02; // 0x520(0x08)
	struct UImage* R_Wing03; // 0x528(0x08)
	struct UImage* R_Wing03; // 0x530(0x08)
	struct UImage* R_Wing03; // 0x538(0x08)
	struct UImage* R_Wing03; // 0x540(0x08)
	struct UImage* R_WingLine; // 0x548(0x08)
	struct UImage* R_WingLine; // 0x550(0x08)
	struct UImage* Ribbon; // 0x558(0x08)
	struct UImage* Ring; // 0x560(0x08)
	struct UImage* RIng_Glow_01; // 0x568(0x08)
	struct UScaleBox* ScaleBox; // 0x570(0x08)
	struct UScaleBox* ScaleBox; // 0x578(0x08)
	struct UScrollBox* ScrollBox; // 0x580(0x08)
	struct UScrollBox* ScrollBox; // 0x588(0x08)
	struct USizeBox* SizeBox; // 0x590(0x08)
	struct UTextBlock* T_RemainTime; // 0x598(0x08)
	struct UTextBlock* Text_Report; // 0x5a0(0x08)
	struct UTextBlock* TextBlock; // 0x5a8(0x08)
	struct UTextBlock* TextBlock; // 0x5b0(0x08)
	struct UTextBlock* TextBlock; // 0x5b8(0x08)
	struct UTextBlock* TextBlock; // 0x5c0(0x08)
	struct UTextBlock* TextBlock; // 0x5c8(0x08)
	struct UTextBlock* TextBlock; // 0x5d0(0x08)
	struct UTextBlock* TextBlock; // 0x5d8(0x08)
	struct UTextBlock* TextBlock; // 0x5e0(0x08)
	struct UTextBlock* TextBlock; // 0x5e8(0x08)
	struct UTextBlock* TextBlock; // 0x5f0(0x08)
	struct UTextBlock* TextBlock; // 0x5f8(0x08)
	struct UTextBlock* TextBlock; // 0x600(0x08)
	struct UTextBlock* TextBlock; // 0x608(0x08)
	struct UTextBlock* TextBlock; // 0x610(0x08)
	struct UTextBlock* TextBlock; // 0x618(0x08)
	struct UTextBlock* TextBlock; // 0x620(0x08)
	struct UTextBlock* TextBlock; // 0x628(0x08)
	struct UTextBlock* TextBlock; // 0x630(0x08)
	struct UTextBlock* TextBlock; // 0x638(0x08)
	struct UTextBlock* TextBlock; // 0x640(0x08)
	struct UTextBlock* TextBlock; // 0x648(0x08)
	struct UTextBlock* TextBlock; // 0x650(0x08)
	struct UTextBlock* TextBlock; // 0x658(0x08)
	struct UTextBlock* TextBlock; // 0x660(0x08)
	struct UTextBlock* TextBlock_LocalMatchRP; // 0x668(0x08)
	struct UImage* TextGlow01; // 0x670(0x08)
	struct UImage* TextGlow02; // 0x678(0x08)
	struct UImage* TextGlow03; // 0x680(0x08)
	struct UImage* TopLine; // 0x688(0x08)
	struct UCanvasPanel* tournament; // 0x690(0x08)
	struct UUW-MatchEnd_GoldList_C* UW-MatchEnd_GoldList; // 0x698(0x08)
	struct UUW-MatchEnd_GoldList_C* UW-MatchEnd_GoldList; // 0x6a0(0x08)
	struct UUW-MatchEnd_GoldList_C* UW-MatchEnd_GoldList; // 0x6a8(0x08)
	struct UUW-MatchEnd_RewardSlot_02_C* UW-MatchEnd_RewardSlot_02; // 0x6b0(0x08)
	struct UUW-MatchEnd_RewardSlot_02_C* UW-MatchEnd_RewardSlot_02; // 0x6b8(0x08)
	struct UUW-MatchEnd_RewardSlot_02_C* UW-MatchEnd_RewardSlot_02; // 0x6c0(0x08)
	struct UUW-MatchEnd_RewardSlot_02_C* UW-MatchEnd_RewardSlot_02; // 0x6c8(0x08)
	struct UUW-MatchEnd_RewardSlot_02_C* UW-MatchEnd_RewardSlot_02; // 0x6d0(0x08)
	struct UUW-RankPoint_C* UW-RankPoint; // 0x6d8(0x08)
	struct UUW-RewardGoldSlot_02_C* UW-RewardGoldSlot_02; // 0x6e0(0x08)
	struct UVerticalBox* VerticalBox; // 0x6e8(0x08)
	struct UWidgetSwitcher* WidgetSwitcher; // 0x6f0(0x08)
	struct UWidgetSwitcher* WidgetSwitcher; // 0x6f8(0x08)
	struct UWidgetSwitcher* WidgetSwitcher; // 0x700(0x08)
	bool MatchEnd; // 0x708(0x01)
	struct FMatchEndAnimation AnimationData; // 0x709(0x03)
	struct UUW-MatchEndWidget_C* MatchEndWidgetRef; // 0x710(0x08)
	struct FMatchEndSimpleResult SimpleResult; // 0x718(0x218)
	struct FTimerHandle SimpleTimer; // 0x930(0x08)
	bool IsWinningCam; // 0x938(0x01)
	struct FAudioPlayingHandle StartSound; // 0x93c(0x04)
	struct FTimerHandle GainGoldHandle; // 0x940(0x08)
	struct FTimerHandle GoldHandle; // 0x948(0x08)
	struct FMatchEndFinalResult FinalResultData; // 0x950(0x04)
	int32_t RandomGold; // 0x954(0x04)
	int32_t GainGoldValue; // 0x958(0x04)
	struct UTextBlock* LocalWidget; // 0x960(0x08)
	struct ABravoHotelPlayerState* PlayerState; // 0x968(0x08)
	struct FTimerHandle Timehandle_Rank; // 0x970(0x08)
	bool Increase; // 0x978(0x01)
	bool bMaxPrograssbar; // 0x979(0x01)
	int32_t CurrentRP; // 0x97c(0x04)
	int32_t PlayerOriRP; // 0x980(0x04)
	int32_t TargetRP; // 0x984(0x04)
	int32_t NextTireRP; // 0x988(0x04)
	int32_t CurrentTierID; // 0x98c(0x04)
	bool IsGiveUp; // 0x990(0x01)
	int32_t TempRank; // 0x994(0x04)
	int32_t TempKill; // 0x998(0x04)
	int32_t TempHit; // 0x99c(0x04)
	int32_t TempSuvival; // 0x9a0(0x04)
	int32_t SeasonRP; // 0x9a4(0x04)
	int32_t GainedRP; // 0x9a8(0x04)
	int32_t AminRPText; // 0x9ac(0x04)
	int32_t StartRP; // 0x9b0(0x04)
	int32_t EndRP; // 0x9b4(0x04)
	float ShowTime; // 0x9b8(0x04)
	bool IsTargetCameraKiller; // 0x9bc(0x01)
	struct FMulticastInlineDelegate EventDispatcher_MoveToDamageInfo; // 0x9c0(0x10)
	struct FButtonStyle TournamentBtn; // 0x9d0(0x2a8)
	struct FButtonStyle BaseBtn; // 0xc78(0x2a8)
	struct FSlateColor 1stColor; // 0xf20(0x28)
	struct FSlateColor 2stColor; // 0xf48(0x28)
	struct FSlateColor TournamentColor; // 0xf70(0x28)
	struct FSlateColor LoseColor; // 0xf98(0x28)
	bool IsTournament; // 0xfc0(0x01)

	void SequenceEvent__ENTRYPOINTUW-MatchEnd_Ranking2(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Ranking2 // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SequenceEvent__ENTRYPOINTUW-MatchEnd_Ranking2(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Ranking2 // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void TargetCameraIsKiller(bool KillCam, bool& TargetCameraKiller); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.TargetCameraIsKiller // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ShowMAXRPText(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.ShowMAXRPText // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void RankerDown(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.RankerDown // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void RankPointSetData(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.RankPointSetData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetupRankDown(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.SetupRankDown // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetupRankUp(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.SetupRankUp // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void GetTierRP(int32_t& NextRP, bool& Next, int32_t& NowRP, int32_t& PreviousRP, bool& Previous); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.GetTierRP // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void SetItem(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.SetItem // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetRank(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.SetRank // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetPlayInfo(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.SetPlayInfo // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Init(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.Init // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetRankImage(int32_t IDD, struct UImage* Widgett); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.SetRankImage // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void UpdateInputMode(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.UpdateInputMode // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void HideSimpleWidget(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.HideSimpleWidget // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Check Report Enablefrom User Name(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.Check Report Enablefrom User Name // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Check Exist Report User(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.Check Exist Report User // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ReportSended(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.ReportSended // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetColorTextWidget(struct UTextBlock* Widgett, int32_t Valuee, struct FSlateColor Colorr); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.SetColorTextWidget // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetGold(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.SetGold // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Construct(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_DeathCam_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.BndEvt__Button_DeathCam_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_Spectate_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.BndEvt__Button_Spectate_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_Exit_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.BndEvt__Button_Exit_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_DeathCam_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.BndEvt__Button_DeathCam_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_Spectate_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.BndEvt__Button_Spectate_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_Exit_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.BndEvt__Button_Exit_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_Report_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.BndEvt__Button_Report_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void ShowDeathCam(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.ShowDeathCam // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Close(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.Close // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_Report_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.BndEvt__Button_Report_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void Destruct(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.Destruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void ShowGold(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.ShowGold // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetInfo(struct ABravoHotelPlayerState* PS, struct FMatchEndFinalResult ResultData, struct UUW-MatchEndWidget_C* MatchEndWidget); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.SetInfo // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void EventRankAnimation(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.EventRankAnimation // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void AsyncLoadTexture(struct TSoftObjectPtr<UObject> Imge, struct UImage* Widget); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.AsyncLoadTexture // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Tick(struct FGeometry MyGeometry, float InDeltaTime); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.Tick // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void RankUpDown(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.RankUpDown // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_DeathCam_1_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.BndEvt__Button_DeathCam_1_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_DeathCam_1_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.BndEvt__Button_DeathCam_1_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_DamageInfo_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.BndEvt__Button_DamageInfo_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void MoveToMatchEnd(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.MoveToMatchEnd // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void CustomEvent(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.CustomEvent // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetButtonStyle(struct FButtonStyle Style); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.SetButtonStyle // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ExecuteUbergraph_UW-MatchEnd_Ranking2(int32_t EntryPoint); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.ExecuteUbergraph_UW-MatchEnd_Ranking2 // (Final|UbergraphFunction|HasDefaults) // @ game+0x2bad3b0
	void EventDispatcher_MoveToDamageInfo__DelegateSignature(); // Function UW-MatchEnd_Ranking2.UW-MatchEnd_Ranking2_C.EventDispatcher_MoveToDamageInfo__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
};

