// WidgetBlueprintGeneratedClass UW-PerkDeckWidget.UW-PerkDeckWidget_C
// Size: 0x2cff6ae0 (Inherited: 0x2cff6a88)
struct UUW-PerkDeckWidget_C : UBravoHotelPerkDeckWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x288(0x08)
	struct UWidgetAnimation* HideFree; // 0x290(0x08)
	struct UWidgetAnimation* ShowFree; // 0x298(0x08)
	struct UWidgetAnimation* Msg_open; // 0x2a0(0x08)
	struct UWidgetAnimation* POPUP_OPEN; // 0x2a8(0x08)
	struct UWidgetAnimation* Idle; // 0x2b0(0x08)
	struct UButton* btn_Choose; // 0x2b8(0x08)
	struct UButton* Btn_ExpertWeapon; // 0x2c0(0x08)
	struct UButton* btn_OK; // 0x2c8(0x08)
	struct UButton* btn_OK; // 0x2d0(0x08)
	struct UButton* btn_PerkDeck; // 0x2d8(0x08)
	struct UButton* Button_CloseMovie; // 0x2e0(0x08)
	struct UButton* Button_PlayMovie; // 0x2e8(0x08)
	struct UButton* Button_Refresh; // 0x2f0(0x08)
	struct UButton* Button_Reselect; // 0x2f8(0x08)
	struct UButton* Button_SelectMode; // 0x300(0x08)
	struct UCanvasPanel* Canvas_CantSelectMessage; // 0x308(0x08)
	struct UCanvasPanel* Canvas_MovieScreen; // 0x310(0x08)
	struct UCanvasPanel* CanvasPanel_ClassList; // 0x318(0x08)
	struct UCanvasPanel* CanvasPanel_NewbieAdvantage; // 0x320(0x08)
	struct UCheckBox* CheckBox_PerkDeckNotReOpen; // 0x328(0x08)
	struct UScrollBox* ExpertWeaponList; // 0x330(0x08)
	struct UCanvasPanel* Free; // 0x338(0x08)
	struct UOverlay* GoldLack; // 0x340(0x08)
	struct UHorizontalBox* HorizontalBox_ClassList; // 0x348(0x08)
	struct UHorizontalBox* HorizontalBox_PerkDeckReOpen; // 0x350(0x08)
	struct UImage* HoverStroke; // 0x358(0x08)
	struct UImage* Image; // 0x360(0x08)
	struct UImage* Image; // 0x368(0x08)
	struct UImage* Image; // 0x370(0x08)
	struct UImage* Image; // 0x378(0x08)
	struct UImage* Image; // 0x380(0x08)
	struct UImage* Image; // 0x388(0x08)
	struct UImage* Image; // 0x390(0x08)
	struct UImage* Image; // 0x398(0x08)
	struct UImage* Image; // 0x3a0(0x08)
	struct UImage* Image; // 0x3a8(0x08)
	struct UImage* Image; // 0x3b0(0x08)
	struct UImage* Image; // 0x3b8(0x08)
	struct UImage* Image; // 0x3c0(0x08)
	struct UImage* Image; // 0x3c8(0x08)
	struct UImage* Image; // 0x3d0(0x08)
	struct UImage* Image; // 0x3d8(0x08)
	struct UImage* Image; // 0x3e0(0x08)
	struct UImage* Image; // 0x3e8(0x08)
	struct UImage* Image; // 0x3f0(0x08)
	struct UImage* Image; // 0x3f8(0x08)
	struct UImage* Image_Class; // 0x400(0x08)
	struct UImage* Image_ClassIcon; // 0x408(0x08)
	struct UImage* Image_Cycle; // 0x410(0x08)
	struct UImage* Image_Cycle; // 0x418(0x08)
	struct UImage* Image_Cycle; // 0x420(0x08)
	struct UImage* Image_Weapon; // 0x428(0x08)
	struct UImage* Img_Movie; // 0x430(0x08)
	struct UImage* Option_Training; // 0x438(0x08)
	struct UOverlay* Overlay_ExpertWeaponList; // 0x440(0x08)
	struct UUW-FreeTicket_C* Random; // 0x448(0x08)
	struct UHorizontalBox* ReseletTextGroup1; // 0x450(0x08)
	struct UHorizontalBox* ReseletTextGroup1; // 0x458(0x08)
	struct UOverlay* ReseletTextGroup2; // 0x460(0x08)
	struct UOverlay* ReseletTextGroup2; // 0x468(0x08)
	struct UOverlay* ReseletTextGroup2; // 0x470(0x08)
	struct URichTextBlock* RichTextBlock_Training; // 0x478(0x08)
	struct UScaleBox* ScaleBox_ClassList; // 0x480(0x08)
	struct UScaleBox* ScaleBox_SelectNotifyMessage; // 0x488(0x08)
	struct UUW-FreeTicket_C* Select; // 0x490(0x08)
	struct USizeBox* SizeBox_Choose; // 0x498(0x08)
	struct USizeBox* SizeBox_Ok; // 0x4a0(0x08)
	struct USizeBox* SizeBox_Ok2; // 0x4a8(0x08)
	struct USizeBox* SizeBox_Random; // 0x4b0(0x08)
	struct USizeBox* SizeBox_Refrest; // 0x4b8(0x08)
	struct USizeBox* SizeBox_Select; // 0x4c0(0x08)
	struct UTextBlock* T_AmmoName; // 0x4c8(0x08)
	struct UTextBlock* T_ClassDeckName; // 0x4d0(0x08)
	struct UTextBlock* T_ClassDesc; // 0x4d8(0x08)
	struct UTextBlock* T_CurrentGold; // 0x4e0(0x08)
	struct UTextBlock* T_WeaponDesc; // 0x4e8(0x08)
	struct UTextBlock* T_WeaponName; // 0x4f0(0x08)
	struct UTextBlock* TextBlock_BattleRoyale; // 0x4f8(0x08)
	struct UTextBlock* TextBlock_Close; // 0x500(0x08)
	struct UTextBlock* TextBlock_Close; // 0x508(0x08)
	struct UTextBlock* TextBlock_Close; // 0x510(0x08)
	struct UTextBlock* TextBlock_MaxReset; // 0x518(0x08)
	struct UTextBlock* TextBlock_MaxReset; // 0x520(0x08)
	struct UTextBlock* TextBlock_Price_ChangeDeckList; // 0x528(0x08)
	struct UTextBlock* TextBlock_Price_Random; // 0x530(0x08)
	struct UTextBlock* TextBlock_Price_Random_Ticket; // 0x538(0x08)
	struct UTextBlock* TextBlock_Price_Random_Ticket; // 0x540(0x08)
	struct UTextBlock* TextBlock_Price_Select; // 0x548(0x08)
	struct UTextBlock* TextBlock_RandomRemainCount; // 0x550(0x08)
	struct UTextBlock* TextBlock_RefreshRemainCount; // 0x558(0x08)
	struct UTextBlock* TextBlock_Reselect; // 0x560(0x08)
	struct UTextBlock* TextBlock_Reselect; // 0x568(0x08)
	struct UTextBlock* TextBlock_Reselect; // 0x570(0x08)
	struct UTextBlock* TextBlock_Reselect; // 0x578(0x08)
	struct UTextBlock* TextBlock_Reselect; // 0x580(0x08)
	struct UUW-FreeTicket_C* UW-FreeTicket; // 0x588(0x08)
	struct UUW-FreeTicket_C* UW-FreeTicket; // 0x590(0x08)
	struct UUW-Inventory_Perk_C* UW-Inventory_Perk; // 0x598(0x08)
	struct UUW-Timer_C* UW-Timer; // 0x5a0(0x08)
	struct UWidgetSwitcher* WidgetSwitcher; // 0x5a8(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_ChangeDeck; // 0x5b0(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_ChangeDeck; // 0x5b8(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_Reselect; // 0x5c0(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_Reselect; // 0x5c8(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_Reselect; // 0x5d0(0x08)
	struct UUW-InventoryWidget_C* InventoryWidget; // 0x5d8(0x08)
	struct TArray<struct UUW-Inventory_PopupPerkSlot_C*> Slots; // 0x5e0(0x10)
	struct FSlateBrush IconBrush; // 0x5f0(0x90)
	struct UUW-Inventory_ItemSlotHover_C* HoverWidget; // 0x680(0x08)
	struct FTimerHandle HoverTimerHandle; // 0x688(0x08)
	int64_t LocalTemp; // 0x690(0x08)
	struct UMediaPlayer* MediaPlayer; // 0x698(0x08)
	struct TMap<int32_t, struct UMediaSource*> ClassVideo_Map; // 0x6a0(0x50)
	bool bBlockButton; // 0x6f0(0x01)
	bool bButtonEnabled; // 0x6f1(0x01)
	bool bCanRemainCount; // 0x6f2(0x01)
	bool bCanCurrentGold; // 0x6f3(0x01)
	bool bWaitingResponse; // 0x6f4(0x01)
	int64_t CurrentGold; // 0x6f8(0x08)
	int32_t ChangeDeckCount; // 0x700(0x04)
	int32_t ChangeDeckListCount; // 0x704(0x04)
	int32_t PerkDeckID; // 0x708(0x04)
	int32_t DisableTime; // 0x70c(0x04)
	struct TMap<struct FName, struct UUW-PerkDeckSelectItemWidget_C*> ClassInfoWidgetMap; // 0x710(0x50)
	struct FPerkDeckSelectInfo CurrentPerkDeckSelectInfo; // 0x760(0x18)
	int32_t LocalPerkMode; // 0x778(0x04)
	float ClassListPadding; // 0x77c(0x04)
	struct FTimerHandle Handle_PlayMovie; // 0x780(0x08)
	struct UMediaSource* CurrentClassVideo; // 0x788(0x08)
	struct FTimerHandle Handle_SetPerkInfoByHoverClassButton; // 0x790(0x08)
	bool LastClassButtonHovered; // 0x798(0x01)
	int32_t LastClassIndex; // 0x79c(0x04)
	bool bGameStarted; // 0x7a0(0x01)
	struct FMulticastInlineDelegate CloseOverLay; // 0x7a8(0x10)
	bool bIsExpertWeaponChanged; // 0x7b8(0x01)
	bool bIsFreeSelectDeck; // 0x7b9(0x01)
	bool bIsFreeChangeDeck; // 0x7ba(0x01)
	struct FTimerHandle FreeTimer; // 0x7c0(0x08)
	bool IsFirst; // 0x7c8(0x01)
	struct TArray<struct FPerkDeckClassInfo> UsablePerkDeckClassInfos; // 0x7d0(0x10)

	void SequenceEvent__ENTRYPOINTUW-PerkDeckWidget(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.SequenceEvent__ENTRYPOINTUW-PerkDeckWidget // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SequenceEvent__ENTRYPOINTUW-PerkDeckWidget(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.SequenceEvent__ENTRYPOINTUW-PerkDeckWidget // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SequenceEvent__ENTRYPOINTUW-PerkDeckWidget(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.SequenceEvent__ENTRYPOINTUW-PerkDeckWidget // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Set Text Box Visibility in Training Mode(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.Set Text Box Visibility in Training Mode // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Set Expert Weapon Changed(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.Set Expert Weapon Changed // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void InitExpertWeaponList(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.InitExpertWeaponList // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetPerkDeckReOpenCheck(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.SetPerkDeckReOpenCheck // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetComingSoonClass(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.SetComingSoonClass // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void GetComingSoonClass(struct FName& ClassRow); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.GetComingSoonClass // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void UpdateNewbieAdvantage(struct FPerkDeckData& PerkDeckData); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.UpdateNewbieAdvantage // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void DisableClassButtonWithoutSelected(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.DisableClassButtonWithoutSelected // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetPerkInfoByHoverClassButton(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.SetPerkInfoByHoverClassButton // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void PlayChangeDeckSound(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.PlayChangeDeckSound // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void PlayChooseSound(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.PlayChooseSound // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void PlayClickSound(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.PlayClickSound // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void PlayHoverSound(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.PlayHoverSound // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void HasPerkDeckClassInfo(bool& NewParam); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.HasPerkDeckClassInfo // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void SetButtonInfo(struct UButton* Button, struct UTextBlock* TextPrice, int32_t Price, struct UTextBlock* TextRemainCount, int32_t RemainCount, enum class ETicketType TicketType); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.SetButtonInfo // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void UpdateButtonInfos(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.UpdateButtonInfos // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void CanUseButton(bool& Enabled); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.CanUseButton // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void SetButtonEnabled(bool IsEnabled); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.SetButtonEnabled // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetPerkDeckSelectInfo(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.SetPerkDeckSelectInfo // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ChooseClassButton(int32_t ClassIndex); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.ChooseClassButton // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void HoverClassButton(int32_t ClassIndex, bool IsHoverd); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.HoverClassButton // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ResetSelectedClassInfo(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.ResetSelectedClassInfo // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void RefreshSelectedClassInfo(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.RefreshSelectedClassInfo // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetClassList(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.SetClassList // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetPerkModeInfo(int32_t PerkMode); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.SetPerkModeInfo // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	struct FEventReply OnMouseButtonDown(struct FGeometry MyGeometry, struct FPointerEvent& MouseEvent); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.OnMouseButtonDown // (BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void GetClassVideoSource(int32_t PerkDeckID, struct UMediaSource*& VideoSource); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.GetClassVideoSource // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ReadyMovie(int32_t PerkDeckID); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.ReadyMovie // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void CloseMovie(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.CloseMovie // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	enum class ESlateVisibility GetVisibility_RemainTime(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.GetVisibility_RemainTime // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void GetInventoryItemDetailInfo(struct FName Name, struct FInventoryItemDetailInfo& Info); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.GetInventoryItemDetailInfo // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	struct FText Get_TextBlock_RemailTime_Text(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.Get_TextBlock_RemailTime_Text // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2bad3b0
	void SetServerWaiting(bool bWait); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.SetServerWaiting // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetGoldInfo(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.SetGoldInfo // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetPerkInfo(bool UseLocalPlayerInfo, struct FPerkDeckClassInfo PerkDeckClassInfo); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.SetPerkInfo // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void CheckInfos(bool ForceUpdate); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.CheckInfos // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void InitInfos(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.InitInfos // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	struct FEventReply OnMouseWheel(struct FGeometry MyGeometry, struct FPointerEvent& MouseEvent); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.OnMouseWheel // (BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Hide(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.Hide // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Show(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.Show // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnLoaded_A83B5F164320A0E753E9088699009EB0(struct UObject* Loaded); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.OnLoaded_A83B5F164320A0E753E9088699009EB0 // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Finished_68D0074544AABC70455E90A37E1ED67B(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.Finished_68D0074544AABC70455E90A37E1ED67B // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnLoaded_C916107845AEFBC703CB8F9D00DAC0F0(struct UObject* Loaded); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.OnLoaded_C916107845AEFBC703CB8F9D00DAC0F0 // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnLoaded_19FB202A430BEE3458DBA2B7F1362CC8(struct UObject* Loaded); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.OnLoaded_19FB202A430BEE3458DBA2B7F1362CC8 // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void BP_OnEntryReleased(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.BP_OnEntryReleased // (Event|Protected|BlueprintEvent) // @ game+0x2bad3b0
	void BP_OnItemExpansionChanged(bool bIsExpanded); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.BP_OnItemExpansionChanged // (Event|Protected|BlueprintEvent) // @ game+0x2bad3b0
	void BP_OnItemSelectionChanged(bool bIsSelected); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.BP_OnItemSelectionChanged // (Event|Protected|BlueprintEvent) // @ game+0x2bad3b0
	void OnListItemObjectSet(struct UObject* ListItemObject); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.OnListItemObjectSet // (Event|Protected|BlueprintEvent) // @ game+0x2bad3b0
	void OpenPopup(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.OpenPopup // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ShowAnim(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.ShowAnim // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void HideAnim(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.HideAnim // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Construct(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__btn_OK_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.BndEvt__btn_OK_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_Reselect_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.BndEvt__Button_Reselect_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void ClosePopup(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.ClosePopup // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_Reselect_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.BndEvt__Button_Reselect_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void Destruct(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.Destruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void AsyncLoadingWeapon(struct TSoftObjectPtr<UPaperSprite> IconTexture); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.AsyncLoadingWeapon // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void AsyncLoadingClass(struct TSoftObjectPtr<UObject> Texture); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.AsyncLoadingClass // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnDelegatePayGoldOnChangeDeck(bool bSuccess); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.OnDelegatePayGoldOnChangeDeck // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_Movie_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.BndEvt__Button_Movie_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_CloseMovie_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.BndEvt__Button_CloseMovie_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void OnBattleRoyalStateChanged(enum class EBattleRoyaleState PrevState, enum class EBattleRoyaleState CurrentState); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.OnBattleRoyalStateChanged // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__btn_PerkDeck_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.BndEvt__btn_PerkDeck_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void OnFinishedClosePopupAnim(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.OnFinishedClosePopupAnim // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ChangeClassOnScenario(int32_t DeckIndex); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.ChangeClassOnScenario // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Tick(struct FGeometry MyGeometry, float InDeltaTime); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.Tick // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void AsyncLoadingClassIcon(struct TSoftObjectPtr<UObject> Texture); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.AsyncLoadingClassIcon // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnChangePerkModeDelegate_Event(int32_t PerkMode); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.OnChangePerkModeDelegate_Event // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_SelectMode_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.BndEvt__Button_SelectMode_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__btn_Choose_1_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.BndEvt__btn_Choose_1_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__btn_OK_5_K2Node_ComponentBoundEvent_12_OnButtonClickedEvent__DelegateSignature(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.BndEvt__btn_OK_5_K2Node_ComponentBoundEvent_12_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void DelegatePayGoldOnSelectDeck_Event(bool bSuccess); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.DelegatePayGoldOnSelectDeck_Event // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnChangedTeamPlayerClass(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.OnChangedTeamPlayerClass // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void SetPerkInfoImpl(bool bUseLocalPlayerInfo, struct FPerkDeckClassInfo& PerkDeckClassInfo); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.SetPerkInfoImpl // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void OnChangedCurrentPerkDeckSelectInfo(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.OnChangedCurrentPerkDeckSelectInfo // (Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void CheckSelectMode(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.CheckSelectMode // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void DelegateChoosePerkDeck_Event(bool bSuccess); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.DelegateChoosePerkDeck_Event // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void PlayMovie(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.PlayMovie // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_Refresh_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.BndEvt__Button_Refresh_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void DelegatePayGoldOnChangeDeckList_Event(bool bSuccess); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.DelegatePayGoldOnChangeDeckList_Event // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_SelectMode_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.BndEvt__Button_SelectMode_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_Refresh_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.BndEvt__Button_Refresh_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__btn_OK_5_K2Node_ComponentBoundEvent_13_OnButtonHoverEvent__DelegateSignature(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.BndEvt__btn_OK_5_K2Node_ComponentBoundEvent_13_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void TryChangeSelectDeck(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.TryChangeSelectDeck // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__CheckBox_PerkDeckReOpen_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.BndEvt__CheckBox_PerkDeckReOpen_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Btn_ExpertWeapon_K2Node_ComponentBoundEvent_14_OnButtonClickedEvent__DelegateSignature(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.BndEvt__Btn_ExpertWeapon_K2Node_ComponentBoundEvent_14_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void OnClickedExpertWeapon(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.OnClickedExpertWeapon // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Btn_ExpertWeapon_K2Node_ComponentBoundEvent_15_OnButtonHoverEvent__DelegateSignature(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.BndEvt__Btn_ExpertWeapon_K2Node_ComponentBoundEvent_15_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Btn_ExpertWeapon_K2Node_ComponentBoundEvent_16_OnButtonHoverEvent__DelegateSignature(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.BndEvt__Btn_ExpertWeapon_K2Node_ComponentBoundEvent_16_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void CheckFree(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.CheckFree // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void  »¤ìŠ¤(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C. »¤ìŠ¤ // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ShowFreeAni(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.ShowFreeAni // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void  »¤ìŠ¤(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C. »¤ìŠ¤ // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ExecuteUbergraph_UW-PerkDeckWidget(int32_t EntryPoint); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.ExecuteUbergraph_UW-PerkDeckWidget // (Final|UbergraphFunction|HasDefaults) // @ game+0x2bad3b0
	void CloseOverLay__DelegateSignature(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.CloseOverLay__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
};

