// WidgetBlueprintGeneratedClass UW-Revival_PayPopup.UW-Revival_PayPopup_C
// Size: 0x2cff6a78 (Inherited: 0x2cff6a88)
struct UUW-Revival_PayPopup_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x288(0x08)
	struct UImage* Bg; // 0x290(0x08)
	struct UImage* Image; // 0x298(0x08)
	struct UImage* Image; // 0x2a0(0x08)
	struct UImage* Image; // 0x2a8(0x08)
	struct UImage* Image; // 0x2b0(0x08)
	struct UImage* Image; // 0x2b8(0x08)
	struct UImage* Image; // 0x2c0(0x08)
	struct UImage* Image; // 0x2c8(0x08)
	struct UImage* Image; // 0x2d0(0x08)
	struct UImage* Image; // 0x2d8(0x08)
	struct UImage* Image; // 0x2e0(0x08)
	struct UImage* Image; // 0x2e8(0x08)
	struct UImage* Image; // 0x2f0(0x08)
	struct UImage* Image; // 0x2f8(0x08)
	struct UImage* Image; // 0x300(0x08)
	struct UImage* Image; // 0x308(0x08)
	struct UImage* Image; // 0x310(0x08)
	struct UImage* Image; // 0x318(0x08)
	struct UImage* Image; // 0x320(0x08)
	struct UImage* Image; // 0x328(0x08)
	struct UImage* Image; // 0x330(0x08)
	struct UImage* Image; // 0x338(0x08)
	struct UImage* Image; // 0x340(0x08)
	struct UImage* Image; // 0x348(0x08)
	struct UTextBlock* TextBlock_CurrentGold; // 0x350(0x08)
	struct UTextBlock* TextBlock_Price; // 0x358(0x08)
	struct UUW-ButtonCancle_C* UW-Button1; // 0x360(0x08)
	struct UUW-ButtonOk_C* UW-Button2; // 0x368(0x08)
	struct ABravoHotelCharacter* TargetCharacter; // 0x370(0x08)

	void Construct(); // Function UW-Revival_PayPopup.UW-Revival_PayPopup_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__UW-Button2_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature(); // Function UW-Revival_PayPopup.UW-Revival_PayPopup_C.BndEvt__UW-Button2_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__UW-Button1_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature(); // Function UW-Revival_PayPopup.UW-Revival_PayPopup_C.BndEvt__UW-Button1_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void ExecuteUbergraph_UW-Revival_PayPopup(int32_t EntryPoint); // Function UW-Revival_PayPopup.UW-Revival_PayPopup_C.ExecuteUbergraph_UW-Revival_PayPopup // (Final|UbergraphFunction|HasDefaults) // @ game+0x2bad3b0
};

