// WidgetBlueprintGeneratedClass UW-Revival_MaterialPayPopup.UW-Revival_MaterialPayPopup_C
// Size: 0x2cff6b18 (Inherited: 0x2cff6a88)
struct UUW-Revival_MaterialPayPopup_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x288(0x08)
	struct UImage* Bg; // 0x290(0x08)
	struct UImage* Image; // 0x298(0x08)
	struct UImage* Image; // 0x2a0(0x08)
	struct UImage* Image; // 0x2a8(0x08)
	struct UImage* Image; // 0x2b0(0x08)
	struct UImage* Image; // 0x2b8(0x08)
	struct UImage* Image; // 0x2c0(0x08)
	struct UImage* Img_Bottom2; // 0x2c8(0x08)
	struct UTextBlock* TextBlock; // 0x2d0(0x08)
	struct UTextBlock* TextBlock; // 0x2d8(0x08)
	struct UTextBlock* TextBlock; // 0x2e0(0x08)
	struct UUW-ButtonCancle_C* UW-Button1; // 0x2e8(0x08)
	struct UUW-ButtonOk_C* UW-Button2; // 0x2f0(0x08)
	struct UUW-FreeTicket_C* UW-FreeTicket; // 0x2f8(0x08)
	struct UUW-FreeTicket_C* UW-FreeTicket; // 0x300(0x08)
	struct UUW-FreeTicket_C* UW-FreeTicket; // 0x308(0x08)
	struct ABravoHotelCharacter* TargetCharacter; // 0x310(0x08)

	void Construct(); // Function UW-Revival_MaterialPayPopup.UW-Revival_MaterialPayPopup_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__UW-Button1_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature(); // Function UW-Revival_MaterialPayPopup.UW-Revival_MaterialPayPopup_C.BndEvt__UW-Button1_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__UW-Button2_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature(); // Function UW-Revival_MaterialPayPopup.UW-Revival_MaterialPayPopup_C.BndEvt__UW-Button2_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void ExecuteUbergraph_UW-Revival_MaterialPayPopup(int32_t EntryPoint); // Function UW-Revival_MaterialPayPopup.UW-Revival_MaterialPayPopup_C.ExecuteUbergraph_UW-Revival_MaterialPayPopup // (Final|UbergraphFunction|HasDefaults) // @ game+0x2bad3b0
};

