// WidgetBlueprintGeneratedClass UW-ReplayGuideWidget.UW-ReplayGuideWidget_C
// Size: 0x2cff6aa8 (Inherited: 0x2cff6a88)
struct UUW-ReplayGuideWidget_C : UUserWidget {
	struct UOverlay* FollowCamGuide; // 0x288(0x08)
	struct UOverlay* FreeCamGuide; // 0x290(0x08)
	struct UKeyImageWidget_C* KeyImageWidget_C; // 0x298(0x08)
	struct UKeyImageWidget_C* KeyImageWidget_C; // 0x2a0(0x08)
	struct UKeyImageWidget_C* KeyImageWidget_C; // 0x2a8(0x08)
	struct UKeyImageWidget_C* KeyImageWidget_C; // 0x2b0(0x08)
	struct UKeyImageWidget_C* KeyImageWidget_C; // 0x2b8(0x08)
	struct UKeyImageWidget_C* KeyImageWidget_C; // 0x2c0(0x08)
	struct UKeyImageWidget_C* KeyImageWidget_C; // 0x2c8(0x08)
	struct UKeyImageWidget_C* KeyImageWidget_C; // 0x2d0(0x08)
	struct UKeyImageWidget_C* KeyImageWidget_C; // 0x2d8(0x08)
	struct UKeyImageWidget_C* KeyImageWidget_C; // 0x2e0(0x08)
	struct UKeyImageWidget_C* KeyImageWidget_C; // 0x2e8(0x08)
	struct UKeyImageWidget_C* KeyImageWidget_C; // 0x2f0(0x08)
	struct UKeyImageWidget_C* KeyImageWidget_C; // 0x2f8(0x08)
	struct UKeyImageWidget_C* KeyImageWidget_C; // 0x300(0x08)
	struct UKeyImageWidget_C* KeyImageWidget_C; // 0x308(0x08)
	struct UKeyImageWidget_C* KeyImageWidget_C; // 0x310(0x08)
	struct UOverlay* KillCamGuide; // 0x318(0x08)
	struct UTextBlock* T_Guide; // 0x320(0x08)
	struct UTextBlock* TextBlock; // 0x328(0x08)
	struct UTextBlock* TextBlock; // 0x330(0x08)
	struct UTextBlock* TextBlock; // 0x338(0x08)
	struct UTextBlock* TextBlock; // 0x340(0x08)
	struct UTextBlock* TextBlock; // 0x348(0x08)
	struct UTextBlock* TextBlock; // 0x350(0x08)
	struct UTextBlock* TextBlock; // 0x358(0x08)
	struct UTextBlock* TextBlock; // 0x360(0x08)
	struct UTextBlock* TextBlock; // 0x368(0x08)
	struct UTextBlock* TextBlock; // 0x370(0x08)
	struct UTextBlock* TextBlock; // 0x378(0x08)
	struct UTextBlock* TextBlock; // 0x380(0x08)
	struct UTextBlock* TextBlock; // 0x388(0x08)
	struct UTextBlock* TextBlock; // 0x390(0x08)
	struct UTextBlock* TextBlock; // 0x398(0x08)
	struct UWidgetSwitcher* WidgetSwitcher; // 0x3a0(0x08)

	void SetKillCamGuide(); // Function UW-ReplayGuideWidget.UW-ReplayGuideWidget_C.SetKillCamGuide // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ChangeGuide(enum class ECameraType CameraType); // Function UW-ReplayGuideWidget.UW-ReplayGuideWidget_C.ChangeGuide // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
};

