// WidgetBlueprintGeneratedClass UW-Sight_4X.UW-Sight_4X_C
// Size: 0x2cff6a58 (Inherited: 0x2cff6a88)
struct UUW-Sight_4X_C : UBravoHotelScopeWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x288(0x08)
	struct UCanvasPanel* CanvasPanel; // 0x290(0x08)
	struct UImage* Image; // 0x298(0x08)
	struct UImage* Image; // 0x2a0(0x08)
	struct UImage* Image; // 0x2a8(0x08)
	struct UImage* Image; // 0x2b0(0x08)
	struct UImage* Image; // 0x2b8(0x08)
	struct UImage* Image; // 0x2c0(0x08)
	struct UImage* Image; // 0x2c8(0x08)
	struct UImage* Image; // 0x2d0(0x08)
	struct UImage* Image; // 0x2d8(0x08)
	struct UImage* Image; // 0x2e0(0x08)
	struct UImage* Image; // 0x2e8(0x08)
	struct UImage* Image; // 0x2f0(0x08)
	struct UImage* Image; // 0x2f8(0x08)
	struct UImage* Image; // 0x300(0x08)
	struct UImage* Image; // 0x308(0x08)
	struct UImage* Image; // 0x310(0x08)
	struct UImage* Image; // 0x318(0x08)
	struct UImage* Image; // 0x320(0x08)
	struct UImage* Image; // 0x328(0x08)
	struct UScaleBox* ScaleBox4X_5mm; // 0x330(0x08)
	struct UScaleBox* ScaleBox4X_7mm; // 0x338(0x08)
	struct UScaleBox* ScaleBox4X_SR; // 0x340(0x08)
	struct UWidgetSwitcher* WidgetSwitcher; // 0x348(0x08)
	struct FVector2D NewVar; // 0x350(0x08)

	void SetScopeImageAngle(float NewAngle); // Function UW-Sight_4X.UW-Sight_4X_C.SetScopeImageAngle // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetTexture5mm(); // Function UW-Sight_4X.UW-Sight_4X_C.SetTexture5mm // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetTexture7mm(); // Function UW-Sight_4X.UW-Sight_4X_C.SetTexture7mm // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void SetTextureSniper(); // Function UW-Sight_4X.UW-Sight_4X_C.SetTextureSniper // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void K2_OnSetAllowdAmmo(enum class EWeaponType WeaponType, struct FName& AllowdAmmoName); // Function UW-Sight_4X.UW-Sight_4X_C.K2_OnSetAllowdAmmo // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2bad3b0
	void ExecuteUbergraph_UW-Sight_4X(int32_t EntryPoint); // Function UW-Sight_4X.UW-Sight_4X_C.ExecuteUbergraph_UW-Sight_4X // (Final|UbergraphFunction) // @ game+0x2bad3b0
};

