// WidgetBlueprintGeneratedClass UW-ScenarioTutoialSelect.UW-ScenarioTutoialSelect_C
// Size: 0x2cff6af1 (Inherited: 0x2cff6a88)
struct UUW-ScenarioTutoialSelect_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x288(0x08)
	struct UWidgetAnimation* Ani_FadeOut; // 0x290(0x08)
	struct UWidgetAnimation* Ani_FadeIn; // 0x298(0x08)
	struct UWidgetAnimation* Tutorial_Right; // 0x2a0(0x08)
	struct UWidgetAnimation* Tutorial_Left; // 0x2a8(0x08)
	struct UButton* Button_Main_01; // 0x2b0(0x08)
	struct UButton* Button_Main_02; // 0x2b8(0x08)
	struct UCanvasPanel* CanvasPanel; // 0x2c0(0x08)
	struct UImage* Image; // 0x2c8(0x08)
	struct UImage* Image_Dividing_01; // 0x2d0(0x08)
	struct UImage* Image_Dividing_02; // 0x2d8(0x08)
	struct UImage* Image_Frame_Hover_White01; // 0x2e0(0x08)
	struct UImage* Image_Frame_Hover_White01; // 0x2e8(0x08)
	bool bFinisied; // 0x2f0(0x01)

	void SetPlayAssist(float Flag); // Function UW-ScenarioTutoialSelect.UW-ScenarioTutoialSelect_C.SetPlayAssist // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_Main_01_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function UW-ScenarioTutoialSelect.UW-ScenarioTutoialSelect_C.BndEvt__Button_Main_01_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_Main_01_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // Function UW-ScenarioTutoialSelect.UW-ScenarioTutoialSelect_C.BndEvt__Button_Main_01_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_Main_01_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(); // Function UW-ScenarioTutoialSelect.UW-ScenarioTutoialSelect_C.BndEvt__Button_Main_01_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_Main_02_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature(); // Function UW-ScenarioTutoialSelect.UW-ScenarioTutoialSelect_C.BndEvt__Button_Main_02_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_Main_02_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature(); // Function UW-ScenarioTutoialSelect.UW-ScenarioTutoialSelect_C.BndEvt__Button_Main_02_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_Main_02_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature(); // Function UW-ScenarioTutoialSelect.UW-ScenarioTutoialSelect_C.BndEvt__Button_Main_02_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void CustomEvent(); // Function UW-ScenarioTutoialSelect.UW-ScenarioTutoialSelect_C.CustomEvent // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void CustomEvent(); // Function UW-ScenarioTutoialSelect.UW-ScenarioTutoialSelect_C.CustomEvent // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void Construct(); // Function UW-ScenarioTutoialSelect.UW-ScenarioTutoialSelect_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void ExecuteUbergraph_UW-ScenarioTutoialSelect(int32_t EntryPoint); // Function UW-ScenarioTutoialSelect.UW-ScenarioTutoialSelect_C.ExecuteUbergraph_UW-ScenarioTutoialSelect // (Final|UbergraphFunction) // @ game+0x2bad3b0
};

