// WidgetBlueprintGeneratedClass UW-ScenarioWeaponCraftInfoPopup.UW-ScenarioWeaponCraftInfoPopup_C
// Size: 0x2cff6ac8 (Inherited: 0x2cff6a88)
struct UUW-ScenarioWeaponCraftInfoPopup_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x288(0x08)
	struct UWidgetAnimation* Anim_Glow; // 0x290(0x08)
	struct UImage* Description_Background_Glow01; // 0x298(0x08)
	struct UImage* Description_Background_Glow02; // 0x2a0(0x08)
	struct UImage* Glow01; // 0x2a8(0x08)
	struct UImage* Glow02; // 0x2b0(0x08)
	struct UImage* Image; // 0x2b8(0x08)
	struct UImage* Image; // 0x2c0(0x08)

	void Construct(); // Function UW-ScenarioWeaponCraftInfoPopup.UW-ScenarioWeaponCraftInfoPopup_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void Destruct(); // Function UW-ScenarioWeaponCraftInfoPopup.UW-ScenarioWeaponCraftInfoPopup_C.Destruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2bad3b0
	void ExecuteUbergraph_UW-ScenarioWeaponCraftInfoPopup(int32_t EntryPoint); // Function UW-ScenarioWeaponCraftInfoPopup.UW-ScenarioWeaponCraftInfoPopup_C.ExecuteUbergraph_UW-ScenarioWeaponCraftInfoPopup // (Final|UbergraphFunction) // @ game+0x2bad3b0
};

