// WidgetBlueprintGeneratedClass UW-SecretGrade.UW-SecretGrade_C
// Size: 0x2cff6af4 (Inherited: 0x2cff6a88)
struct UUW-SecretGrade_C : UUserWidget {
	struct UImage* 1; // 0x288(0x08)
	struct UImage* 10; // 0x290(0x08)
	struct UImage* 11; // 0x298(0x08)
	struct UImage* 12; // 0x2a0(0x08)
	struct UImage* 2; // 0x2a8(0x08)
	struct UImage* 3; // 0x2b0(0x08)
	struct UImage* 4; // 0x2b8(0x08)
	struct UImage* 5; // 0x2c0(0x08)
	struct UImage* 6; // 0x2c8(0x08)
	struct UImage* 7; // 0x2d0(0x08)
	struct UImage* 8; // 0x2d8(0x08)
	struct UImage* 9; // 0x2e0(0x08)
	struct UCanvasPanel* CanvasPanel; // 0x2e8(0x08)
	int32_t PrevLevel; // 0x2f0(0x04)

	void SetAutoAimLevel(int32_t NewLevel); // Function UW-SecretGrade.UW-SecretGrade_C.SetAutoAimLevel // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
};

