// WidgetBlueprintGeneratedClass UW-Sight_8X.UW-Sight_8X_C
// Size: 0x2cff6ae0 (Inherited: 0x2cff6a88)
struct UUW-Sight_8X_C : UBravoHotelScopeWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x288(0x08)
	struct UImage* 8XRecticle; // 0x290(0x08)
	struct UCanvasPanel* CanvasPanel; // 0x298(0x08)
	struct UImage* Image; // 0x2a0(0x08)
	struct UImage* Image; // 0x2a8(0x08)
	struct UImage* Image; // 0x2b0(0x08)
	struct UImage* Image; // 0x2b8(0x08)
	struct UImage* Image; // 0x2c0(0x08)
	struct UImage* Image; // 0x2c8(0x08)
	struct UWidgetSwitcher* WidgetSwitcher; // 0x2d0(0x08)
	struct FVector2D NewVar; // 0x2d8(0x08)

	void SetScopeImageAngle(float NewAngle); // Function UW-Sight_8X.UW-Sight_8X_C.SetScopeImageAngle // (BlueprintCallable|BlueprintEvent) // @ game+0x2bad3b0
	void ExecuteUbergraph_UW-Sight_8X(int32_t EntryPoint); // Function UW-Sight_8X.UW-Sight_8X_C.ExecuteUbergraph_UW-Sight_8X // (Final|UbergraphFunction) // @ game+0x2bad3b0
};

