// WidgetBlueprintGeneratedClass VivoxStatWidget.VivoxStatWidget_C
// Size: 0x2cff6b08 (Inherited: 0x2cff6a88)
struct UVivoxStatWidget_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x288(0x08)
	struct UButton* Button; // 0x290(0x08)
	struct UButton* Button; // 0x298(0x08)
	struct UButton* Button; // 0x2a0(0x08)
	struct UButton* Button; // 0x2a8(0x08)
	struct UButton* Button; // 0x2b0(0x08)
	struct UButton* Button; // 0x2b8(0x08)
	struct UButton* Button; // 0x2c0(0x08)
	struct UButton* Button; // 0x2c8(0x08)
	struct UButton* Button; // 0x2d0(0x08)
	struct UButton* Button; // 0x2d8(0x08)
	struct UEditableText* EditableText; // 0x2e0(0x08)
	struct UImage* Image; // 0x2e8(0x08)
	struct UTextBlock* TextBlock; // 0x2f0(0x08)
	struct FString Result; // 0x2f8(0x10)

	void BndEvt__Button_102_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function VivoxStatWidget.VivoxStatWidget_C.BndEvt__Button_102_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function VivoxStatWidget.VivoxStatWidget_C.BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_2_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Function VivoxStatWidget.VivoxStatWidget_C.BndEvt__Button_2_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_1_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature(); // Function VivoxStatWidget.VivoxStatWidget_C.BndEvt__Button_1_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_3_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature(); // Function VivoxStatWidget.VivoxStatWidget_C.BndEvt__Button_3_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_6_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature(); // Function VivoxStatWidget.VivoxStatWidget_C.BndEvt__Button_6_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_5_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature(); // Function VivoxStatWidget.VivoxStatWidget_C.BndEvt__Button_5_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_7_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature(); // Function VivoxStatWidget.VivoxStatWidget_C.BndEvt__Button_7_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_8_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature(); // Function VivoxStatWidget.VivoxStatWidget_C.BndEvt__Button_8_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void BndEvt__Button_9_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature(); // Function VivoxStatWidget.VivoxStatWidget_C.BndEvt__Button_9_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x2bad3b0
	void ExecuteUbergraph_VivoxStatWidget(int32_t EntryPoint); // Function VivoxStatWidget.VivoxStatWidget_C.ExecuteUbergraph_VivoxStatWidget // (Final|UbergraphFunction|HasDefaults) // @ game+0x2bad3b0
};

